# encode = utf-8

five_elements = {
    "木": {"name": "木", "born": "火", "counter": "土", "major": "甲", "minor": "乙"},
    "火": {"name": "火", "born": "土", "counter": "金", "major": "丙", "minor": "丁"},
    "土": {"name": "土", "born": "金", "counter": "水", "major": "戊", "minor": "己"},
    "金": {"name": "金", "born": "水", "counter": "木", "major": "庚", "minor": "辛"},
    "水": {"name": "水", "born": "木", "counter": "火", "major": "壬", "minor": "癸"},
}

#  ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
heavenly_stems = ["", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]

# ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
earthly_branches = ["", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
earthly_branches_relations = {
    "子": {"name": "子", "zodiac": "鼠", "element": "水", "hidden": ["癸", "癸", "癸"]},
    "丑": {"name": "丑", "zodiac": "牛", "element": "土", "hidden": ["己", "癸", "辛"]},
    "寅": {"name": "寅", "zodiac": "虎", "element": "木", "hidden": ["甲", "丙", "戊"]},
    "卯": {"name": "卯", "zodiac": "兔", "element": "木", "hidden": ["乙", "乙", "乙"]},
    "辰": {"name": "辰", "zodiac": "龙", "element": "土", "hidden": ["戊", "己", "癸"]},
    "巳": {"name": "巳", "zodiac": "蛇", "element": "火", "hidden": ["丙", "庚", "戊"]},
    "午": {"name": "午", "zodiac": "马", "element": "火", "hidden": ["丁", "己", "己"]},
    "未": {"name": "未", "zodiac": "羊", "element": "土", "hidden": ["己", "丁", "乙"]},
    "申": {"name": "申", "zodiac": "猴", "element": "金", "hidden": ["庚", "壬", "戊"]},
    "酉": {"name": "酉", "zodiac": "鸡", "element": "金", "hidden": ["辛", "辛", "辛"]},
    "戌": {"name": "戌", "zodiac": "狗", "element": "土", "hidden": ["戊", "辛", "丁"]},
    "亥": {"name": "亥", "zodiac": "猪", "element": "水", "hidden": ["壬", "甲", "甲"]},
}

sixty_loop = ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
              "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
              "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
              "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
              "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
              "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥" 
              ]

relations = ["生", "克", "泄", "耗", "同", "会", "合", "冲", "刑", "害", "破"]

ten_gods = ["比肩", "劫财", "枭神", "正印", "食神", "伤官", "七杀", "正官", "偏财", "正财"]

ten_gods_relationship = {
    "甲": {"甲": "比肩", "乙": "劫财", "壬": "枭神", "癸": "正印", "丙": "食神", "丁": "伤官", "庚": "七杀", "辛": "正官", "戊": "偏财", "己": "正财"},
    "乙": {"乙": "比肩", "甲": "劫财", "癸": "枭神", "壬": "正印", "丁": "食神", "丙": "伤官", "辛": "七杀", "庚": "正官", "己": "偏财", "戊": "正财"},

    "丙": {"丙": "比肩", "丁": "劫财", "甲": "枭神", "乙": "正印", "戊": "食神", "己": "伤官", "壬": "七杀", "癸": "正官", "庚": "偏财", "辛": "正财"},
    "丁": {"丁": "比肩", "丙": "劫财", "乙": "枭神", "甲": "正印", "己": "食神", "戊": "伤官", "癸": "七杀", "壬": "正官", "辛": "偏财", "庚": "正财"},

    "戊": {"戊": "比肩", "己": "劫财", "丙": "枭神", "丁": "正印", "庚": "食神", "辛": "伤官", "甲": "七杀", "乙": "正官", "壬": "偏财", "癸": "正财"},
    "己": {"己": "比肩", "戊": "劫财", "丁": "枭神", "丙": "正印", "辛": "食神", "庚": "伤官", "乙": "七杀", "甲": "正官", "癸": "偏财", "壬": "正财"},

    "庚": {"庚": "比肩", "辛": "劫财", "戊": "枭神", "己": "正印", "癸": "食神", "壬": "伤官", "丙": "七杀", "丁": "正官", "甲": "偏财", "乙": "正财"},
    "辛": {"辛": "比肩", "庚": "劫财", "己": "枭神", "戊": "正印", "壬": "食神", "癸": "伤官", "丁": "七杀", "丙": "正官", "乙": "偏财", "甲": "正财"},

    "壬": {"壬": "比肩", "癸": "劫财", "庚": "枭神", "辛": "正印", "甲": "食神", "乙": "伤官", "戊": "七杀", "己": "正官", "丙": "偏财", "丁": "正财"},
    "癸": {"癸": "比肩", "壬": "劫财", "辛": "枭神", "庚": "正印", "乙": "食神", "甲": "伤官", "己": "七杀", "戊": "正官", "丁": "偏财", "丙": "正财"},
}