# encode = utf-8

article_creating_adventures = """
# 第 3 章：创建冒险 Creating Adventures
处理冒险是作为地下城主最有意思的事情之一。你可以借此表达自己，并设计一些奇幻的地点，以及在其中所遭遇的怪物、陷阱、谜题和战斗。在你设计的冒险中，你说了算。你可以完全按照自己的方式行事。
本质上讲，冒险即是故事。一次冒险与一部小说、一部电影、一期漫画或一部电视剧都有着许多相同的特性。系列漫画和连载电视剧则是更贴切的对比——单个的冒险限制了篇幅，但结合起来则可以创作出一个长编故事。每一期或每一集的冒险连载一起便是一场系列战役。
无论是自创的冒险还是使用已出版的冒险，你都可以在本章中找到建议，来帮你为玩家们创作一段有趣而难忘的经历。
创建一场冒险，包括将探索、社交互动和战斗的场景融合到一个统一的整体中，以满足玩家和战役本身的需要。但它仍不止于此。好故事的基本要素应该引导你贯穿整个过程，才能够让你的玩家体验冒险的故事，而不仅仅是一系列不连贯的遭遇。
"""

article_elements_of_a_great_adventure ="""
# 大冒险的基本要素 Elements of a Great Adventure
最好的冒险都具有若干共同之处。

# 实质性威胁 A Credible Threat
一场冒险需要一个值得英雄们注意的威胁。威胁可以是一名反派或怪物：一个带着一群走狗的反派，各色各样的一群怪物，或是一个邪恶组织。无论他们的本质如何，这些对手都必须有个让英雄们发现并挫败的目的。

# 通俗地陈述精彩转折 Familiar Tropes with Clever Twists
在塔楼里围攻巨龙、兽人和疯狂巫师的冒险似乎有些老套，但这些都是奇幻故事的主流。从酒馆开始一场冒险似乎也很平庸，但这在 D&D 来看仍属正常。只要你与玩家们偶尔在其中积极的做一些改变，这些熟悉的故事元素就足够受用。举个例子，一名神秘人代表国王给冒险者们提供一项任务，而他可能就是乔装的国王本人。塔楼里的那个疯狂法师可能是一群贪婪的侏儒窃贼为保护自己的赃物而制作的幻象。

# 清晰的焦点 A Clear Focus on the Present
冒险发生于当下。补充一点点的历史有时也可以帮助故事情节发展，冒险者也许还会在冒险过程中发现一些有趣的传说。总之，你要让世界历史在当前的形势下清晰明了。一场冒险应该集中描述当前的状况——坏人们都在做什么，而冒险者们又如何参与到故事中，而不是处理过去所发生的事情。

# 举足轻重的英雄们 Heroes Who Matter
冒险应该让冒险者的行为和决定成为重要的事。冒险的过程虽然像小说或电视剧，但它其结果通常都不只单线程。否则玩家们就会觉得自己仿佛被绑在环形列车车头——被设定为无论怎么努力也只能通向唯一一个目的地。例如，如果一个大反派在冒险结尾之前就出现，那么冒险进程就应该允许英雄们前去击败这名反派。

# 迎合所有玩家口味 Something for All Player Types
正如本书简介所述，玩家们会带着不同的期望来到了游戏桌前。而一场冒险则必须考虑到团队中不同玩家和不同角色的需求，并尽可能有效地将他们带入故事中。
首先，你可以考虑三种基本的游戏类型——即探索、社交和战斗，并以此为出发点思考你的冒险内容。如果冒险所包含的三者达到平衡，那么它很可能足够吸引所有类型的玩家。
你为自家创作的战役并不需要吸引世界上的所有玩家，只要满足你桌边的玩家就可以。如果你的玩家对战斗都不怎么感冒，那你就不要提供大篇幅的战斗来推进冒险。

# 意料之外 Surprises
找机会为你的玩家制造惊喜。例如，探索山上一座被毁的城堡时，发现藏在下面的龙墓。长途跋涉穿越荒野时，发现一座仅在满月之夜才出现的塔楼。这些地点总会让玩家们惦记。
太多意外可能会让玩家们恼火，但这些偶尔加入的转折还可以给予玩家们创造性思考并调整战术的机会。例如，你可以在一个地精巢穴里安排一些背着油桶的地精工兵。一名特殊访客的意外到来也可能使对反派庄园的攻击计划变得更加扑朔迷离。
安排战斗遭遇时也可以考虑加入一些怪异的怪物组合。比如一名熊地精军官军阀和他的刺尾狮宠物，或者一群鬼火与一头幼年黑龙结成的同盟。此外还可以安排意外援军，或是为怪物安排一些不同寻常的战术。偶尔加入一些让人分心的“红鲱鱼”，一些欺瞒与剧情转折来让玩家保持警觉，但注意不要做的太过。有时，简单直接的与一名矿石警卫的遭遇在玩家们看来就以及相当的有趣。

# 实用地图 Useful Maps
一场精彩的探险会需要精心设计的地图。荒野中分散着有趣的地标于其他特色时，比一成不变的广袤土地好得多。拥有分支通道和相似岔路的地下城可以让玩家有更多机会选择方向。玩家们为角色选择的机会越多，冒险就越让人捉摸不透。
如果你不擅长绘制地图，那么互联网是个寻找免费冒险地图的好地方，或者在其中找的一些现实世界建筑平面图也可以作为你绘制地图的灵感。当然你还可以通过软件协助来将自己的地图合在一起。

# 已出版的冒险 Published Adventures
如果既没时间也没意愿去写自己的冒险，或是只是想换换口味时，你随时可以选用在售的冒险出版物。每个已出版的冒险都为你准备好进行游戏所需的场景地图、众多 NPC、怪物以及宝藏。已出版的 D&D《新手套装 Starter Set》就包含着一套冒险。
你可以对这些已出版的冒险进行调整，使它更好使用于你的战役，吸引你的玩家。例如，你可以将冒险中的某个反派替换为玩家们已经在你的战役中遭遇过的角色，或者在冒险的背景中加入某些东西，以此使玩家们的角色以冒险设计师们想象不到的方式融入冒险中。
出版物中的冒险无法面面俱到的解释角色们可能采取的行动。但这些冒险的好处是它们可以让你腾出时间，得以在准备游戏时集中突出那些冒险中难以企及的战役剧情发展。
出版的冒险也可以为你提供灵感。你可能不会像它所书写的那样去冒险，但它仍可以激发你的想象力，或者你也可以把其中的一部分提取出来在按自己的需求重新设计。例如，你可能会用上一张神庙的地图，但却用自己选择的怪物填充其中，或者你也可以选用其中的追逐情节作为自己战役中追捕场景的模型。
"""

article_adventure_structure = """
# 冒险故事结构 Adventure Structure
跟每个故事一样，典型的冒险也包含开始、中间与结尾。

# 开头 Beginning
冒险开头会起个引子勾起玩家的兴趣。而优秀的冒险引子还可以为角色们提供一个加入冒险的合理解释。这些冒险者或许偶然发现了一些不该看到的东西，或许怪物在路上攻击了他们，一个刺客忽然出现在他们的生活里，又或者在城门上出现了一条龙。像这样的引子可以立即吸引玩家，让其进入到故事之中。
优秀的冒险应该有一个令人兴奋和专注的开头。想让玩家们回家后还盼着下一回续团，你就得让他们清晰的了解整个故事的发展方向，在产生预想下一步故事发展的意愿。

# 中间 Middle
冒险的中间部分是故事的主体部分。每一次新的挑战里，冒险者所做出的重要选择都会对冒险的结尾有显著的影响。
角色们在冒险过程发现的秘密可能引出新的目的或改变最初的目的。他们对身边事情的看法可能会发生改变。也许关于宝藏的传闻是引诱他们跌入死亡陷阱的诡计。也许在女王宫廷里的所谓间谍实际上是由女王本人策划的阴谋，其目的只是夺取更大的权力。
冒险者们努力挫败对手，而他们的对手也在同一时间里试图实施自己的邪恶计划。这些敌人可能还会努力隐瞒自己的行动，误导可能与自己作对的人，或者直接面对问题，也许就是尝试杀死这些好事者。
谨记一点：玩家的角色就是故事中的英雄。绝对不要让他们成为干看戏而不参与其中的旁观者。

# 结尾 Ending
故事的结尾包围绕故事的高潮——整个冒险所营造的紧张感达到最高峰时的某个场景或遭遇。激动人心的故事高潮应该将玩家们推向危机边缘，角色们的命运也岌岌可危。其结果取决于角色的行动与决定，但最好不要是个既定的结局。
故事结尾不一定要仓促的整理好所有的东西。故事的线索可以暂时搁置，并留待以后的冒险去解决。留下一点未竟的事业，也是用于过渡到另一场冒险的简便方法。
"""

article_adventure_types = """
# 冒险类型 Adventure Types
冒险可以基于地点，也可以基于事件。详述如下。

# 基于地点的冒险 Location-Based Adventures
数不清的战役都奠基于破碎的地下城和偏远的荒野中。
而许多最伟大的 D&D 冒险也都是基于地点的冒险。
创建基于地点的冒险可以被分解为成若干步骤。这里为每个步骤提供了一些相应的表格，让你可以从中选用一些基本要素。此外你也可以依照表格掷骰随机选定要素，也可以把各步骤的次序重新编排。

# 1. 辩明队伍目标 Identify the Party’s Goals
表格“地下城目标”提供了一些驱使或引诱冒险者进入地下城的常见目标。表格“野外目标”为专注于户外探险的冒险提供类似的灵感。表格“其他目标”则提供一些与这两个类型不同，其他的地点型冒险的目标建议。

# d-20 地下城目标 Dungeon Goals
d20 目标
1 阻止地下城中的怪物袭击地表世界。
2 挫败一名反派的邪恶阴谋。
3 消除地下城中的魔法威胁。
4 获取宝藏。
5 为特定目标寻找特定的物品。
6 回收一件藏在地下城的被偷物品。
7 为特定目标寻找所需的情报。
8 拯救一名俘虏。
9 查明前一个冒险队伍的命运。
10 找一名在该地区失踪的 NPC。
11 杀死一头龙或其他具有挑战性的怪物。
12 查明一处奇异地点或现象的本质与源头。
13 追捕逃跑到地下城里避难的敌人。
14 在地下城的中囚禁中逃脱。
15 清除废墟，让它得以重建并让人重新进驻。
16 查明一名反派对地下城感兴趣的原因。
17 为完成一场赌局或仪式必须待在地下城中一段时间。
18 与地下城中的反派进行谈判。
19 躲避地下城以外的威胁。
20 骰两次，并跳过骰值 20。

# d-20 野外目标 Wilderness Goals
d20 目标
1 寻找一个地下城或其他有意思的地点（并在表格“地下城目标”中骰出目标）。
2 评估自然或非自然灾害的范围。
3 把一名 NPC 护送到目标地。
4 避开反派势力耳目并到达目标地。
5 阻止怪物劫掠商队和农场。
6 与远方的城镇建立贸易关系。
7 保护一个前往遥远城镇的商队。
8 为一片新大陆测绘地图。
9 寻找一处新地点来建立殖民地。
10 寻找一种自然资源。
11 狩猎特定的怪物。
12 从遥远的地方回到家。
13 从一名隐居隐士身上获得情报。
14 寻找一个遗失在野外的物件。
15 查明一群失踪探险者的命运。
16 追捕逃跑的敌人。
17 探明一支正在接近的军队及其规模。
18 摆脱暴君的统治。
19 为野外某处抵御攻击者。
20 骰两次，并跳过骰值 20。

# d-20 其他目标 Other Goals
d12 目标
1 夺取要塞、城镇或船只等固守地点的控制权。
2 为某地点抵御攻击者。
3 从聚居地中一处安全地点回收一个物件。
4 从一个商队中回收一个物件。
5 从失踪的船只或商队中回收一个物件或商品。
6 从监狱或战俘营中解救一名囚犯。
7 从监狱或战俘营中脱身。
8 成功通过障碍以获得认可或奖励。
9 渗透进一处固守地点。
10 查明一个鬼屋或其他地点中怪事的源头。
11 干扰一宗买卖。
12 从自然或非自然灾害中拯救一名角色、怪物或物件。

# 2. 辨明重要人物 Identify Important NPCs
使用表格“冒险反派”“冒险盟友”和“冒险主顾”来帮你辩明这些 NPC 的身份。第 4 章还可以帮你让这些 NPC 变得更加生动。

# d-20 冒险反派 Adventure Villains
d20 反派
1 无特定行为趋向的野兽或怪兽
2 执意堕落或统治一方的异怪
3 执意堕落并毁灭一切的邪魔
4 执意掠夺并统治一方的巨龙
5 执意投身掠夺的巨人
6~7 任何行为趋向的不死生物
8 带着神秘目标的精类生物
9~10 类人生物邪教徒
11~12 类人生物征服者
13 类人生物复仇者
14~15 意图夺权的类人生物阴谋主使
16 类人生物犯罪策划者
17~18 类人生物劫掠者或破坏者
19 受某诅咒的类人生物
20 被误导的类人生物狂信者

# d-12 冒险盟友 Adventure Allies
d12 盟友 d12 盟友
1 老练冒险者
2 新手冒险者
3 热心的平民
4 士兵
5 祭司
6 智者
7 复仇者
8 咆哮的失心者
9 天界生物盟友
10 精类生物盟友
11 伪装的怪物
12 装成盟友的反派

# d-20 冒险主顾 Adventure Patrons
d20 主顾 d20 主顾
1~2 退休的冒险者
3~4 本土管治者
5~6 军官
7~8 神庙机构
9~10 智者
11~12 受敬仰的长者
13 神祇或天界生物
14 神秘的精类生物
15 老朋友
16 曾经的老师
17 父母或其他家庭成员
18 绝望的平民
19 参战的商人
20 装成主顾的反派

# 3. 充实地点细节 Flesh Out the Location Details
第 5 章提供了创建和充实一个冒险地点的建议，其中的表格包含一些重点基本要素，可以帮你创建地下城、野外区域或城市等环境设定。

# 4. 找个理想的开场 Find the Ideal Introduction
一场冒险可以开始于一次社交活动，冒险者可以从中得知自己必须做什么，以及为何要做。它可以从一次意外攻击，或从冒险者们偶然得知的情报开始。最优秀的开场可以自然而然的带出冒险的目标与设定。表格“冒险开场”可以帮助激发你的灵感。

# d-12 冒险开场 Adventure Introduction
d12 开场
1 角色们在野外旅行时掉进了脚下忽然出现的陷坑，并被丢进了探险的地点。
2 角色们在野外旅行时注意到冒险地点的入口。
3 角色们在旅途中被怪物袭击，并逃到附近的冒险地点。
4 冒险者们在一副尸体上发现了一张地图。该地图既设定了冒险所在的地图，同时还是该冒险中反派想要之物。
5 一件神秘的魔法物品或者一名凶残的反派将角色们传送到冒险的地点。
6 一名陌生人与酒馆中的角色们套近乎，并怂恿他们前往冒险的地点。
7 一个小镇或村庄需要一些前往冒险地点的志愿者。
8 角色们关心的一名 NPC 需要他们前往冒险的地点。
9 角色们必须服从的一名 NPC 命令他们前往冒险的地点。
10 角色们敬重的一名 NPC 要求他们前往冒险的地点。
11 某个夜晚，所有角色都梦到了进入冒险地点的梦境。
12 一个幽魂在村里出现并引发恐慌。经过调查发现只有进入冒险地点才能让它安息。

# 5. 安排理想的高潮 Consider the Ideal Climax
故事高潮在冒险结尾时满足了此前所有的期望。尽管高潮的故事内容维系于角色们的成败，但表格“冒险高潮”仍然可以提供一些建议来帮你塑造自己的冒险结局。

# d-12 冒险高潮 Adventure Climax
d12 高潮
1 冒险者们在一场血腥的战斗中，面对大反派和他的一众手下们。
2 冒险者们与反派互相追逐，避开沿路的障碍物后，最终赶到反派的庇护所，并在其内或外围进行最后的决战。
3 冒险者们或反派的行为导致了一场灾难性的事件，而冒险家们必须逃脱其中。
4 冒险者们赶到反派所在地时，他所策划的大事已经临近完成。
5 在一个大房间里，反派和两三个助手分别主持着不同的仪式。而冒险者们必须同时破坏所有的仪式。
6 一个盟友在冒险者们快要达到目标时背叛了他们。（谨慎的使用这种高潮，而不要滥用。）
7 一扇通往另一存在位面的传送门开启。另一边的生物蜂拥而至迫使冒险者们在处理反派的同时还要将传送门关闭。
8 当大反派攻击时，四处的陷阱、危害物或活化物件也同时开始攻击冒险者们。
9 冒险者们开始面对大反派时，地下城开始倒塌，而反派此时却试图趁乱逃跑。
10 一个比冒险者们更强大的威胁摧毁了大反派，并开始讲注意力转移到角色们身上。
11 冒险者们必须选择是去追捕逃亡的大反派，还是拯救一名自己关心的 NPC 或是一群无辜的人。
12 冒险者们必须先查明反派的秘密弱点，才有打败该反派的希望。

# 6. 规划遭遇 Plan Encounters
创建好冒险地点以及冒险的故事大纲后，就可以准备安排其中的遭遇。在基于地点的冒险中，大多数遭遇都发生于地图中的得定位置。你可以在冒险地图上的每个房间和每片野外区域，写下一些描述该区域的要点：它的物理特征，以及任何发生在其中的遭遇。这些冒险要点便足以将一张简单的图画纸变成设计好用来娱乐和吸引玩家的遭遇游戏。
参阅本章后面的“创建邂逅”以获取创建独特遭遇的相关指导。

# 基于事件的冒险 Event-Based Adventures
一场基于事件的冒险中其重点在于角色和反派的所作所为，以及由此产生的后果。这些事情发生的地点则是次要的问题。
基于事件的冒险比基于地点的冒险需要更多的准备工作，但仍可以通过一系列简单的步骤来简化这个过程。这些步骤包括一些你可以从中选择冒险要素的表格，或者你也可以按表格随机掷骰来获取灵感。当然，这些步骤与基于地点的冒险一样不是必须要按次序去完成。

# 1. 从一名反派开始 Start with a Villain
反派角色在冒险故事中作用非常关键，而细心塑造这些反派却只能在稍后的时间里获得回报。你可以从前一节的表格“冒险反派”开始，再用第 4 章的信息来帮助充实这些反派人物。
例如，你的反派可以是一个试图为过去的监禁或伤害而寻求复仇的不死生物。不死反派有趣之处在于它过去的伤痛可能发生在几个世纪前，因此只能让引发伤害者的后人作为其复仇对象。可以想象，曾被某教团骑士成员囚禁的一名吸血鬼现正寻找该教团的现任成员施予报复。

# 2. 决定反派的行为 Determine the Villain’s Actions
建好一名反派后，就可以决定这名反派为达成其目的而采取的行动。建一个流程表并在其上列明反派在什么时间做什么事情，并假定其行动时未收冒险者们干扰。
回到上一个例子，你可以设定这名吸血鬼反派杀了几名骑士，然后以气化形态从锁着的门下溜出来。吸血鬼可以让死者看起来像自然死亡，但很快就会查明凶手是一名隐藏在幕后的杀手。
如果你需要进一步的灵感，则可以思考一下反派如何在冒险的过程中展开行动。

# d-6 基于事件的反派行为 Event-Based Villain Actions
d6 ⾏动类型
1 大事件
2 肆意犯罪
3 腐化蔓延
4 单次罪行
5 连环犯罪
6 步进行动

大事件 Big event。该反派的计划打算定于某节日、某占星事件、某神圣（或不洁）的仪式，某王室婚礼、某孩子的诞生日，或者一些类似的特定时间来实行。而反派的所有活动都会围绕着该事件进行准备。
肆意犯罪 Crime Spree。反派的行为会随着时间的推移变得愈加大胆和邪恶。一位杀手可能会先瞄准城市贫民窟的贫民，然后再升级到市场上屠杀，并逐渐增加恐怖程度及尸体数量。
腐化蔓延 Growing Corruption。随着时间推移，该反派的力量与影响不断扩张并影响了更多的受害者。它可能以军队征服新领土，以邪教组织招募新成员，或是制作一场不断蔓延的瘟疫。在发动政变前的数日或数周内，王储可能会试图赢得王国贵族的支持，而工会领袖则会引诱镇议员腐败，或者贿赂监管的官员。
单次罪行 One and Done。该反派犯下一项罪行，然后试图逃避其后果。该反派的目的不是继续实施更多的罪行，而是保持低调并逃离现场。
连环犯罪 Serial Crimes。该反派接连的犯罪，但这些罪行的本质只是在不断的重复，而并没有造成更大的危害或腐败。抓住这样反派的诀窍在于确定罪行背后的模式。连环杀手是最常见范例之一，而你的反派还可以是一名特别偏爱某类建筑的连环纵火犯，一种只影响可以施展某个特定法术的施法者的魔法病症，一个针对某类商人的窃贼，或是一只不断绑架一个又一个贵族并冒充其身份的变形怪。
步进行动 Step by Step。反派在追求目的的过程中按特定的顺序执行一系列特定行动。一名法师可能会去偷取某个制造命匣的物品并以此转化为一个巫妖，而一名邪教徒可能会绑架七个善神的祭司作祭品。或者，该反派可以沿着一条线索寻找复仇的对象，再一个接一个的杀死这些受害者，并逐渐接近其最终目的。

# 3. 决定队伍的目标 Determine the Party’s Goals
你可以用表格“基于事件的目标”来设置队伍的目标。每个目标也可以作为冒险者们被困于反派计划中时的建议，并以此作为挫败该计划的必要手段。
例如，你对照表格骰出 10，则表示该队伍的目标是获得一名统治者或议会的援助。你决定将它与吸血鬼反派的目标联系起来。也许该教团的领袖们曾从这名吸血鬼手中偷来一个装满珠宝的宝箱，而角色们则可以利用该宝箱作为诱饵来诱捕这名反派。

# d-20 基于事件的目标 Event-Based Goals
d20 目标
1 将反派绳之以法。
2 为一名无辜的 NPC 洗刷罪名。
3 保护或隐藏一名 NPC。
4 保护一个物件。
5 查明一种可能由反派造成的怪异现象其本质和源头。
6 找到一名被通缉的逃亡者。
7 推翻一名暴君。
8 揭开一场颠覆统治者的阴谋。
9 为敌对的国家或相争的家族之间进行和谈。
10 来自一个统治者或议会的安全援助。
11 帮助一名反派找到救赎。
12 与一名反派进行和谈。
13 为反叛势力走私武器。
14 阻止一群走私者。
15 收集敌对势力的情报。
16 赢得一场竞赛。
17 确定反派的身份。
18 定位一件偷来的物品。
19 确保一场婚礼顺利进行。
20 骰两次，并跳过骰值 20。

# 4. 辩明重要非玩家角色 Identify Important NPCs
许多基于事件的冒险需要一整套细节完备的 NPC。这些NPC 中有一部分是作为盟军和主顾一类的角色，但其中更多则很有可能成为与冒险者们互动的角色或怪物，只是在冒险者们与其发生互动前，他们之间的态度关系都处于未确定状态。（参阅第 4 章了解更多关于创建 NPC 的信息。）到目前为止，您所确定的冒险元素应该清楚地知道您需要创建哪些支持字符，以及您需要为每个角色生成多少细节。
例如，不太可能参与战斗的 npc 不需要完整的战斗统计数据，就像参与谈判的角色如果有帮助，就会有理想、联系和缺点，比如冒险的盟友或者冒险的赞助者的桌子(在本章前面的“基于位置的冒险”章节)。

# 5. 预料反派回应 Anticipate the Villain’s Reactions
冒险者们追求自己目标并挫败反派的计划时，反派们又会如何回应？他们会以暴力回击还是发出危险的警告？他们会寻求简单方式解决自己的问题，还是创建更复杂的阴谋来对付干扰？
参见你在第 2 步中描述的反派行为。对应其中每个行为引发的事件，冒险者们会作出怎样的反应。如果他们成功阻碍这些行为，此时对反派的总计划又有怎样的影响？反派们又可以如何作弥补？
其中一种跟进反派回应的方法就是使用流程图。这种方法可以描述反派计划随时间线的成长，并勾勒出冒险者挫败计划后反派如何重回正轨。流程图也可以在时间轴上作分支，以记录冒险者可能采取的各种行动及反派对这些行动的回应。

# 6. 详述关键地点 Detail Key Locations
由于地点不再是冒险的焦点，那它们就可以比地下城网络或广阔的野外规模更小更简单。它们可以是某城市的特定地点，甚至仅仅是一个可能爆发战斗或需要进行细致探索的房间，比如王座室、公会总部、吸血鬼的破落庄园，或者骑士们的礼拜堂。

# 7. 选择开场与高潮 Choose an Introduction and a Climax
“基于地点的冒险”一节中的表格“冒险开场”提供了一些可以用以作引导角色们进入冒险事件的有趣设想，包括梦境、鬼故事以及来自他人的单纯请求。同一小节中的表格“冒险高潮”则包含了一些同样适用于事件型冒险的结尾故事。
例如，表格“冒险开场”可以帮你设定冒险者们所关心的一位盟友需要他们的帮助。也许这名 NPC 是一个骑士，他觉得一个吸血鬼正试图杀死自己，或者某个亲朋好友希望找到杀害骑士的凶手。而正是这名 NPC 令吸血鬼的罪行引起了角色们的注意。
纵观表格“冒险高潮”，你可能会设定让这些冒险者用从巢穴中偷来的一箱珠宝引诱吸血鬼。作为额外的转折，你设定吸血鬼的真正目标是在珠宝中找回一条项链。这条项链镶九枚颗宝石，吸血鬼可以用这些宝石打开通往九层地狱的大门。
吸血鬼一旦成功，冒险者们将面临更紧迫的威胁——当一位强大的魔鬼从门扉中走出时，必定会与吸血鬼达成某些远古的契约。

# 8. 规划遭遇 Plan Encounters
创建好大体的冒险故事后，你就可以准备规划那些与冒险事件相关的遭遇。在基于事件的冒险中，遭遇即是反派的计划与角色们前路的相交。你不可能总是准确地预测到什么时候会发生什么事，但大可以创建一个可能发生的遭遇清单。其中还可以整体描述一下反派的势力，其副官和手下的细节，以及与冒险关键地点相关的冒险。
请参阅后文的“创建冒险”以获取自创遭遇的相关指引。

# 神秘事件 Mysteries
神秘事件是一种事件型冒险，通常就是集中讲述冒险者们如何努力解决罪案（通常是抢劫或谋杀）。与悬疑小说的作者不同，地下城主并不是总能预测到角色门会在神秘冒险中做什么事。
反派行为是“肆意犯罪”“单次罪行”或“系列犯罪”时，可能会激发你围绕该反派的罪行进行一场神秘事件冒险。与之类似，如果冒险者们的目的包括确定反派的身份，那也可以成为一场神秘事件。
想要构建一场神秘事件冒险，你可以按照步骤先创建一个基于事件的冒险。然后再考虑三个额外的基本要素：受害者、嫌疑者和线索。

# 受害者 Victim
想想受害者与反派的关系。尽管你可以创建一个不存在这种关系的精彩剧情，但在神秘事件中发现 NPC 们其实与罪案相关的转折总会是令人兴奋的剧情部分。随机杀戮可能同样神秘，但它总是缺乏那种情感上的联系。
你还可以设定受害者与一个或多个冒险者之间有所关联。
万无一失的让冒险者们融入神秘事件的方法，便是将其拖入其中（包括让其本身陈伟嫌疑人），也即是让角色们相熟的人成为受害角色。

# 嫌疑者 Suspects
所有的出演角色应该还包含着各式各样的其他 NPC，他们并未犯罪，但却有动机，有行为，或者有机会参与其中。在调查过程中，嫌疑人可能会很明显，也可能是逐渐被曝光。侦探小说中常用的一种技巧是建立一个封闭的怀疑范围——即状况相近数量有限的个体，作为案件最突出的嫌疑人。
让玩家与冒险者们持续猜测反派身份的一个诀窍，是确保不止一名嫌疑人怀有秘密。而这些嫌疑人被冒险者问及此事时，就算他们本属无辜却仍会表现得紧张并试图撒谎。一场秘密的商业交易，一次违法的事件，一个黑暗的过去，或者一些难以控制的恶习，都是使嫌疑人比没有任何东西可隐藏的NPC 更有趣的缺点。

# 线索 Clues
线索的指向帮助分辨反派的身份。一些线索只是口头言语（包括嫌疑人与目击者的陈述），可以帮助了解事情的来龙去脉。其他则是物质性的线索，比如受害者写下未完成的血书，告诉你死者遗留的珠宝，或者藏在嫌疑人房间里的武器。
线索应该将嫌疑人与罪案联系起来，通常就是对嫌疑人的动机、行为和机会进行披露。一些线索会将错误的嫌疑人与罪案进行联系，并使冒险者们走向错误的方向。直至最终，他们必须找到指向另一方向的其他线索，或者找到证据来洗清该嫌疑人的嫌疑。
用更多的线索填满冒险总比线索稀少好。如果冒险者们迅速的解开了谜题，你可能会感到有些失望，但玩家们却会感到一种成就感。然而，如果谜题太难玩家们甚至会因此变得沮丧。既然你必须考虑到冒险者们会忽略某些线索的可能性，就不妨用一些多余的线索来确保玩家有足够的情报来抓住反派。

# 阴谋斗争 Intrigue
阴谋斗争冒险是围绕权力斗争的事件型冒险。阴谋诡计在贵族的宫廷中司空常见，而权力斗争在商人公会、犯罪集团和寺庙高层中也同样存在。
阴谋斗争不仅仅是黑暗事件和邪恶密谋，还是一场充斥着交换恩惠，提升或降低个人权力，以及糖衣炮弹外交的冒险。
一位王子努力想要成为王位继承人，一个充当女王左右手的侍臣野心勃勃，一名商人想要在敌人的领土中开辟一条贸易路线，都可以作为阴谋斗争的材料。
跟所有的冒险一样，阴谋斗争冒险里玩家与他们的角色也投身其中。如果没人关心国王的大臣是谁，或者谁拥有精灵森林里的伐木权，那将角色们投入到这些问题中心的冒险里也达不到预期的效果。不过，如果获得国王大臣身边的情报可以让角色们得以借用皇家士兵的实力，并以此帮助自己在边境地区要塞御敌，那么玩家们或许会更愿意投入到该场景中。
当冒险者们需要得到一位强大生物的恩惠并因此需要提供某些恩惠时，或者当一位强大的 NPC 妨碍角色们完成目的时，他们便会卷入阴谋斗争的中。本节之前所讨论的一些基于事件的目的本身就足以引发一些阴谋斗争冒险。例如，如果冒险者们必须揭露一场阴谋，为和平条约进行谈判，或从统治者或议会获得援助，则你便可能因此需要一场阴谋斗争冒险。
创建一场阴谋斗争冒险的过程与创建任何事件型冒险相似，但仍有两个主要区别：即如何把握好各反派，以及角色们如何获得影响力。

# 诸反派 Villains
一些阴谋斗争冒险由单一的反派所驱动，比如一位贵族密谋刺杀君主。但一场阴谋斗争冒险仍可能存在多个反派或者完全没有反派人物出现。
没有反派 No Villain。没有反派的情况下，一些阴谋斗争冒险便会围绕交换恩惠进行。这种类型的冒险，可以跳过事件型冒险创建步骤的第 1 步和第 2 步（反派和反派行为），并直接从第 3 步冒险者目的开始。弄清楚为什么冒险者们会参与到阴谋中，然后花时间集中创建与之互动的各种 NPC。
许多反派 Many Villains。一些阴谋斗争冒险的特点是有一群反派出场，而每一个都有着自己的目的、动机和方法。冒险者们可能被卷入一场宫廷争斗中，在国王突然死亡后贵族们互相争夺王位，又或者发现自己正与盗贼公会进行殊死的地盘之争。这种剧本会让你花更多时间来完成第 1 步和第 2步的工作，以将每一位主要 NPC 设定为带有各自流程表的鲜明反派角色。
在第 5 步中，你需要处理每个反派在冒险中遇到对自己的潜在妨碍所作的回应。不过，你不需要花同样的精力去详细描述每个反派的反应，因为很多人反应可能会互相模仿或相互抵消。冒险者们每挫败一个反派的计划，便可能让另一个反派的计划向前推进，而不管被挫败的反派是否做出回应，冒险也因此继续向前发展。

# 影响力 Influence
根据不同的情况，你可能需要用不同的 NPC 或不同的派系来跟进队伍的影响力，甚至可能要单独跟进每个角色的影响力状况。
处理影响的一种方法是将它当成激励。一名角色只有在你同意的情况下才可获得影响力，并且在游戏中实行影响力就必须要将其消耗掉。角色们可以通过帮助 NPC 来获取影响力，并以此促进组织的事业，或展示自己的力量与英雄气概。
跟获得激励一样，角色可以选择花费影响力，使得在进行跟该影响力相关的掷骰时获得优势。
另一种处理影响力的方式，便是把它当做声望 remown（见第 1 章），并允许角色们在宫廷和不同的关键派系中获取声望。

# 框架事件 Framing Events
你可以将整场冒险奠基在一个框架事件上，或者利用这样的事件来吸引玩家的兴趣。表格“框架事件”给出了几个想法，或者你也可以用它们作灵感激发你创作自己的框架事件。

# d-100 框架事件 Framing Events
d100 事件
01~02 君王即位纪念日
03~04 重要事件纪念日
05~06 竞技事件
07~08 商队或货船到来
09~10 马戏团到来
11~12 某重要 NPC 的到来
13~14 魔冢大军到来
15~16 艺术演出
17~18 运动事件
19~20 孩子出生
21~22 重要 NPC 生日
23~24 全民节日
25~26 彗星出现
27~28 纪念过去的灾难
29~30 新神庙落成
31~32 加冕典礼
33~34 议会会议
35~36 春秋分或冬夏至
37~38 处刑
39~40 生育节
41~42 满月
43~44 葬礼
45~46 军校或法师毕业
47~48 丰收节
49~50 圣日
51~52 骑士或其他贵族授勋
53~54 月食
55~58 仲夏节
59~60 仲冬节
61~62 怪物迁徙
63~64 君王的舞会
65~66 新月
67~68 新年
69~70 赦免某囚犯
71~72 位面连接
73~74 行星连线
75~76 祭司授衔
77~78 幽魂大游行
79~80 纪念死于战场的士兵
81~82 王室演说或公开声明
83~84 王室觐见日
85~86 签订某条约
87~88 日食
89~91 联赛
92~94 审讯
95~96 暴力起义
97~98 婚礼或结婚纪念日
99~00 同时发生两个事件（骰两次并跳过 99 或 100 的骰值）

# 困境 Complications
有时候，冒险并不像表面上看起来那么简单。
道义困境 Moral Quandaries
如果你想给角色们来一场没有施法或剑击的危机，可以考虑给冒险添加一个道义困境。道义困境是一种良心问题，冒险者们必须做一个选择，但绝不是可以简单作出的选择。

# d-20 道义困境 Moral Quandaries
d20 困境
1~3 结盟困境
4~6 友谊困境
7~12 荣誉困境
13~16 救援困境
17~20 认同困境

结盟困境 Ally Quandary。冒险者们在两个独立个体的帮助下可以更好的达成目的，而他们各自的专业水平都几乎必不可少。然而这两个 NPC 互相憎恨，即使世界的命运悬而未决他们也拒绝合作。因而冒险者们必须选择最有可能帮助到自己的 NPC。
友谊困境 Friend Quandary。一名或多名角色所关心的一位 NPC 对角色提出一项不可能达到的要求。一位爱慕者会要求一名角色远离某项危险的任务。一个好朋友可能会恳求角色们饶过反派的性命以证明自己跟反派不同是个好人。一个软弱的 NPC 为了重新获得大家的青睐，可能会挺身承担一项重要而危险的任务。
救援困境 Rescue Quandary。冒险者们必须在抓捕或杀伤反派和拯救无辜生命之间作出选择。例如，冒险者们可能得知反派正在附近扎营，同时还知道反派势力的另一部分即将进军一个村庄准备将其烧成废土。角色们必须选择制服反派或保护无辜村民，而村民中甚至还有一些他们的亲戚朋友。
认同困境 Respect Quandary。两个重要盟友向冒险者们提供了相互冲突的指引或建议。可能高阶祭司会建议角色们与附近森林里的军事化精灵群体进行和平谈判，而一位资深武士则敦促他们以一次果敢的突袭来彰显自己的力量。冒险者们无法两方顾及，而无论选择哪一方结盟必定会失去另一方的认同，并导致此后再无法获得失去认同一方势力的协助。

# 转折 Twists
一次转折可能会使故事复杂化，并且令角色们更难以完成自己的目的。

# d-10 转折 Twists
d10 转折
1 冒险者们正与其他有着相同或相反目的的生物进行竞争。
2 冒险者们要确保一名非战斗 NPC 的安全。
3 冒险者们被禁止杀死反派，但该反派却可以毫不怜悯的杀害他们。
4 冒险者们被定下了时间限制。
5 冒险家们收到了虚假或无关的信息。
6 达成一项冒险目的以兑现某项预言或阻止某项预言的实现。
7 冒险者们有两个不同的目的，但他们只能完成其一。
8 达成该目的事实上正默默的帮助该反派。
9 冒险者们必须与已知敌人合作来达成其目的。
10 冒险家们在受魔法强迫（诸如指示术 geas）的情况下前去达成自己的目的。

# 支线任务 Side Quests
你也可以在冒险中途添加一项或多项支线任务，来将角色从由地点或事件定义的主要故事线中短暂抽离。支线任务对角色们完成主要目的并不重要，但成功完成一项支线任务可以为主要目的的完成提供一些增益。

# d-8 支线任务 Side Quests
d8 支线任务
1 找出该区域里的一件特定物品。
2 取回反派占有的一件被盗物品。
3 从该地区的 NPC 处获取情报。
4 拯救一名俘虏。
5 查明一位失踪 NPC 的命运。
6 杀一只特定的怪物。
7 查明该地区奇异现象的本质与源头。
8 确保该地区的一个角色或生物可以提供协助。
"""

article_creating_encounters = """
# 创建遭遇 Creating Encounters
遭遇是整个冒险大故事中的单独场景。
一场遭遇首先，同时也最重要的是它必须要给玩家带来乐趣。第二，你应该可以有逃跑的机会。除此之外，精心设计的遭遇通常有一个直接的目标，也有一些与战役故事主线相关的事物。这些构建到遭遇中的东西同时也预示着未来发生的遭遇。
一次遭遇最终可能有三种可能的结果：角色成功，角色部分成功，或者角色失败。遭遇需要先考虑好所有三种可能，且每种结果都会产生相应的后果，这样玩家们才能感觉到自己的成败至关重要。

# 角色的目标 Character Objectives
当玩家不知道自己该在给定的遭遇中做什么时，期待和兴奋很快就会变成无聊和沮丧。而一个清楚明了的目标可以降低玩家们失去兴趣的风险。
例如，如果冒险的故事主线涉及把一件无价的圣物送到偏远的修道院，则沿途的每一次遭遇都可以加入一个不太重要的目标来推进任务。旅途中遭遇的人可能会将冒险者们看作打算偷取圣物的敌人同伙，或是那些不断威胁修道院的怪物们。
我们期望并鼓励一些玩家自己制造目标。毕竟，整个战役是由你跟玩家们共同创造的财富。例如，一名角色可能试图贿赂敌人而不是与其作战，或者可能会追踪逃跑的敌人以看清他去往何方。无视目标的玩家也必须承当其后果，不过这就涉及设计遭遇的另一个重要内容。

# 目标范例 Sample Objectives
以下的目标可以作遭遇中遇到的基础例子。尽管这些目标都是针对一场冒险中的单次遭遇，但在多次遭遇中使用同样的目标，也可以让你得以将这些遭遇整合为一场冒险中必须解决的更大障碍或麻烦。和解 Make Peace。角色们必须说服两个对立的团体（或其领袖们）结束这场困扰双方的冲突。作为难题时，角色们在某一方或双方人员中都可能存在敌人，又或者一些其他的团体或个人可能会从中煽动冲突，以达成其自己的目的。保护 NPC或物件 Protect an NPC or Object。角色们必须扮演保护者的角色来护卫被拘留的某人或某些物件。作为难题时，在队伍保护下的 NPC 可能陷入诅咒、疾病、倒地等状态而怕受攻击，也可能因年老或年轻而无法战斗，或者会让冒险者们在两难处境中危及性命。而冒险家们发誓保护的物件则可能具有智能，被诅咒，或难以运输。
回收一个物件 Retrieve an Object。冒险者们必须在遭遇区域里获取某个特殊物件的所有权，并且最好在战斗结束前完成。作为难题时，敌人可能会跟冒险者们一样渴望达成该目的，而迫使双方为之而战。
闯过一处关卡 Run a Gauntlet。冒险者们必须穿过一处危险区域。该目标类似回收物件，但其抵达出口的有限级要更高于杀死区域内的敌人。时间限制以及可能导致迷失的岔路也会为其更增加一些更复杂的因素。而其他的难题还包括陷阱、危害物和怪物。
潜入 Sneak In。冒险者们需要移动穿过遭遇区域而不在敌人面前暴露自己的存在。一旦被发现则要面临即将发生的难题。
中断一场仪式 Stop a Ritual。邪教领袖、恶毒邪术师和强大邪魔的阴谋通常都涉及一些必须被阻止的仪式。尝试打断仪式的强大魔法前，角色们通常都要先从一群邪恶手下中打出一条道路以抵达仪式所在处。作为难题时，在角色们抵达的时候仪式可能接近完成，并以此强加一个时间限制。根据仪式的具体内容，当它的完成时可能也会导致某些直接的后果。
打倒某个单一目标 Take Out a Single Target。反派被强大到足以杀死冒险者们的手下们簇拥着。角色们可以选择逃跑并在日后从长计议，或者他们可以试着以自己的方式攻击目标。作为难题时，这些手下可能是处于反派控制下的无辜生物，而冒险者们则必须在想到办法前一直承受这些手下的攻击。

# 创建战斗遭遇 Creating a CombatEncounter
创建战斗遭遇时，你可以想象得更夸张一点以创作出一些能够让玩家们乐在其中的好点子。掌握好细节操作后，你就可以运用该小节的内容来调整遭遇的难度。

# 战斗遭遇难度 Combat Encounter Difficulty
遭遇难度分为四个等级。
简单 Easy。一次简单的遭遇不会消耗角色们的资源或给他们带来严重的危险。他们可能会失去一点生命值，但是胜利还是相当有保障的。
中等 Medium。一次中等的遭遇通常会让玩家们经历一两次惊心时刻，但是不会对角色们造成任何伤亡。只是其中若干人员可能会需要使用治疗资源。
困难 Hard。对冒险者们而言，一次困难的遭遇可能会发展得很糟糕。较弱的角色可能会在战斗中被清除，甚至有较小的可能导致一个或多个角色因此死亡。
致命 Deadly。对某些玩家而言，致命的遭遇可以造成足以致命的后果。此时需要优秀的策略和快速的思考才能确保生还，而队伍失败时也必须承当相应的风险。

# table 角色等级对应的经验阈值 XP Thresholds by Character Level
        ——遭遇难度——
角色等级 简单 中等 困难 致命
lst 25 50 75 100
2nd 50 100 150 200
3rd 75 150 225 400
4th 125 250 375 500
5th 250 500 750 1,100
6th 300 600 900 1,400
7th 250 750 1,100 1,700
8th 450 900 1,400 2,100
9th 550 1,100 1,600 2,400
10th 600 1,200 1,900 2,800
11th 800 1,600 2,400 3,600
12th 1,000 2,000 3,000 4,500
13th 1,100 2,200 3,400 5,100
14th 1,250 2,500 3,800 5,700
15th 1,400 2,800 4,300 6,400
16th 1,600 3,200 4,800 7,200
17th 2,000 3,900 5,900 8,800
18th 2,100 4,200 6,300 9,500
19th 2,400 4,900 7,300 10,900
20th 2,800 5,700 8,500 12,700

# 挑战等级 Challenge Rating
安排一场遭遇或冒险，尤其在低等级这么做时，要谨慎使用挑战等级高于队伍平均等级的怪物。这样的生物用一个动作所造成的伤害可能就足以干倒一个低等级的冒险者。例如，一只食人魔 ogre 挑战等级为 2，不过它用一击就足以杀手一名 1 级的法师。
另外，一些怪物的特性在低级角色看来可能相对困难甚至不可能克服。例如，邪兽鬼 rakshasa 挑战等级为 13，并且免疫 6 环和更低环阶的法术。12 级或更低等级的施法者不具备 6 环以上法术的施法条件，这就意味着他们将无法用自己的魔法来影响邪兽鬼，并因此而处于严重的劣势。这样的遭遇会比怪物挑战等级所表示的难度要困难的多。

# 评估遭遇难度 Evaluating Encounter Difficulty
使用以下方法来判断任何战斗遭遇的难度。
1．确定 XP 阈值 Determine XP Thresholds。首先，确定队伍中每个角色的经验值（XP）阈值。表格“角色等级对应XP 阈值”为每个等级的角色提供了四个 XP 阈值，分别对应着四个等级的遭遇难度。按照角色的等级来确定其 XP 阈值。并为队伍中的每个角色重复这个程序。
2．确定整个队伍的 XP阈值 Determine the Party’s XPThreshold。每个难度级别的遭遇所对应的队伍 XP 阈值，即是相应难度各角色的 XP 阈值相加。你最后会得到四个总值，对应着每个遭遇难度等级。例如，如果你的队伍包含三个 3 级角色和一个 2 级角色，则队伍的 XP 阈值总值如下：
简单：275 XP（75＋75＋75＋50）
中等：550 XP（150＋150＋150＋l00）
困难：825 XP（225＋225＋225＋150）
致命：l,400 XP（400＋400＋400＋200）
记下这些总值，以方便在冒险的每次遭遇中用使用。
3. 结算怪物总经验值 Total the Monsters’ XP。将遭遇中所有怪物的 XP 相加。每个怪物的 XP 都写在其资料板中。
4．调整复数怪物总经验值 Modify Total Xp for MultipleMonsters。如果遭遇的怪物不止一个，那你就需要将怪物的总 XP 乘上一个倍数。结堆的怪物越多，在给定的一轮里你对角色们发动的攻击检定也就越多，而这场遭遇就变得越加危险。为了正确地判断一场遭遇的难度，就必须按照表格“遭遇倍数”中给出的数值为所有怪物的总 XP 乘上一个倍数。
例如，如果一次遭遇包含的四个怪物总值为 500 XP，那么你就要将怪物的总 XP 增至 2 倍，调整后的值为 1000 XP。
这个调整值并不是怪物们在 XP 方面的价值。调整后的数值唯一目的价值只是帮你准确地评估改遭遇的难度。
进行该计算时，不必计算那些挑战等级明显低于其他怪物平均挑战等级的个体，除非你认为这些羸弱的怪物会显著地增加该遭遇的难度。

# table 遭遇倍数 Encounter Multipliers
怪物数量 倍数
1 x 1 
2 x 1.5 
3~6 x 2 
7~10 x 2.5
11~14 x 3
15 或更高 x 4

5．比对经验值 Compare XP。
比较调整后的怪物总 XP 值与队伍的各 XP 阈值。与调整后怪物总 XP 值相等的阈值对应了本次遭遇的难度。如果没有等值，则使用低于调整后怪物总XP 值的最接近阈值。
例如，一次遭遇的怪物包括一只熊地精 bugbear 和三只大地精 hobgoblin 时，其调整后的 XP 值为 1,000，当它作为一个包含三名 3 级角色和一名 2 级角色的队伍遭遇时（该队伍困难遭遇阈值为 825 XP 而致命遭遇阈值为 1,400XP），其难度为困难。

# 队伍规模 Party Size
前文的指引假定了你的队伍包含三到五名冒险者的情况。
如果组成队伍的角色数量少于三个，则应用表格“遭遇倍数”时必须选用下一个更高的倍数。例如，当角色们与一个怪物战斗时应用 1.5 倍的乘数，而当怪物团体增至十五个甚至更多时则为其应用 5 倍的乘数。
如果组成队伍的角色为六个或更多时，则应用表格中下一个更低的倍数。并用 0.5 倍的乘数来对应单一怪物的情况。

# 多重遭遇 Multipart Encounters
有时，一次遭遇会面对复数的敌人，而队伍不一定会立即对付所有敌人。比如怪物们一波接一波的涌向队伍时。这种遭遇情况下，可以把每个独立的部分或每一波攻击当作一次单独遭遇来确定其难度。
一支队伍在多重遭遇的各部分的间隙时间里不能以短休获益。因此他们不能用生命骰来恢复生命值，也无法重获任何需要完成短休来恢复的能力。一般来说，如果复数遭遇中某个调整后的怪物 XP 总值超过队伍当日冒险预期 XP 总值的三分之一（见下文的“当日冒险”），则本次遭遇将比所有其他部分遭遇加起来的难度更高。

# 按预算构建遭遇 Building Encounters on a Budget
构建遭遇的难度应该合理，该难即难。队伍的 XP 阈值相当于你花费来构建怪物的 XP 预算，并以此选择建立简单、中等、困难和致命的遭遇。但请牢记一点，即怪物组合所消耗的预算比其基本 XP 值所表示的要多（见第 4 步）。
以第 2 步所述的队伍为例，你为其构建中等遭遇时只要确保调整后的怪物 XP 值至少为 550 XP（该队伍中等遭遇阈值），且不得超过 825 XP（该队伍困难遭遇阈值）即可。一个挑战等级 3（诸如刺尾狮 manticore 或枭熊 owlbear）的单一怪物价值 700 XP，这就足以满足该预算。如果您想要一对怪物，则其中每个都将算作价值其基本 XP 值的 1.5 倍。一对恐狼 dire wolves（每只价值 200 XP）其调整后的 XP 值即为 600，于是它们也满足该队伍的总等遭遇条件。
附录 B 中列出了几份将《怪物图鉴》中的怪物按挑战等级重新排列的清单，以方便大家应用该方法。

# 当日冒险 The Adventuring Day
假设在冒险状态普通，运气一般的状况下，大多数冒险队伍可以在一日处理六到八次中等或困难难度的遭遇。若是简单遭遇，则冒险者们可以处理更多；而若是致命遭遇，他们能处理的次数就得减少。
你可以用跟评估遭遇难度相同的方法，以冒险中怪物和其他对手的 XP 数值作参考数据来考察队伍能够走多远。
为队伍中的每个角色应用表格“当日冒险 XP”来评估其每日可赢取的 XP 数。将队伍里所有成员的该数值相加便是该队伍当日冒险的总 XP 价值。这样就可以粗略的计算出在角色们需要进行一次长休前，队伍可处理遭遇的校正 XP 值。

# table 当日冒险经验 Adventuring Day XP
等级 每日每名角色校正 XP
1st 300 
2nd 600 
3rd 1,200 
4th 1,700 
5th 3,500 
6th 4,000 
7th 5,000 
8th 6,000 
9th 7,500 
10th 9,000 
11th 10,500
12th 11,500
13th 13,500
14th 15,000
15th 18,000
16th 20,000
17th 25,000
18th 27,000
19th 30,000
20th 40,000

# 短休 Short Rests
总的来说，在充满冒险的一日中，队伍可能需要进行两次短休，大约就在一天进程的三分之一和三分之二的时间。

# 调整遭遇难度 Modifying Encounter Difficulty
根据所选的地点和状况，你可以将异常遭遇设定的更容易活更困难。
如果角色们带着某种敌人没有的短板，则将该遭遇难度提升一个等级（比如从简单提升为中等）。而如果角色们带着某种敌人没有的增益，则将该遭遇难度降低一个等级。每一项增益或短板都可以将遭遇的难度在其评估等级上进行改变。
如果角色们同时有一种增益和一个短板，则两项相互抵消。
短板的状况包括以下几点：
• 整个队伍被突袭，而敌人没有。
• 敌人身处掩护中，而队伍没有。
• 角色们无法看见敌人。
• 角色们每轮都受到一些环境效应或魔法来源的伤害，而敌人没有。
• 角色们正攀在一根垂下的绳索上攀爬一堵峭壁或悬崖，或者身处被困地板上等情况，由于移动受到极大的阻碍而成为易受攻击的靶子。
增益的状况与短板相似，只是获益的对象转为角色们而非敌人。

# 趣味性战斗遭遇 Fun Combat Encounters
以下的特征可以为战斗遭遇带来更多乐趣与悬念：
• 对角色们和其敌人同时造成固有风险的地形特征，比如一条磨损的绳桥和一滩绿软泥。
• 造成高低变化的地形特征，比如陷坑、一堆空的板条箱、壁架和阳台。
• 激发或迫使角色们和其敌人四处移动的特征，比如垂吊灯、油桶火药桶群，以及旋转的刀刃陷阱。
• 敌人身处难以到达的地点或防御位置，因此通常有一定攻击范围的角色被迫在战场上来回移动
• 不同类型的怪物混在一起
"""

article_random_encounters = """
# 随机遭遇 Random Encounters
角色们在探索野外区域或地下城网络时，必定会遭遇到一些意想不到的事物。随机遭遇便是表示这种意外性的手段。它通常以表格的形式呈现。一场随机遭遇发生时，你掷一次骰子然后按表格查找出队伍的遭遇。
一些玩家和 DM 将冒险中的随机遭遇视为浪费时间，不过精心设计的随机遭遇仍可以实现多种不同的作用：
• 制造紧迫感 Create urgency。如果随机遭遇的威胁笼罩在冒险者们头上，他们就不会磨磨蹭蹭。想要避开游荡的怪物，就会有强烈的动机去寻找一处安全的休息场所。（DM 在帷幕后掷骰时，即使没有实际发生遭遇也能实现这种效果。）
• 营造气氛 Establish atmosphere。以一些与主题相关的生物进行随即遭遇，有助于为冒险营造一种一致的基调和氛围。例如，随即遭遇表中摆满蝙蝠 bat、缚灵 wraith、巨大蜘蛛 giant spider 和僵尸 zombie 就可以营造一种恐怖感，并让冒险者们准备与更强大的夜行生物作战。
• 消磨角色资源 Drain character resources。随机遭遇可以消磨队伍的生命值和法术位，让冒险者们感到动力匮乏和脆弱。玩家迫于角色力量的限制必须作出选择，并由此产生紧张感。
• 提供援助 Provide assistance。一些随机遭遇可以让角色们受益，而不是是他们收到阻碍或伤害。有帮助的生物或 NPC可能会在他们最需要的时候为他们提供有用的信息或帮助。
• 增加趣味 Add interest。随机遭遇也可以揭示一些世界的细节。可以用来预示危险或提供线索，帮助冒险者们准备迎接即将到来的其他遭遇。
• 突出战役主题 Reinforce campaign themes。随机遭遇可以让玩家们始终围绕在战役的大主题中。例如，如果战役的设定为两国间持续不断的战争，你可能会设计一个突出持续战争本质的随机遭遇表。在友方领土里，你的表格可能包括从战场归来的士兵，逃离侵略部队的难民，全副武装的商队，以及骑在马背上的孤独信使。而角色们身处敌方领地时，表格可能包括一些战场产物如最近被杀者，在行军中的邪恶类人生物军队，以及那些试图逃离冲突却被即场绞杀的逃兵，只留下一片吊起的尸体。
随机遭遇不该让你或你的玩家感到厌烦。你不会想让玩家们在不断随机遭遇的过程中停滞不前，而觉得进展缓慢。同样你也不希望在随机遭遇里花时间分心而对冒险故事没有任何帮助，甚至干扰你想要设定的整体节奏。
并不是每个 DM 都喜欢使用随机遭遇。你可能会觉得它会分散你的注意力，或者会给你带来更多的麻烦，而这都是你不想要的结果。如果随机对你没有帮助就不要使用它们。

# 触发随机遭遇 Triggering Random Encounters
你会想要让随机遭遇发生在游戏叙述的合适阶段，而不是出现得不合时宜。因此你必须谨慎选择遭遇发生的位置。思考一下情况的随机遭遇：
• 玩家们开始偏离主题，游戏节奏也开始放缓。
• 角色们停下来进行短休或长休。
• 角色们经历完一段漫长而平淡的旅程。
• 角色们应该保持低调的时候，引起了别人的注意。

# 随机遭遇检定 Checking for Random Encounters
你决定什么时候会发生随机遭遇或者掷骰决定。考虑将随机遭遇检定的时间定位每小时一次、每 4 到 8 小时一次或每日一次和每长休一次，而其具体频率必须根据所处地区的活跃程度作出最合理的决定。
如果决定掷骰，则可以选用 d20 来实现。骰值为 18 或更高时发生随机遭遇。然后，对应随机遭遇表骰出冒险者们要面对的状况，而如果给出的结果与当前形势不符，则重新掷骰。
随机遭遇表可以是你正在进行的冒险中的一部分，也可以由你按本章的信息自行创建。创建自己的表格是巩固你自家战役风格和主题的有效方法。
并不是每次与其他生物的接触都属于随机遭遇。遭遇表中通常不包括兔子在灌木丛中跳跃，无害的老鼠在地下城里乱跑，或是普通市民在城市的街道上行走。随机遭遇表可以呈现出推进阴谋的障碍和事件，预示冒险的主题或重要元素，并提供一些有趣的干扰。

# 创建随机遭遇表 Creating Random Encounter Tables
创建自己的随机遭遇表非常直观。确定在一个给定的地下城区域中可能发生的遭遇，再找出某一特定遭遇发生的可能性，然后安排结果。在这种情况下的“遭遇”可能只是一个单一的怪物或 NPC，也可能是一群怪物或 NPC，一个随机事件（比如大地震动或游行），或随机发现（比如烧焦的尸体或墙上潦草的信息）。
整合你的遭遇 Assemble Your Encounters。一旦确定冒险者们可能经过的地方（通常是野外区域或地下城网络），你就可以列出一串可能在该处游荡的生物。如果你不确定其中有哪些生物，则可以在附录 B 对应地形的清单中查找相应的怪物。
对应木族林地，你创建的表格可以包括人马 centaurs、妖精龙 faerie dragon、皮克精 picies、小妖精 sprites、树精 dryads、半羊人 satyrs、闪现犬 blink dogs、麋鹿 elks、枭熊 owlbears、树人 treants、巨猫头鹰 giant owls 和独角兽 unicorn。如果森立中住着精灵，那表格中也可以包含精灵德鲁伊 elf druids 和精灵斥候 elf scouts。豺狼人们也许也正威胁着森林，在表格里加入豺狼人 gnolls 和鬣狗 hyenas 也可以给玩家们一个意外惊喜。游荡的捕猎者是另一种有趣的意外惊喜，比如一只喜欢捕食闪现犬的移位兽 displacer beast。该表格还可以使用一些地破坏性的自然现象遭遇，比如一丛被烧毁的树木（由豺狼人一手造成），一尊覆满常春藤的精灵雕像，甚至是一株长着发光浆果的植物，吃掉这些果子的生物还可以隐形。
为遭遇表选择怪物的时候，你可以先设想这些怪物为何其巢穴外与人遭遇。每只怪物在忙着做什么？它们是否在巡逻？是否在猎食？是否在寻找某物？还要思考生物在穿越该区域时是否在进行隐匿行动。
和安排好的遭遇一样，随机遭遇发生在令人难忘的地点时更有趣。冒险者们户外活动时可能会经过一片林中空地，并在其中遭遇一头独角兽，或者被追赶着进入一片密林地区并遇到一窝蜘蛛。穿越沙漠时，角色们可能发现一个四周环绕着尸妖 wight 的绿洲，或是栖息在一片裸露岩地中的一头蓝龙blue dragon。
概率 Probabilities。随机遭遇表可以制作成许多种不同的使用方式，有的非常简单（骰 ld6 以从六个可能遭遇中选择其一），有的可以很复杂（掷百分骰，依照当前日期修正，并依所在地下城层级的数目对照索引）。这里展示的遭遇表范例使用了一个从 2 到 20 的范围数值（总共十九个条目），使用1d12+1d8 生成。其概率曲线确保表中段的骰值出现的概率比两端极限值得概率更高。骰值 2 或 20 比较罕见的（大概 1%的几率），而从 9 到 13 的每个骰值则都有 8%多一点的几率。
表格“木族之森遭遇”是个按照上述思路创建的随机遭遇表。其内用粗体字表示的生物名称可以在《怪物图鉴》中找到相应怪物的资料板。

# d-12+d-8 木族之森遭遇 Sylvan Forest Encounters
d12+d8 遭遇
2 1 只移位兽 displacer beast
3 1 只豺狼人群主 gnoll pack lord 和 2d4 的豺狼人
4 1d4 的豺狼人 gnoll 和 2d4 的鬣狗 hyena
5 一丛烧焦的树木。搜索该区域的角色们进行一次DC10 的感知（生存）检定并成功通过后将发现豺狼人的踪迹。尾随踪迹 1d4 小时后将遭遇一群豺狼人，或者发现死去的豺狼人尸体，其长满跳蚤的尸体上还插着精灵的弓箭。
6 1 只巨猫头鹰 giant owl
7 一尊覆盖着常春藤的塑像，刻画着一名精灵神祇或英雄
8 1 只树精 dryad（50%）或 1d4 的半羊人 satyrs（50%）
9 1d4 的人马 centaurs
10 2d4 的斥候 scouts（精灵）。其中一名斥候带着一把号角。号角可以由该斥候用他的动作吹响，而一旦号角在森林中吹响，则再骰一次该表。如果骰值为怪物遭遇，则相应的怪物将在 1d4 分钟后到达。应此而来的生物除豺狼人、鬣狗、枭熊和移位兽外都对这些斥候态度友好。
11 2d4 的皮克精 picies（50%）或 2d4 的小妖精 sprites（50%）
12 1 只枭熊 owlbear
13 1d4 的麋鹿 elks（75%）或 1 只巨麋鹿 giant elk（25%）
14 1d4 的闪现犬 blink dogs
15 一棵长着 2d4 枚发光浆果的魔法植物。吃掉一枚这种浆果的生物会在接下来的 1 小时里变成隐形状态，或者直到它发动攻击或施展法术。被采下的浆果在 12 小时之后便会失去了魔力。浆果在午夜时分便会重新长出，但如果所有浆果都被采摘下来，这棵植物就会失去魔法并不再长出浆果。
16 一缕微风带着精灵的曲调轻轻吹过。
17 1d4 的橙色（75%）或蓝色（25%）的妖精龙 faerie dragons
18 1 名德鲁伊 druid(精灵)。该德鲁伊最初对队伍态度冷淡，但如果角色们同意帮忙解决林中的豺狼人侵扰，他的态度就会转为友好。
19 1 个树人 treant。如果队伍中有精灵，或者有人带着一只可见的精类生物，则该树人对大家态度友好。如果角色们带着明火，则树人的态度将转为敌对。否则它将维持冷漠并在角色们经过时不声不响。
20 1 只独角兽 unicorn

# 随机遭遇战力 Random Encounter Challenge
随机遭遇的难度不一定要与冒险者的战力相符，但用一场随机遭遇来让队伍全灭克不是什么好点子，这样的结局根本无法让玩家们满足。
并不是所有涉及怪物的随机遭遇都需要通过战斗解决。
一个 1 级的冒险队伍可能会随机遭遇到一只在森林上空盘旋着寻找肉食的幼龙，而角色们此时可以选择躲藏，或者如果被这条龙发现时，也可以选择跟其商谈以求活路。类似的情况下，队伍可能会遇到一个在山丘中漫步的石巨人，而他也许并没有伤害任何人的打算。事实上，由于其隐居的本性他更可能会选择躲开队伍离去。这名巨人可能只会攻击那些故意惹恼自己的人。
也就是说，一个随机遭遇表通常包含了一些敌对的（尽管不一定是邪恶的）怪物。以下怪物可以用于合适的战斗挑战：
• 单独一只怪物，其挑战等级等于或低于队伍的等级。
• 一群怪物，其调整后的 XP 值对该队伍构成简单、中等或困难难度的遭遇，如同本章前文构建遭遇的指引所述。
"""