# encode = utf-8

article_adventure_environments = """
# 第 5 章：冒险环境 Adventure Environments
许多 D&D 的冒险故事都是围绕着一个地下城进行设定。D&D 里的地下城包括了宽敞的大堂和陵墓，隐藏在地下的怪物巢穴，迷宫般的死亡困境，在地表之下绵延数里的自然洞窟群，和城堡的废墟。
并不是所有冒险都发生在地下城中。为穿越荒芜沙漠Desert of Desolation 而在野外度过的长途跋涉，或是进入恐怖之岛 Isle of Dread 丛林里经历的可怕旅途，也都是一场激动人心的冒险之旅。在广阔的户外，各种龙在空中寻找猎物，大地精部族从森严的堡垒中汹涌而出向邻居们发动战争，食人魔掠夺农庄的食物，还有那怪物般的蜘蛛从蛛网覆盖的大树上落下。
冒险者们在地下城时被束缚在周围的墙壁与门户之间，而在荒野中，他们完全可以向任何想要的方向旅行。这正是地下城与荒野之间的关键区别：在地下城中由于选择有限，队伍更容易预测其前进的方向，而在野外就没这种限制。
危险世界里的村庄、小镇和城市依然是文明的摇篮，但它们也会提供一些冒险机会。城市围墙内看似不可能与怪物遭遇，但城中环境依然有其独特的反派和危机。毕竟，邪恶有多种形式，而城中环境也并不总是如表面所见那样，是个安全的避风港。
本章提供的概览包含了三种常见环境，以及一些非常规的环境，以让大家体会创建冒险地点的过程。其中还提供了大量的随机表格来激发你的灵感。
"""

article_dungeons = """
# 地下城 Dungeons
一些地下城是被其建造者抛弃的旧据点。还有一些是自然形成的洞窟群，或者是由邪恶怪物雕刻成的诡异巢穴。邪恶教团、怪物部族和一些离群的生物受会其吸引聚集。此外，地下城还是远古宝藏的安家处：钱币、宝石、魔法物品和其他贵重物品隐藏在此间的黑暗中，通常还有伴有守卫的陷阱，或是由收集它们的怪物小心翼翼地保管着。

# 构筑地下城 Building a Dungeon
开始构筑地下城前，你可以先想想它有哪些独特的性质。例如，作为大地精要塞的地下城和蛇人栖息其中的远古神庙其特质完全不同。本节主要是阐述创建一个地下城并使其更生动的操作程序。

# 地下城所在地 Dungeon Location
你可以使用表格“地下城所在地”来确定你的地下城所在的地方。你可以按表格掷骰，或直接选择一个有灵感的条目。

# d-100 地下城所在地 Dungeon Location
d100 所在地
01~04 某城市里的建筑
05~08 某城市地底的下水道或地下墓穴
09~12 某农舍地底
13~16 某墓地地底
17~22 某城堡废墟地底
23~26 某城市废墟地底
27~30 某神庙地底
31~34 某裂谷里
35~38 某悬崖石壁上
39~42 某沙漠里
43~46 某森林里
47~50 某冰川里
51~54 某峡谷里
55~58 某丛林里
59~62 某山隘口中
63~66 某沼泽里
67~70 某台地的地底或顶上
71~74 海洋洞穴里
75~78 若干相连的台地上
79~82 某山峰上
83~86 某海岬上
87~90 某座岛上
91~95 水下
96~00 骰表格“奇异地点”

# d-20 奇异地点 Exotic Location
d20 所在地
1 某棵树的树枝后面
2 某间歇泉旁
3 某瀑布后
4 埋在某处雪崩下
5 埋在某处沙尘暴里
6 埋在某火山灰中
7 沉没在某沼泽里的城堡或建筑物
8 某沉洞底部的城堡或建筑物
9 漂浮在海上
10 在某颗陨石上
11 在某半位面或某口袋异次元中
12 在某个被魔法灾难毁灭的区域里
13 在某朵云中
14 在妖精荒野
15 在堕影冥界
16 在某地下海的某座岛上
17 在某座火山里
18 在某个超巨型活体生物的背上
19 密禁在某个魔力穹顶里
20 在某个摩邓肯豪宅术 Mordenkainen’s magnificentmansion 里

# 地下城建造者 Dungeon Creator
一座地下城会折射出其建造者的某些性质。一座爬满丛林植物的蛇人失落神庙，其内会用斜坡代替阶梯。由眼魔的解离眼波射线雕刻而成的洞窟则会出现一些不自然的光滑墙壁，而眼魔的巢穴可能还包括有一些连接不同层面的垂直竖井。
水陆两栖的怪物如寇涛鱼人和底栖魔鱼会利用水体来保护自己的巢穴的最深处，以抵御呼吸空气的入侵者。
一些细节可以将地下城的个性显得更加生动。长着大胡子的肖像会雕刻在矮人要塞的大门上，又或者可能会遭到现在居住其内的豺狼人破坏。蜘蛛网的装饰、拷问室和奴隶围栏是卓尔圆顶建筑里的标配特征物，并以此彰显其所在位置以及其居住者的身份。
表格“地下城建造者”包括了那些会建造地下城的典型生物。你可以从表格中选择一个建造者或是随机掷骰选择，又或者选择其他适合你当前战役的地下城建造者。

# d-20 地下城建造者 Dungeon Creator
d20 建造者
1 眼魔
2~4 异教或宗教组织（骰表格“异教或宗教组织”确定）
5~8 矮人
9 精灵（包括卓尔）
10 巨人
11 大地精
12~15 人类（骰表格“角色阵营”以及“角色职业”确定）
16 寇涛鱼人
17 巫妖
18 夺心魔
19 蛇人
20 无建造者（自然洞窟）

# d-20 异教与宗教组织 Cults and Religious Groups
d20 异教或宗教组织
1 崇拜恶魔的邪教
2 崇拜魔鬼的邪教
3~4 气元素异教
5~6 土元素异教
7~8 火元素异教
9~10 水元素异教
11~15 崇拜某邪恶神祇
16~17 崇拜某善良神祇
18~20 崇拜某中立神祇

# d-20 角色阵营 NPC Alignment
d20 阵营
1~2 守序中立 
3~4 中立善良 
5~6 混乱善良 
7~9 守序中立 
10~11 绝对中立
12 混乱中立
13~15 守序邪恶
16~18 中立邪恶
19~20 混乱邪恶

# d-20 角色职业 NPC Class
d20 职业
1 野蛮人
2 吟游诗人
3~4 牧师
5 德鲁伊
6~7 战士
8 武僧
9 圣武士
10 巡林客
11~14 游荡者
15 术士
16 邪术师
17~20 法师

# 地下城用途 Dungeon Purpose
除非是天然的洞窟，否则这些地下城都是精心设计的产物，并且都有一个特定的用途，并以此影响它的设计和其具有的各种特征物。你可以从表格“地下城的用途”中选择一个用途，或用其进行随机掷骰，也可以使用你自己的想法。

# d-20 地下城用途 Dungeon Purpose
d20 用途
1 死亡困境
2~5 巢穴
6 迷宫
7~9 矿场 
10 异界之门
11~14 要塞
15~17 神庙或圣地
18~19 陵墓
20 宝库

死亡困境 Death Trap。这种地下城会用来消灭任何胆敢进入其内的生物。一个死亡困境可能会用来保护一位失心法师的宝藏，或是设计用来将冒险者带往死地以实现一些邪恶目的，比如用其灵魂供给一个巫妖的魂匣。
巢穴 Lair。巢穴是怪物居住的地方。典型的巢穴包括有各种废墟和洞穴。
迷宫 Maze。迷宫旨在欺骗或迷惑进入其中的人。有些迷宫是为保护宝藏而精心设计的障碍，而另一些则是为了将囚犯流放其内，被里面的怪物追杀吞噬。
矿场 Mine。废弃的矿场很快就会充斥着各种怪物，那些挖得太深的矿工还可能连通到幽暗地域 Underdark。
异界之门 Planar Gate。建在异界之门周围的地下城经常因传送门中渗出的位面能量而发生变化。
要塞 Stronghold。作为要塞的地下城可以作为反派和怪物们的安全基地。它通常由一名强大的个体统治（比如法师、吸血鬼或龙），且通常比普通的巢穴更庞大，更复杂。
神庙或圣地 Temple or Shrine。这种地下城受神祇或其他位面实体感召。该实体的崇拜者控制着地下城，并在其中举行各种仪式。
陵墓 Tomb。陵墓时刻吸引着寻宝者，同时也吸引着垂涎死者骸骨的饥饿怪物。
宝库 Treasure Vault。这些为了保护强大的魔法物品和巨大物质财富而建成的地下城，由大量的怪物和陷阱守卫着。

# 历史 History
在大多数情况里，地下城原本的建筑师早已不复存在，而他们身上发生的事情也有助于塑造该地下城的当前状态。
表格“地下城历史”记录了一些重要事件。这些事件可以将某地点从其原本用途转变为一个供冒险者探索的地下城。
那些特别古老的地下城还可以有一个由多个事件组成的历史，每个事件都在某种程度上改变了这个地方。

# d-20 地下城历史 Dungeon History
d20 重要事件
1~3 被建造者遗弃
4 由于瘟疫而被遗弃
5~8 被入侵者占领
9~10 建造者因迎击入侵者而灭亡
11 建造者因该处发现的某事物而灭亡
12 建造者因内部冲突而灭亡
13 建造者因魔法灾难而灭亡
14~15 建造者因自然疾病而灭亡
16 所在地被众神诅咒并受众神离弃
17~18 原建造者仍控制该地
19 被异界生物占领
20 某伟大奇迹的所在地

# 地下城栖居者 Dungeon Inhabitants
地下城建造者离开后，任何人或任何东西都可能进入其中。有智能的怪物，无意识的地下城食腐者、掠食者和猎物都会被吸引到地下城中。
地下城里的怪物不仅仅是碰巧生活在一起的随机生物集合。真菌、寄生虫、食腐者和掠食者可以在复杂的生态环境中共存，此外还有一些智能生物会结合统治、谈判和暴力等手段与这些生物共享这片生存空间。
角色们可以潜入地下城中，与其中一个派系结盟，或是促使各派系相互对抗，以降低那些强大怪物造成的威胁。例如，在一个地下城中居住着夺心魔和受其控制的类地精群体。此时冒险者们可以尝试煽动这些地精、大地精和熊地精们集体反抗其灵吸怪主人。

# 地下城派系 Dungeon Factions
一个地下城有时会由唯一一群只能类人生物占据，它们可以是一个占领洞窟网络的兽人部族，或者是一群栖息在地上废墟里的巨魔。其他情况，特别是一些更大地下城的情况里，会有复数的生物群体共享一个空间，并互相争夺资源。
例如，居住在矮人城堡废墟矿场里的兽人可能会经常与占领城堡上层的大地精发生冲突。在矿场最底层中建立殖民地的夺心魔们，可以操纵控制主要大地精部队铲除所有兽人。
另一边，一直在隐秘房间里的卓尔斥候们监视并密谋杀害所有夺心魔，然后奴役该地所有其他的生物。
你可以简单的把一座地下城当成遭遇的集合，冒险者们只管踢开一扇扇门，然后陆续干掉里面所有的东西。不过地下城各群体间力量的此起彼落，还能提供更多微妙的互动机遇。
地下城的住民们能够以非盟友的方式作为另一种可利用的打击手段，而冒险者们则是狡猾的怪物们想要拉拢利用的一群场外选手。
地下城中的智能生物们保留着各自的目标，也许只是单纯想要解决短期内的生存问题，又或是为其征服整个地下城建立帝国的雄心壮志迈出第一步。这样的生物可能会向冒险者们提出结盟的建议，希望这些角色不要在自己的巢穴中浪费生命而是帮助自己抵御敌人。你可以按照第 4 章的描述充实这些团体的 NPC 领袖们，为其赋予相应的个性、目标和理想。然后用这些元素在冒险者到达它们领地时塑造反应。

# 地下城生态 Dungeon Ecology
一个有生物栖息的地下城存在其自己的生态系统。生活其中的生物像野外生物一样，需要吃喝、呼吸和睡觉。捕食者们要找到猎物，智能生物们则在此间寻求空气、饮食和安全保障最合适的条件并在其中筑巢。记住这些要素，并以此设计一个能够让玩家投入其中的地下城。缺乏这些内在逻辑的地下城，可能会导致冒险者们在其环境中难以作出合理的决定。
例如，在地下城发现一池淡水的角色可以做出合理假设：
许多住在地下城中的生物会来这个地方饮水。因而冒险者们可以据此在水池中设下埋伏。类似情况下，有上锁的门——哪怕只是要用把手打开的普通门都可以限制某些生物的移动。
如果地下城中所有的门都紧闭不开，玩家们可能会想知道，那些自己反复遭遇的食腐虫或蚊蝠到底要如何才得以生存下来。

# 遭遇难度 Encounter Difficulty
冒险者们深入地下城后，你可能会想要提升其遭遇难度，以此应对角色的升级或增加其紧张气氛进而维持地下城的挑战性。不过这种方法可能会将地下城显得黏腻磨蹭。更好的方法是在各场遭遇中融入各种各样的难题。轻松和艰难的遭遇，以及简单和复杂的遭遇交替出现，可以鼓励角色们不断调整自己的策略，从而让各场遭遇看起来不会过于相似。
"""

article_mapping_a_dungeon = """
# 绘制地下城 Mapping a Dungeon
游戏中的地下城可以使用地图清晰显示其细节布局。设计地下城时，如其所在地、建造者、用途、历史，以及其栖居者等信息，都可以作为其着手点。需要更多创作灵感时，你还可以参考网上可以随意下载使用的地图，甚至可以直接用现实世界的地图代用。另外，出版的冒险模组里一般都包含了相应的地图以供参考，本书附录 A 中提供的相应表格也可以用来随机生成一个完整的地下城系统。
地下城的规模可大可小，它可以是神庙废墟里的几个小房间，也可以是拥有众多房间的大型建筑，甚至还向各方向一直延伸几百尺。设计地下城时，冒险者们的目标地点往往远离地下城的入口，从而逼使角色们深入挖掘地下或建筑内部更多的内容。
你可以使用网格纸更简便的绘制地下城。绘图时，网格纸上每方格代表一个 10 尺×10 尺的方形区域。如果你打算在网格纸上使用微缩模型进行游戏，则可能要把方格的尺寸设定缩为 5 尺，或者在开始战斗时把纸上的 10 尺格子细分为 5尺再开展战斗。你绘制地图时要注意以下事项：
• 使用非对称的布局。这样设计房间或整个地图时，可以避免地下城显得单调乏味。
• 从三维空间的角度进行思考。楼梯、斜坡、平台、凸台、阳台、陷坑，以及其他的高差地形都可以让地下城更加有趣，也让这些区域的战斗遭遇更具挑战性。
• 给地下城布置一些损毁的场景。倒塌的通道可以打断本来连起来的区域，地震造成的裂谷也可以把房间或回廊隔开。除非你想要强调地下城建造者非凡的技艺，否则你都可以在其中随意布置这些损坏的场景作障碍以增加趣味。
• 在地下城建筑内布置一些自然特征物。你可以安排一条地下河贯穿矮人的要塞，然后为建筑内沿河的房间设置各种相应设施，比如桥梁和沟渠。
• 加入复数的出入口。拥有多入口的地下城可以让玩家冒险时作出更多选择，从而产生更真实强烈的参与感。
• 加入密门和密室，以奖励积极搜索的玩家。
绘制地下城时，可以参考本书附录 A 获取更多帮助。

# 地下城特征物 Dungeon Features
不同类型的地下城有着各异的氛围和物理特征。一座破旧的墓室可能配置着石壁和松动的木门，弥漫着腐烂的气味，而其光照只能依靠冒险者随身携带的光源。而坐落在火山附近的兽穴，其石壁则因火山喷发而变的光滑，其内设置着魔法加固的黄铜门，充斥着硫磺的气味，四处迸射而出的火焰则照亮了其内的每个房间与大堂。

# 墙壁 Walls
某些地下城拥有砖石结构的墙壁，另一些则是原块坚石的石墙，其墙面粗糙的显露出凿刻的痕迹，或是被水流或岩浆流磨砺过的光滑表面。此外，某些地上的建筑可能会倾向于使用木材或其他复合材料的墙壁。
墙壁上有时候会装饰着壁画、浅浮雕以及各种照明装置如烛台或火把。某些情况下还会在其中建造密门。

# 门 Doors
地下城中的门路一般是简单的拱门或门楣。其上可能雕刻着装饰用的石像鬼或俾倪面孔，也可能刻印着隐含内容的印记，作为暗示前方事物的隐晦线索。
卡死的门 Stuck Doors。地下城的门因不常使用而经常卡死。打开一扇卡死的门需要成功通过一次力量检定。在设置相应 DC 时，可以参照第 8 章“运作游戏”里提供的指引。
上锁的门 Lock Doors。角色们遇到上锁门而没有相应钥匙时，可以通过成功的敏捷检定进行开锁（完成这个行为需要盗贼工具以及相应的熟练项）。他们也可以通过成功的力量检定强行撬门，或对门造成足够伤害后将其砸碎，又或者对门使用敲击术 knock 或相似的魔法。设置相应 DC 时，可以参照第8 章提供的指引，以及门与物件的相关资料。栓住的门 Barred Doors。栓住的门跟上锁的门类似，只是它并没有可以打开的锁，而在其门栓所在一侧时，可以简单的通过一个动作拿起门栓而使门打开。

# 密门 Secret Doors
密门是与周围环境融合在一起的门。有时，敲墙壁或用脚磨扫地板都可以揭示密门的存在。
侦测密门 Detecting a Secret Door。使用角色的感知（察觉）被动值，以决定队伍中的角色是否注意到密门的存在而不需要进行主动侦测。角色们也可以主动搜索特定的区域，并通过成功的感知（察觉）检定搜出密门的所在。设置相应的搜索DC 时，可以参考第 8 章的相关内容。
打开密门 Opening a Secret Door。发现密门后，如果开启密门的机关不易发现，则必须通过成功的智力（调查）检定，以研究出打开密门的方法。设置相应的难度 DC 时，可以参考第 8 章的相关内容。
如果冒险者们无法决定如何打开密门，撬门永远都是可行的选择。此时你可以把它视作一扇上锁的门，而其材质则与周围的墙壁相同。设置相应的撬门 DC 时，可以参考第 8 章的相关内容。

# 暗门 Concealed Doors
暗门是隐蔽起来的普通门。与特意制作成融入周围环境的密门不同，暗门以比较普通的方式进行隐蔽。它可能用挂毯盖住，或用泥灰掩盖，或者（作为隐蔽的活板门）隐藏在地毯下。一般情况下，发现暗门并不需要特意进行属性检定。角色只需要观察正确的地点，或者踩到关键的地点即可注意到暗门的存在。另外，你也可以使用角色的感知（察觉）被动值来察觉相应挂毯或地毯的移动痕迹。

# 闸门 Portcullis
闸门是一列木制或铁制的竖向栅拦，由一根或多根的横梁加固而成。它可以由绞盘和链条拉起到天花板上，也可以放下来阻隔过道或拱门。闸门的好处在于其隔断过道的同时仍可以让警卫观察隔断区域的另一边，并透过闸门发动远程攻击与施法。
使用绞盘把闸门升起或放下需要进行一个动作。如果角色无法触及绞盘（通常是因为被困在闸门的另一边），他还可以选择通过成功的力量检定举起闸门或拗弯栅拦以通过隔断。
其检定 DC 取决于闸门的尺寸与重量，还有其栅拦的粗细程度。设置相应 DC 时，可以参考第 8 章的相关内容。

# 黑暗与光照 Darkness and Light
黑暗是地底建筑与地上废墟内部的默认环境，有栖居者的地下城也可能拥有光源。
一些拥有黑暗视觉的地底居民，也会用火来取暖、煮食和自卫。但也有很多生物并不需要取暖与光照。冒险者进入地下城时，通常都会自带光源：比如进入铺满灰尘的陵墓中，而里面只有站岗的不死生物守卫；踏入的废弃的遗迹里，其内却充满了掠食怪物和泥怪；而天然洞窟中则栖息着不依赖视力的生物，时刻准备狩猎猎物。
火把和提灯的光照仅可以让角色看到周围一小圈距离，而其他生物则可以远远的看到光源所在处的状况。明亮光照在完全黑暗的环境中可以照亮几里外的距离，只是地底下这种开阔的空间并不多见。另外，冒险者在地下城中使用的光源会吸引怪物，地下城里的发光物品（如磷光真菌或发光的魔法传送门）也会吸引冒险者的注意力。

# 空气状况 Air Quality
地下隧道和地上遗迹通常都是封闭的空间，因此其内空气流通并不通畅。某些情况下地下城甚至会被紧紧的密封使冒险者们呼吸困难，而更常见的是其中几乎凝固的空气让人窒息发闷。此外，徘徊在地下城难以散去的气味，会因流通不顺的空气环境而得到增强。

# 声响 Sounds
地下城封闭的地理环境让其内的声响得以传播。开门的嘎叽声可以在通道中产生数百尺远的回响。大的噪音如锻炉的锤打声或战斗的交锋，甚至可以响彻整个地下城。很多地底生物运用这些声响定位猎物，或者用以警觉冒险队伍的入侵。

# 地城危害物 Dungeon Hazards
这里所描述的几种地城危害物 hazards 只是在地底与其他黑暗的危险环境中存在的一小部分范例。地城危害物的运作方式类似于本章末尾所描述的陷阱。
侦测危害物 Detecting a Hazard。未特意隐藏时，发现地城危害物并不需要进行任何的属性检定。危害物看起来与某些无害物相像（比如一片无害的软泥或霉菌）。它们可以通过成功的智力（自然）鉴定进行分辨。设置相应的辨认 DC 时，可以参考第 8 章的指引内容。
危害物危害度 Hazard Severity。危害物的致命程度与角色相关。你可以将危害物视为一个陷阱，其造成的伤害与队伍等级的关系，可以参照后文表格“各等级下危害度对应伤害”（该表格也出现在第 8 章）。

# 棕霉菌 Brown Mold
棕霉菌以热量为生，并且会吸取周围的热量。一片棕霉菌一般情况下覆盖着 10 尺的方形区域，并使而其周围 30 尺范围内的气温变的冰冷。
生物在一回合中第一次进入棕霉菌周边 5 尺范围内时，或者在该区域内开始其自己回合时，该生物必须进行一次 DC12 的体质豁免，豁免失败时，该生物受 22（4d10）的冷冻伤害，豁免成功则伤害减半。
棕霉菌免疫火焰。任何形式的火焰接近其周边 5 尺范围区域内时，棕霉菌将立即向火焰的方向延伸，并覆盖前方 10尺的方形区域（火源则在该延伸区域的中央）。一片棕霉菌暴露在造成冷冻伤害的效果中时，将会被立即摧毁。

# 绿软泥 Green Slime
这种酸性的软泥可以吞噬血肉和有机物，甚至能溶解金属。其外表泛绿，且黏滑潮湿。绿软泥常常成片的攀附在墙壁、地面以及天花板上。
每片绿软泥覆盖一片 5 尺的方形区域，其拥有 30 尺的盲视感官，当侦测到下方有移动物时，会从天花板或墙壁上滑落。
除此之外，绿软泥不具有任何活动能力。注意到软泥存在的生物可以成功通过一次 DC 10 的敏捷豁免来避开其接触。此外，软泥落下时无法被阻挡。
与绿软泥接触的生物受到 5（1d10）的强酸伤害。该生物在其自己每回合开始时再次受到该伤害，直到将软泥从身上刮除或摧毁。绿软泥对木材和金属造成每轮 11（2d10）的强酸伤害，而且使用任何非魔法的木质或金属质武器或工具刮除软泥时都将被其摧毁。
阳光和任何治愈疾病的效应，以及造成冷冻、火焰或光耀伤害的效应都可以摧毁一整片的绿软泥。

# 蛛网 Webs
巨蜘蛛会在过道与陷坑底部编织厚实黏滑的蛛网用以捕猎，而这些布满蛛网的区域皆视为困难地形。此外，如果有生物在一回合中第一次进入该区域，或者在该区域内开始其回合时，该生物必须成功通过一次 DC 12 的敏捷豁免，否则将受蛛网束缚。该受束缚生物可以用其动作尝试逃脱，进行一个DC 12 的力量（运动）或敏捷（体操）检定，并在检定成功时终止其束缚效应。
每 10 尺立方区域的巨大蛛网拥有 AC 10，15 点生命值，火焰伤害易伤以及钝击、穿刺和心灵伤害免疫。

# 黄霉菌 Yellow Mold
黄霉菌长在阴暗处，且每片覆盖 5 尺的方形区域。与其接触时，黄霉菌会喷出一片孢子云，并充满霉菌所在地 10 尺的立方区域。任何进入该区域的生物必须成功通过一次 DC 15的体质豁免检定，否则将受 11（2d10）的毒素伤害，并中毒1 分钟。以该形式中毒的生物在其每回合开始时受到 5（1d10）的毒素伤害。该生物可以在其自己每回合结束时再次进行该豁免，并在豁免成功时终止该中毒效应。
阳光和任何形式的火焰伤害都可以瞬间摧毁一整片的黄霉菌。
"""

article_wilderness = """
# 野外 Wilderness
你的战役世界里，地下城与聚居地之间还有草地、森林、荒漠、山脉、海洋，以及其他等待被横越的野外地带。将野外地区活现在游戏中也是一个有趣的点子。下面介绍两者成效显著的方法。

# 剪影式推进 Travel-Montage Approach
有时候目的地比旅途更重要。如果野外之旅的目的是让角色们到达真正冒险发生的地点，那就不必在长途跋涉的野外旅程中再加入其他遭遇。你可以像电影那样用蒙太奇手法将漫长的旅程剪辑成几秒钟的剪影，用几句描述性的语句在玩家头脑中描绘出一幅野外旅程的画面，然后继续前进。
你可以随意描述喜欢的旅程，但要确保队伍前进的趋势。“你走了几里路，却没遇到什么有趣的东西”没什么问题，但却无法让人回味和难忘，“你往北走的时候，一场小雨将起伏的平原弄得湿漉漉的。而你直到正午时分才找到一棵独树，并在其下休息和吃午餐。队伍里的游荡者在附近发现了一块看起来像笑脸的小石子，但除此之外你们什么也没遇到。”这其中的窍门是要把注意力集中到某些强化情绪的细节里，而不是把所有事物都事无巨细的陈诉一遍。
留意一些不同寻常的地形特征物：一个瀑布，环绕树木群的上方一块半身悬在空中的岩石形成一幅壮丽的景观，一片被烧毁或被砍伐的森林区域，等等。再描述一些值得注意的气味和声响，比如远处的怪物吼声，燃烧木材的恶臭，或者精灵森林里的花朵的芳香。
除唤起画面感的语言外，视觉辅助工具也可以辅助设定角色的旅行场景。互联网上的图像搜索功能可以帮你找到一些壮丽的风景（着本身就是个非常合适的搜索关键词），既有真实图像也有虚幻的作品。跟现实世界的风景一样引人注目的野外旅行可以提醒玩家，他们的角色正身处一个奇幻的世界中。你还可以偶尔用一些真正魔法元素来增强自己的描述。
某处的森林可以是一群微型小龙的家园而不是鸟类，它的树上可能装饰着巨大的蛛网，或是发着绿光的奇异汁液。过于陌生的景观也可能会破坏玩家们对世界的沉浸感，因此你要谨慎的使用这些元素。一幅真实而又令人难忘的风景中，只需一个单一的奇幻元素就已经足够。
这些风景可以用来给你的冒险铺设情感和基调。冒险者们经过一片森林时，身边的树木笼罩着所有的光照，且仿佛在其经过的时同时看着他们。而在另一边，阳光从头顶的树叶间洒下，每枝树干上都缠绕开花的藤蔓。腐烂的木头，恶臭的水，以及布满粘糊棕色苔藓痕迹的岩石，这些堕落的迹象表明冒险者们正接近他们的目的地，或是能够为他们提供线索以发现其威胁的本质。
特定的野外地点会有其相应的特征物。例如，妖精森林Spirit Forest 和蛛巢森林 Spiderhaunt Woods 可能存在着不同的树木，不同种类的植物和动物，不同的天气，以及拥有一份不一样的随机遭遇表。
最后，你还可以利用大家对天气的关注来加强一场野外长途旅程的印象。“你们接下来要花三天时间穿越沼泽”听起并没有多恐怖，“你们接下来的三天跋涉在膝盖深的泥潭里，头两天下着连夜的倾盆大雨，最后一天则烈日当空，还有无数饥饿的虫子结群围着享用你们的鲜血。”

# 线性式推进 Hour-by-Hour Approach
有时候，旅行的过程跟其目的地一样重要，从而同样需要花时间并因此注意。如果野外旅行在你的冒险中占重要地位，而不是你想要一笔带过的东西，那你需要的就不仅仅是概括性的描述这段漫长痛苦的旅程。你要掌握队伍的行进队列，并随时准备好发生遭遇。
让你的玩家决定队伍的行进队列（参阅《玩家手册》以获取更多信息）。前排的角色可能会先注意到出现的地标和地形特征物，也可能是队伍中负责导航的人先留意到这些事物。后排的角色通常负责确保队伍不被尾随。你还可以鼓励中排的角色做一些事，而不是盲目地跟在前排角色的后方跋涉。《玩家手册》中也建议了诸如地图制作和觅食等活动。
野外之旅的典型特征是混合了各种预期遭遇（你提前准备触发的遭遇）和偶然相遇（按表格掷骰的遭遇）。预期遭遇可能会需要在地图上定下遭遇将要发生的地点，比如一片废墟，一座跨越峡谷的桥梁，或是其他一些让人印象深刻的地点。
随机相遇则不需要啊那么明确的地点。你计划得越少，就越需要依靠随机遭遇来保持旅途的趣味。见第 3 章来获取更多关于自创随机遭遇表，以及何时查看随机遭遇的相关指引。
你要可以让每次的野外遭遇都以不同的方式开始或结束，并以此避免落入俗套。换个说法，你可以将野外看作你的舞台，一场冒险就是一部戏剧或电影，而每次野外遭遇则是它的一个场景，而你则需要尝试用各种不尽相同的方式来维持玩家们的兴趣。一场遭遇出现在冒险者的前方，那夏一场遭遇可能就要在其上方或后方袭来。如果某次遭遇的对象是一群隐匿行踪的怪物，那靠近队伍中同行动物的角色可能会从小马驹发出的焦虑嘶叫声中发现怪物的存在。如果遭遇的是怪物声势招摇，则队伍可能得以选择躲藏或设置伏击。一群怪物可能一见面就对队伍发动攻击，另一些则可能会拿到食物后就让对方随意通过。
角色们在旅行途中进行搜索时，可让发现某些东西作为奖励。破碎的雕像、踪迹、废弃的营地和其他的发现可以为你的世界增添一点风味，也可以为未来的遭遇或事件设置一些伏笔，或是以此引出一些未来的冒险。
一次野外之旅可能要花好几次聚会才能玩通。也就是说，如果野外之旅很长一段时间都没发生遭遇，那就用剪影式方法来跳过此间的遭遇。
"""

article_mapping_a_wilderness = """
# 绘制野外 Mapping a Wilderness
与地下城不同，室外环境似乎总有无限的选择。冒险者们可以在没有道路的沙漠或开阔的草原上向任意方向移动，那你作为 DM 又该如何处理那些可能构成野外战役一部分的地点和事件呢？如果你在沙漠绿洲中设计了一场遭遇，但角色们却偏离路线错过绿洲时，你该如何处理？你该如何避免让聚会变成在岩石嶙峋的荒原上重复往返的无聊游戏呢？
一种解决办法是像地下城一样想象出一个具体的室外环境。其间即使最开阔的地带也会呈现清晰的路径。由于必须沿着大地的轮廓，这里道路很少能够笔直向前，而只能在不平坦的地面上寻找最平稳或最稳当的路线。山谷和山脊沿着特定的方向延伸。山脉范围内无法穿行，只能绕远路通过。即使最无迹可寻的沙漠也可以显示出最多人走的路线，这些路线都是探险者和商队指挥们发现的风化岩石层，可以帮它们比翻越沙丘更轻松的穿越该地。
如果队伍偏离路线，你可能会需要把一场或多场的预期遭遇转移到地图上的其他地方，以确保花时间准备的这些遭遇不会付诸东流。
第 1 章里，我们曾讨论如何以三种不同尺度来创建野外地图的基础信息，并以此帮你设计世界和战役的起始区域。尤其是当你选用省区尺度时（1 六角格=1 里），更要思考旅行的路线（道路、关口、山脊和山谷，等等），并以此在地图上引导角色进行移动。

# 在地图上移动 Movement on the Map
按照你所使用的地图尺度来叙述野外旅程的细节。如果你按照线性方式在一个省区尺度的地图（1 六角格=1 里）上跟进移动，那你可以描述一下冒险者经过的每个村庄。在该尺度下，你可以假设角色们在到达某个六角格时即发现其中的显著地点，除非这些地点被可以的隐藏起来。角色们不一定非得大踏步的进到该出的城堡废墟里，他们可以在此寻找某条旧道，某些外围废墟，以及其他在该地区出现的迹象。
如果在一个王国尺度的地图（1 六角格=6 里）上跟进数天的旅行，就无需在其中显示太精确的细节。你只要让玩家们知道，他们旅程的第三天渡过了一条河，然后随着随后旅途里地面的海拔逐渐升高，再过两天就可以到达山口。

# 野外特征物 Wilderness Features
野外地图要有一些聚居地、要塞、废墟，以及其他值得发现的地点才算完整。一个大约 50 里跨度的区域，大概配置十几个这样的地点就比较合适。

# 怪物巢穴 Monster Lairs
一处大约 50 里跨度的野外区域可以包括大概六个怪物巢穴，但可能有不超过一个像龙这样的顶级掠食者。
如果你想让角色们去探索一处怪物巢穴，那你就要为该巢穴寻找或制作一个合适的地理位置，并像一座地下城一样填充该巢穴。

# 遗迹 Monuments
冒险者们会在那些文明规则曾统治过的地方找到纪念伟大领袖、众神和文化的遗迹。从表格“遗迹”中寻找灵感，或掷骰来随机确定冒险者们遇到的遗迹。

# d-20 遗迹 Monuments
d20 遗迹
1 被封闭后掩埋的坟丘或金字塔
2 被掠夺后掩埋的坟丘或金字塔
3 雕刻在山腰或悬崖上的面孔
4 从山腰或悬崖上凿出的巨大雕像
5~6 完整的黑曜石蚀刻，讲述了一个警告、一个历史迭闻、一次奉献，或一幅宗教肖像
7~8 毁坏或倾倒的方尖碑
9~10 完整的人物或神祇的雕像
11~13 毁坏或倾倒的人物或神祇的雕像
14 完整的大石墙，每隔一里都设有塔楼作为防御工事
15 废墟中的大石墙
16 大石拱
17 喷泉
18 完整的立石阵
19 毁坏或倾倒的立石阵
20 图腾柱

# 废墟 Ruins
破碎的塔楼，远古的神庙，以及被夷为平地的城市都是探险的绝佳场所。此外，你还可以注意到，一堵沿着道路引申的破碎古墙，一座山顶上的石制风车，或是一堆石砌的石头，都可以给为你的野外环境增添质感。

# 聚居地 Settlements
聚居地存在于食物、水源、农田和建筑材料等资源丰富的地点。一个大约 50 里跨度的文明省区可以设置一个城市，若干乡土小镇，以及一些零散的村庄和贸易站。一处非文明的区域可能在某个荒蛮边境设置着唯一一个贸易站，但没有更大的聚居地。
除聚居地外，一个省区可能还有一些村庄和小镇遗址，它们可能曾经被废弃，或者可能是被强盗和怪物洗劫殆尽。

# 要塞 Strongholds
在某些困难时期，要塞可以为当地的居民提供保护。一个地区的要塞数量取决于其领地的社会制度、人口、地区的战略重要性或脆弱性，以及其土地的富饶程度。

# 诡异地点 Weird Locales
诡异地点会让你的野外冒险本身显得更加奇幻和超自然。

# d-20 诡异地点 Weird Locales
d20 地点
1~2 死寂魔法区（类似于一个反魔力场 antimagic field）
3 狂野魔法区（骰《玩家手册》中的表格“狂野魔法浪潮”以确定区域施展的魔法）
4 巨石雕刻着一张会说话的面孔
5 水晶洞窟会神秘的回答问题
6 古树内困着一个精魂
7~8 战场中挥之不去的浓雾偶尔凝聚成类人的形态
9~10 永固的传送门连通了另一个存在位面
11 许愿井
12 巨大的水晶碎片从地面突起
13 船只残骸，而四周可能并无水域
14~15 闹鬼的山丘或古坟堆
16 河流的船渡，其向导是一位骷髅船长
17 旷野上一些被石化的士兵或其他生物
18 森林中一些树木被石化或被启蒙
19 峡谷中有一条龙的墓地
20 浮空的土地其上立着一座塔楼
"""

article_wilderness_survival = """
# 野外求生 Wilderness Survival
在野外冒险会带来了一系列的危险，甚至超越可怕的掠食者和野蛮的劫掠者带来的威胁。

# 天气 Weather
你可以选择一项适合战役的天气或按表格“天气”进行掷骰，再适当按地形和季节作调整，以此确定某天的天气。

# d-20 天气 Weather

d20 温度
1~14 当季正常气温
15~17 比正常温度低 1d4×10 华氏度
18~20 比正常温度高 1d4×10 华氏度

d20 风
1~12 无风
13~17 微风
18~20 强风

d20 降水
1~12 无雨
13~17 小雨或小雪
18~20 大雨或大雪

# 极度严寒 Extreme Cold
当温度达到或低于华氏 0 度时，暴露在寒冷环境下的生物每经过一小时必须成功通过一次 DC 10 的体质豁免，否则将提升一级力竭状态。拥有冷冻伤害抗性或免疫的生物，以及穿着冷天用具（厚外套、手套等）和自然适应寒冷气候的生物，其进行该豁免时直接判为成功。

# 极度炎热 Extreme Heat
当温度达到或超过华氏 100 度时，暴露在热量和无法饮水状况下的生物每经过一小时必须成功通过一次体质豁免，否则将提升一级力竭状态。其豁免 DC 开始时为 5，每增加一个小时就 DC 提升 1。着装中型或重型护甲的生物，或着装厚重衣服的人，进行该豁免时具有劣势。拥有火焰伤害抗性或免疫的生物，以及自然适应炎热气候的生物，其进行该豁免时直接判为成功。

# 强风 Strong Wind
强风使远程武器攻击和感知（察觉）检查具有劣势。一阵强风可以吹熄开放的火焰，驱散浓雾，并且使所有非魔法的飞行手段无效化。在强风中飞行的生物必须以盘旋的方式落地，或是直接坠地。
沙漠中的强风会造成沙尘暴，使得所有依赖视力进行的感知（察觉）检查具有劣势。

# 大雨 Heavy Precipitation
在大雨或大雪中，所有的东西都被陷入了轻度遮蔽，而该地区内的生物依赖视觉进行的感知（察觉）检定均具有劣势。
大雨还会熄灭火焰，并使所有依赖听觉进行的感知（察觉）检定具有劣势。

# 高海拔 High Altitude
在 1 万尺或更高的海拔高度上，由于空气中的氧气稀薄，需要呼吸的生物会变得很费力气。这样的生物在高海拔地区旅行时，其预期在平地旅行 1 小时完成的距离，在高海拔地区必须花费 2 小时完成。
需要呼吸的生物可以在高海拔地区停留 30 日以上，以适应该地区的环境。需要呼吸的生物无法以此适应海拔超过 2万尺的高度，除非它在是该环境中的原生生物。

# 野外危害物 Wilderness Hazards
本节描述了一些冒险者在野外可能遇到的危害物范例。
某些危险，比如光滑冰面和剃刀藤，无需属性检定便可发现。其他比如亵渎之地，则无法用普通的感官察觉。这里展示的其他危害物均可以通过进行的智力（自然）检定进行辨别。
使用第 8 章的指引，为发现或识别危害物的任何检查设置一个适当的 DC。

# 亵渎之地 Desecrated Ground
一些墓地和墓穴里充满了远古邪恶不可见的痕迹。亵渎之地的区域范围大小不一，对其区域施展侦测善恶 detect eviland good 可以揭示其本质。
站在亵渎之地上的不死生物其所有豁免具有优势。
洒上一小瓶圣水可以净化一处 10 平方尺的亵渎之地，向其所在区域施展圣居 hallow 也可以净化该区域。

# 冰水 Frigid Water
一个生物可以在冰水中浸泡数分钟而免受其不良影响，其分钟数等同于其体质值。此后每在冰水中持续等待一分钟，就需要该生物成功通过一次 DC 10 的体质豁免，否则将提升一级力竭状态。拥有冷冻伤害抗性或免疫的生物，以及自然适应在冰冷水体中生活的的生物进行该豁免时将直接判为成功。

# 流沙 Quicksand
一个流沙坑覆盖大约 10 平方尺的区域，且通常深 10 尺。
进入该区域的生物将从沙面向下沉陷 1d4+1 尺，并被束缚。
该生物在每个其自己回合开始时会再下陷 1d4 尺。只要该生物还未被流沙完全淹没，它就可以通过使用其动作进行一次力量检定来逃脱。该检定 DC 为 10 加上该生物已沉入流沙的尺数。一个被完全淹没在流沙中的生物无法呼吸（见《玩家手册》中关于窒息 suffocation 的规则）。
任一生物可以用其动作进行一次成功的力量检定，以将其他陷入流沙的生物拉出困境。其 DC 为 5 加目标生物以陷入流沙中的尺数。

# 剃刀藤 Razorvine
剃刀藤是一种在野生缠结和树丛中成长的植物。它可以像常春藤一样附着于建筑物和其他表面上。一个 10 尺高，10尺宽，5 尺厚的墙状或篱笆状剃刀藤拥有 AC 11，25 点生命值，并且对钝击，刺穿和心灵伤害免疫。
生物在一回合里第一次直接接触剃刀藤时，必须成功通过一次 DC 10 的敏捷豁免，否则受剃刀藤的刃状棘刺造成 5（1d10）的挥砍伤害。

# 光滑冰面 Slippery Ice
光滑冰面是困难地形。生物在一回合里第一次在光滑冰面上移动时，必须成功通过一次 DC 10 的敏捷（体操）检定否则摔下倒地。

# 薄冰 Thin Ice
每 10 平方尺区域薄冰的承重为 3d10×10 磅。当冰面上的总重量超过了其承重量时，该区域冰面就会破裂。所有在薄冰上的生物也将随之坠落。

# 觅食 Foraging
队伍以正常或慢速步调旅行时，其角色们可以沿途收集食物和用水。你可以随时让一名负责觅食的角色进行一次感知（求生）检定，其 DC 则由该地区粮食和水源的多寡决定。

# table 觅食难度 Foraging DCs
水和粮食供应 DC
充分来源  10
有限来源  15
能找到但非常稀少的来源  20

# 如果多名角色负责搜索，则每个角色可以分别进行检定。
前往觅食的角色若检定失败则找不到任何东西。而检定成功的角色则骰 1d6＋给角色的感知调整值以决定找到食物的数量（以磅为单位），然后再重复一次该掷骰以决定找到的食水数量（以加仑为单位）。

# 粮食与水 Food and Water
《玩家手册》中提到的食物和水是角色们的必需品。马和其他生物根据其体型大小每天需要不同量的食物和水。天气炎热时，需水的数量要翻倍计算。

# table 饮食需求 Food and Water Needs
生物体型 每日食物 每日饮水
微型 1/4 磅 1/4 加仑
小型 1 磅 1 加仑
中型 1 磅 1 加仑
大型 4 磅 4 加仑
巨型 16 磅 16 加仑
超巨型 64 磅 64 加仑

# 迷路 Becoming Lost
冒险者在野外旅行时，除非可以沿着某条路或者类似的事物前进，就必须承担陷入迷路的风险。你可以在适当的时机让队伍中负责导航的角色进行一次感知（求生）检定，以对抗当前如表格“野外导航”所示的地形 DC。如果队伍以慢速步调移动，则该导航员获得+5 加值，快速步调时则承受-5 的罚值。队伍拥有一幅准确的区域地图时，或者当队伍可以看到太阳或星星时，该导航员进行的检定将具有优势。
若感知（求生）检定成功，该队伍就不会迷失前进的方向。
如果检定失败，那队伍无意中走错方向而迷路。队伍的导航员必须再花费 1d6 小时的时间寻路继续前进。

# table 野外导航 Wilderness Navigation
地形 DC
森林、丛林、沼泽、山地，或者开放的海洋其天上阴云密布且视野内见不到陆地 15
极地、荒漠、丘陵，或者开放的海洋其天上晴朗无云且视野内见不到陆地 10
草原、洼地、农场 5
"""

article_settlements = """
# 聚居地 Settlements
村庄、小镇或城市为探险提供了绝佳的背景。冒险者们在其中可能会应要求要求追捕躲藏起来的罪犯，解决一桩谋杀案，干掉一群鼠人或变形怪，或者保护某个被围攻的聚居地。
你为战役创建一处聚居地时，可以留意那些与冒险最密切相关的地点。无需关心每条街道的命名，和每幢建筑的居民如何，以免导致混乱。

# 随机聚居地 Random Settlements
下列诸表格可以帮您快速生成一处聚居地。这些表格已经假设你确定了该聚居地的规模和其政治结构的基本形式。

# d-20 种族关系 Race Relations
d20 结果
1~10 和谐
11~14 紧张或竞争
15~16 多数族裔作为征服者
17 少数族裔作为统治者
18 少数族裔作为难民
19 多数族裔压迫少数族裔
20 少数族裔压迫多数族裔

# d-20 统治者形象 Ruler’s Status
d20 统治者
1~5 受人尊敬，公平，公正
6~8 可怕暴君
9 软弱而受他人操控
10 非合法统治者，酝酿着内战
11 被一个强大的怪物管治或控制
12 神秘莫测，幕后的帮派集团
13 有争议的领袖，公开争斗
14 公开夺权的帮派集团
15 愚蠢粗野之徒
16 弥留之际，继承人们为争权而竞争
17~18 铁腕思想却受人尊敬
19~20 宗教领袖

# d-20 重要特色 Notable Traits
d20 特色
1 街道上的运河
2 巨大的雕像或遗迹
3 宏大的神庙
4 大型堡垒
5 青翠的公园和果园
6 河流将小镇分开
7 主要贸易中心
8 某强大家族或公会的总部
9 居民大多都很最富有
10 贫穷，败落
11 难闻的气味（制革业，开放的下水道）
12 一种特定商品的贸易中心
13 多场战役的发生地
14 某神话或魔法事件的发生地
15 重要的图书馆或档案馆
16 禁止对所有众神的崇拜活动
17 罪恶名声
18 著名的图书馆或学院
19 重要陵墓或坟场的所在地
20 在远古废墟上重建

# d-20 因何闻名 Known For Its…
d20 特点
1 美味佳肴
2 粗鲁的居民
3 贪婪的商人
4 艺术家和作家
5 伟大英雄/救世主
6 繁花
7 成群结队的乞丐
8 顽强的武者
9 黑暗魔法
10 颓废
11 虔诚
12 赌博
13 无神
14 教育
15 葡萄酒
16 高端时尚
17 政治阴谋
18 强大的公会
19 烈酒
20 爱国主义

# d-20 当前灾祸 Current Calamity
d20 灾祸
1 疑似吸血鬼侵扰
2 新异教寻找信徒
3 重要人物死亡（疑似谋杀）
4 盗贼行会之间的战争
5~6 瘟疫或饥荒（引发骚乱）
7 腐败官员
8~9 怪物猎食
10 一名强大的法师搬到了城中
11 经济萧条（贸易中断）
12 洪水
13 墓地里蠢蠢欲动的不死生物
14 末世预言
15 战争边缘
16 内部纷争（导致无政府状态）
17 遭敌人围攻
18 丑闻对权势家族构成威胁
19 发现地下城（冒险者们涌向城市）
20 宗教派别为争权斗争

# 随机建筑 Random Buildings
在小镇或城市范围内发生的惊心追组和骇人逃窜有时会迫使角色冲进建筑里。当你需要快速充实一栋建筑时，可以按表格“建筑类型”进行掷骰。然后再按该建筑相对应的表格为其骰出进一步的细节。
如果一次掷骰出现角色们根本不可能到达的地方（比如在小镇破败的角落出现一栋奢华豪宅），则你可以选择再次掷骰，或者直接选择另一结果。不过，这些意想不到的结果可以激发一些独创而令人难忘的地点，并以此让你的城中遭遇显得更具特色。

# d-20 建筑类型 Building Type
d20 类型
1~10 住宅（骰一次表格“住宅”）
11~12 宗教建筑（骰一次表格“宗教建筑”）
13~15 酒馆（骰一次表格“酒馆”，骰两次“酒馆名生成器”）
16~17 货栈（骰一次表格“货栈”）
18~20 商店（骰一次表格“商店”）

# d-20 住所 Residence
d20 类型
1~2 废弃的空屋
3~8 中产阶级的房屋
9~10 上流社会的房屋
11~15 拥挤的廉价公寓
16~17 孤儿院
18 隐秘的奴隶围栏
19 隐秘异教的前沿基地
20 奢华，戒备森严的豪宅

# d-20 宗教建筑 Religious Building
d20 类型
1~10 某善良或中立神祇的神庙
11~12 伪神的神庙（由一群游骗祭司运营）
13 苦行者的家
14~15 废弃的圣地
16~17 致力于宗教研究的图书馆
18~20 某邪魔或邪神的隐秘圣地

# d-20 酒馆 Tavern
d20 类型
1~5 安静、低调的酒吧
6~9 吵闹的潜水酒吧
10 盗贼公会常光顾的店
11 秘密社团的集会场所
12~13 上层社会餐饮俱乐部
14~15 赌窟
16~17 面向特定的种族或公会
18 会员制俱乐部
19~20 妓院

# d-20 酒馆名生成器 Tavern Name Generator
d20 前半 后半
1 银 The Silver 鳗 Eel
2 金 The Golden 海豚 Dolphin
3 慢行 The Staggering 矮人 Dwarf
4 大笑 The Laughing 飞马 Pegasus
5 阔步 The Prancing 小马驹 Pony
6 虚饰 The Gilded 玫瑰 Rose
7 奔跑 The Running 牡鹿 Stag
8 长啸 The Howling 狼 Wolf
9 被宰 The Slaughtered 羔羊 Lamb
10 斜睨 The Leering 恶魔 Demon
11 醉熏 The Drunken 山羊 Goat
12 跳跃 The Leaping 精魂 Spirit
13 咆哮 The Roaring 部落 Horde
14 皱眉 The Frowning 小丑 Jester
15 孤独 The Lonely 山 Mountain
16 浪荡 The Wandering 鹰 Eagle
17 神秘 The Mysterious 半羊人 Satyr
18 吠叫 The Barking 狗 Dog
19 漆黑 The Black 蜘蛛 Spider
20 闪烁 The Gleaming 星 Star

# d-20 货栈 Warehouse
d20 类型
1~4 空荡或遭废弃
5~6 戒备森严，贵重商品
7~10 廉价商品
11~14 散装商品
15 活体动物
16~17 武器／护甲
18~19 远方进口商品
20 秘密的走私者老巢

# d-20 商店 Shop
d20 类型
1 典当行
2 草药／焚香
3 水果／蔬菜
4 干肉
5 陶器
6 殡仪
7 书
8 借贷
9 武器／护甲
10 船具用品
11 铁匠铺
12 木匠
13 织布工
14 珠宝商
15 烘焙师
16 地图绘制
17 裁缝
18 绳索制造
19 石匠
20 抄写员
"""

article_mapping_a_settlement = """
# 绘制聚居地 Mapping a Settlement
当你为游戏绘制聚居地时不需要关注每栋建筑的所在地，而是要把注意力集中在一些主要特征上。
绘制村庄时，关键是规划道路，包括通往村外的贸易路线，以及将偏远农场与村庄中心连接起来的道路。注意村庄中心的位置。如果冒险者们会到村子的某个地方去，那你就必须在地图上标出这些地点。
绘制小镇和城市时，要注意主道路和水路以及周围的地形。勾画好城墙的轮廓，并标记好一些你认为至关重要的特征物：领主的楼堡和特定的神庙等。绘制城市时，还要为其增加内城墙，思考各分区的特色。为每个分区分配一个凸显其特色的名字，这也能帮助识别出主导街区属于某个商贸类型（制革街 Tannery Square，神庙路 Temple Row），处于某个地理特征（丘顶 Hilltop，河畔 Riverside），或作为区域统治的地点（领主区 the Lords’ Quarter）。
"""

article_urban_encounters = """
# 城中遭遇 Urban Encounters
尽管城市总会承诺保障安全，但城镇中依然存在如黑暗地牢一样的危险。邪恶潜藏在众目睽睽之下或躲在黑暗角落里。下水道、阴暗小巷、贫民窟、烟雾弥漫的酒馆、破旧的公寓、拥挤的市集都可以瞬间变为战场。最重要的是，冒险者们必须学会举止得体，以免招来当地政府不必要的关照。
换言之，角色们只要不自找麻烦，就可以享受聚居地为其带来的所有好处。

# 律法与秩序 Law and Order
一处聚居地是否保有警力取决于它的规模和体制。一个奉行法律、秩序的城市会有相应的一队城市警备队负责维持秩序，以及一支训练有素的民兵负责护卫城墙，此外一些边境小镇则可能要依靠冒险者或市民来抓捕罪犯和抵御袭击者。

# 审判 Trials
大多数聚居地里的审判都由地方法官或当地领主监督。出现审判争议时，冲突的当事人或其辩护人必须提供先例和证据，并遵从法官的决议，其过程可能存在或不存在涉及法术或调查行为的辅助。也有一些地方是通过严峻的试炼，或通过战斗实施审判。如果存在针对被告的压倒性证据，则地方法官或当地领主便可以直接跳过审判而直接诉诸刑罚。

# 刑罚 Sentences
每个聚居地中都建有一个拘留所，用以关押被指控的罪犯等待审判，但很少聚居地建有专门的监狱来关押被定罪的囚犯。被判有罪的人通常会被处以罚款，被判处数月或数年的强制劳动，被流放，或是直接被处死，具体则取决于其犯罪的严重程度。

# 随机城中遭遇 Random Urban Encounters
表格“随机城中遭遇”可用在基于城市或基于小镇的冒险。检定随机遭遇的频率至少每日一次，而加入角色们晚上外出走动则必须在晚上再检定一次。骰出的结果跟当日时机并不合适时，你可以重新掷骰以选定其他结果。
动物奔逃 Animals on the Loose。角色们遇到一只或一群意料之外的动物在街道上奔走。所遭遇的动物可以随意决定，可以是一群狒狒 baboons，也可以是一只逃脱马戏团的熊 bear、老虎 tiger 或象 elephant。
公告 Announcement。宣告员，小镇的叫卖者，某个疯子，或者其他的人在街角发表公告，所有人都能听到他的声音。这一公告可能预示着一些即将到来的事件（比如公开处决），也可能是向大众传达重要信息（比如新颁布的皇家法令），或是传达一项可怕的预兆或警告。
斗殴 Brawl。一场斗殴在冒险者身边爆发。可能是一场酒馆争吵；是城中敌对派系、家族或帮派之间的争斗；或者是城市守卫和罪犯之间的打斗。角色们可以是目击者，或是被游箭射中，甚至是被误认为是团体的成员而遭对方攻击。
恶霸 Bullies。角色们目击了 1d4+2 的恶霸骚扰一个外乡人（为他们套用《怪物手册》中的平民 commoner 资料）。这些恶霸只要一受伤害便会马上逃跑。
伙伴 Companion。一名或多名角色与一位向队伍示好的当地人接触。作为转折时，你也可以将这位准伙伴设定为一名密探 spy，受雇前来收集冒险者们的相关情报。
竞赛 Contest。冒险者们被卷入一场即兴的竞赛中。其内容可以是智力比试或是斗酒比拼不等，或者也可以指使作为目击者见证一场决斗。
尸体 Corpse。冒险者们发现一具类人生物的尸体。
征募 Draft。角色们受小镇或城市一名警备队员征募，并表示需要角色们的帮助来处理一个迫在眉睫的问题。作为转折时，你也可以将这名警备员设定为一个伪装的罪犯，正打算引诱队伍进入其埋伏（为他们套用《怪物手册》中的暴徒 thug资料）。
醉汉 Drunk。一个醉醺醺的醉汉摇摇晃晃地走向一位随机选定的队伍成员，并将其错认作其他人。
火灾 Fire。发生一场火灾，角色们可以在火势蔓延前扑灭火焰。
发现饰品 Found Trinket。角色们发现一件随机的饰品。
你可以按《玩家手册》中的表格“饰品”掷骰决定具体的饰品类型。
警卫盘问 Guard Harassment。冒险者们被 1d4+1 的警卫仗势欺人的逼向角落。警卫一旦受到威胁就会呼唤帮手，并且可能因此引起附近其他警卫或市民的注意。
扒手 Pickpocket。一个窃贼（使用《怪物手册》中的密探spy 的资料）试图从一为随机选定的角色身上偷窃。队伍角色中若有人感知（察觉）被动值等于或大于该窃贼的敏捷（巧手）检定，则可以在其动手时将其现成抓住。
巡游队伍 Procession。冒险者们遇到一群市民，他们可以是在进行庆典，或者是正在举办葬礼。
游行抗议 Protest。冒险者们看到一群市民和平地抗议一项新的法律或法令。一小撮警卫在旁维持秩序。
失控马车 Runaway Cart。一组马匹拉着马车飞奔横穿过城市各条街道。冒险者们必须避开马匹。如果他们设法停住货车，则其车主（跟在车子后面跑）会向其表示感激。
可疑交易 Shady Transaction。角色们目睹两名披着斗篷的人物在进行一场可疑的交易。
大场面 Spectacle。角色们见证了一场公共形式的娱乐项目，比如一位才华横溢的吟游诗人扮演一位皇室人物，一场街头马戏团表演，一场木偶戏演出，一次华丽的魔术表演，一次拜访王室的聚会，或是一场公开的处决。
顽童 Urchin。一个街头顽童黏上冒险者们并跟着他们到处跑，直至最后被他们吓跑。

# d-12+d-8 随机城中遭遇 Random Urban Encounters
d12+d8 遭遇
2 动物奔逃
3 公告
4 斗殴
5 恶霸
6 伙伴
7 竞赛
8 尸体
9 征募
10 醉汉
11 火灾
12 发现饰品
13 警卫盘问
14 扒手
15 巡游队伍
16 游行抗议
17 失控货车
18 可疑交易
19 大场面
20 顽童
"""

article_unusual_encounters = """
# 非常规环境 Unusual Environments
野外旅行并一定是指单纯在陆地上的长途跋涉。冒险者们还可能经历各种奇妙的旅途，他们可以乘着轻帆船或元素动力的大帆船在外海行进，也可以骑着鹫马 hippogriff 或者飞毯 carpet of flying 在空中翱翔，甚至乘着巨海马在深海的珊瑚宫殿中穿梭。

# 水下 Underwater
见《玩家手册》第 9 章水下战斗的相关规则。

# 海底随机遭遇 Random Undersea Encounters
你的海底遭遇检定频率可以参考陆上旅行时的状况（见第 3 章）。随机海底遭遇列表提供了一些有趣的选项。你可以投骰决定遭遇事件或者直接在列表中选择适合的事件。

# d-12+d-8 海底随机遭遇 Random Undersea Encounters
d12+d8 事件
2 长满藤壶的沉船（沉船有 25%几率藏着宝藏；按第
7 章的各宝藏表格进行掷骰。）
3 沉船附近游荡着礁鲨 reef sharks（浅水区）或者寻猎鲨 hunter sharks（深水区）（沉船有 25%几率藏着宝藏；按照第 7 章的各宝藏表格进行掷骰。）
4 长满巨大牡蛎的海床（每个牡蛎有 1%几率长着一颗价值 5000 gp 的巨大珍珠 pearl）
5 水下蒸汽排气孔（排气孔有 25%几率是通往火元素位面的传送门。
6 沉没的废墟（人迹罕至）
7 沉没的废墟（有栖息生物或闹鬼）
8 沉没的雕像或遗迹
9 友善且充满好奇的巨海马 giant sea horse
10 友善的人鱼 merfolk 巡逻队
11 带敌意的迈罗人鱼 merrow（沿岸区）或者沙华鱼人 sahuagin（深水区）巡逻队
12 长着巨大海草的海床（再参照本表格作一次掷骰决定是什么藏在海草海床里）
13 海底洞穴（空）
14 海底洞穴（海鬼婆 sea hag 巢穴）
15 海底洞穴（人鱼 merfolk 巢穴）
16 海底洞穴（巨章鱼 giant octopus 巢穴）
17 海底洞穴（龙龟 dragon turtle 巢穴）
18 正在寻找宝藏的青铜龙 bronze dragon
19 在海底漫步的风暴巨人 storm giant
20 沉没的宝箱（25%几率藏着有价值的东西；按第 7 章的各宝藏表格进行掷骰。）

# 游泳 Swimming
除非有魔法帮助，否则一名角色每天不能进行超过 8 小时的游泳活动。游泳时间每经过 1 小时，该角色就必须成功通过一次 DC 10 的体质豁免，否则将提升一等级的力竭。
有游泳速度的角色（包括着装善泳指环 ring of swimming或带有相似魔法效应的角色）可以不带疲惫风险的进行一整天的游泳活动，不过依然要遵照《玩家手册》中关于强行军的规则。
因水压和寒冷水温的影响，在深水区游泳时的情况类似在高海拔地区旅行。没有游泳速度的生物在超过 100 尺水深区域时，每游泳 1 小时视为已经游泳 2 小时来确定力竭等级。
而在 200 尺水深区域时，每经过 1 小时则视为 4 小时看待。

# 水下能见度 Underwater Visibility
水下能见度取决于水体的清晰度和可用的光照。除非角色带有光源，否则参照表格“水下遭遇距离”来决定该角色进入遭遇事件时与事件的距离关系。

# table 水下遭遇距离 Underwater Encounter Distance
水体状况 遭遇距离
清澈的水，明亮光照 60 尺
清澈的水，微光光照 30 尺
浑浊的水或者无光照 10 尺

# 海洋 The Sea
角色可以每天进行 8 小时的划船作业，如果划船作业时间超过 8 小时，则必须承担力竭风险（可以参照《玩家手册》第 8 章关于强行军的规则）。满员的水运载具可以让船员轮班作业，以维持一整天不间断的航行作业。

# 导航 Navigation
航海载具航行时会尽量接近海岸，这样可以利用可见地标使导航更容易进行。只要船上能看到陆地，航路就不会迷失。
如果看不到陆地，船队的领航员就必须依靠航行轨迹来推断船队的位置（通过跟进船方向和航行距离）。条件允许时，也可以利用天上的星星和太阳进行定位。
参照本章早前所述的表格“野外导航”来确定船舶是否偏离航道。

# 海上随机遭遇 Random Encounters at Sea
你可以按照陆上遭遇的相同频率来进行海上遭遇事件的检定（详细信息见第 3 章）。表格“海上随机遭遇”也为此提供了一些选项和想法。

# d-12+d-8 海上随机遭遇 Random Encounters at Sea
d12+d8 遭遇事件
2 幽灵船
3 友善且好奇的青铜龙 bronze dragon
4 漩涡（漩涡有 25%几率是一个水元素位面的传送门）
5 人鱼 merfolk 商人
6 路过的军舰（友善或敌对）
7~8 海盗船（敌对）
9~10 路过的商船（桨帆船 galley 或者帆船 sailing ship）
11~12 虎鲸 killer whale 进入视野
13~14 漂浮的残骸
15 单帆长船船队，船员都是敌对的狂战士 berserker
16 敌对的狮鹫 griffon 和鸟妖 harpy
17 冰山（如果能够提早发现，则可以轻易躲开）
18 沙华鱼人 sahuagin 登船队
19 水中的 NPC（抓着漂浮的残骸）
20 海怪（例如龙龟 dragon turtle 或者克拉肯 kraken）

# 海上天气 Weather at Sea
参照本章早前所述的表格“天气”来确定海上的天气状况。
在天气状况的检定同时出现强风和大雨时，天气将视为两者结合导致的风暴和巨浪。船员们在风暴中将失去所有可做导航的陆上地标（灯塔和其他有明亮特征的地标除外），并且在风暴中用以导航的所有属性检定都具有劣势。
风平浪静时（没有风）船只无法扬帆起航，而船队只能通过划船作业继续前进。此外，船只在强风天气逆风行驶时只能以一半的速度航行。

# 能见度 Visibility
平静天气时的大海可以提供很好的能见度。这时从船只的瞭望台上可以看到 10 里外的另一艘船或海岸线。阴天会使能见距离减少一半。雨雾天气的能见度则跟陆上旅行时一样。

# 拥有一艘船 Owning a Ship
某些时候，冒险者可能会获得船舶的所有权。他们可能花钱购买，或在战斗中俘获，又或者直接从任务中接收船舶。你可以决定冒险者的船是否可以购买，也可以随时设法剥夺角色对船舶的所有权，比如当船舶的所有权妨碍故事发展时就可以考虑这么做。（参考“船难”边栏）。
船员 Crew。一艘船需要一队熟练的雇工才能实现使它航行的职能。按照《玩家手册》的描述，一名熟练的雇工每日必需花费 2 gp。雇佣熟练船工的最小花费视所使用的载具类型决定，这在表格“空运及水运载具”中有详细的描述。
计算船员的忠诚度时，你可以视每位船员为独立个体，或者将所有船员作为一个整体看待。关于忠诚度的选项可以使用第 4 章的规则。当非忠诚状态的船员达到半数时，船员们将变为敌对并发动叛乱。如果叛乱时船只正处于停泊状态，非忠诚的船员将离开船队，并永远不再回来。
乘客 Passengers。列表中显示相应类型船舶可容纳的乘客数量按小型或中型体型计算。一般船上的住宿空间都是一间房间内密布的吊床。如果让一艘船配备个人住宿的话，则其载客量为标称的五分之一。
尽管各船之间床位的价格并不一定一致，但乘客通常会为一张吊床床位支付每天 5 sp 的租金，而私人房间的床位则可以收取每天 2 gp 的租金。
货物 Cargo。列表中显示了相应类型船舶可以装载货物的最大吨数。
伤害阈值 Damage Threshold。船舶受到的单次总伤害未达到船舶的伤害阈值时，船舶将免疫这次伤害。只有当伤害达到或者超过其伤害阈值，船舶所受伤害才能按正常方式计算。
任何无法达到伤害阈值的损伤将被视为轻微刮蹭，且并不降低船舶的生命值。
船舶修理 Ship Repair。当船舶处于停泊状态时，可以对其损伤进行修理。每修复 1 点生命值需要花费 1 日时间和价值 20 gp 的物料和劳动成本。

# table 空运及水运载具 Airborne and Waterborne Vehicles
船舶类型 价值 速度 船员 乘客 货物(吨) AC HP 伤害阈值
飞船 Airship 20000gp 8mph 10 20 1 13 300 无
桨帆船 Galley 30000gp 4mph 80 无 150 15 500 20
龙骨船 Keelboat 3000gp 1mph 1 6 ½ 15 100 10
单帆长船 Longship 10000gp 3mph 40 150 10 15 300 15
划艇 Rowboat 50gp 1½mph 1 3 无 11 50 无
帆船 Sailing ship 10000gp 2mph 20 20 100 15 300 15
战船 Warship 25000gp 2½mph 60 60 200 15 500 20

# 船难 Shipwrecks
所谓船难是一种小型的触发事件，它简单易用且效果拔群。
你可以在触发事件后，让角色们体验在怪物遍布的小岛上厮杀的快感，或者（飞船遇难时）让他们迫降到某座异域风情的小岛里冒险。船难的发生不需要其他的先决条件，只要你需要，就可以让它合理的进行触发。
冒险旅途中可能发生各种事故：穿越风暴，在石滩或暗礁上搁浅，被海盗袭击而沉没，甚至被海怪拖进水底，这些情况即使最强的船舰也无法绝对避免。一场风暴或一条饥饿的巨龙都可以轻易摧毁一艘飞船。另一方面，船难事件可以用来强行改变冒险战役的行程。不过即使如此，用这种事件把玩家都杀死或者直接结束冒险战役可不是什么好点子。
如果你的冒险战役设定让角色们的船遇上船难，应该直接假设角色们在船难后依然留着随身穿戴的装备和财物。而 NPC 和船上货物的命运则可以视情况斟酌。

# 天空 The Sky
飞行中的角色在地点间移动时，可以直接按直线航行，并忽略一切地形因素，以及非飞行怪物威胁和非远程的攻击。
按照《玩家手册》的描述，通过法术或者魔法物品运作的飞行旅行，将按步行旅行的规则一样运作。作为飞行坐骑的生物每飞行 3 小时必须进行 1 小时的休息，并且每天不能进行超过 9 小时的飞行作业。按这个规则举例，角色骑着狮鹫griffon（拥有 80 尺飞行速度）旅行，每小时可以飞行 8 里，一天进行 9 小时飞行总计可以飞行 72 里，期间必须进行两次1 小时时长的休息。不会疲倦的坐骑（比如飞行构装体）不受这个规则所限。
冒险者们飞越天空时，随机遭遇的检定频率跟一般情况相同。飞行中的角色忽略所有不可飞行生物的影响，除非角色正贴近地面飞行且可作为该生物的远程攻击目标。飞行中的角色可以随意指定地面上的生物为目标，随时与该目标进行交互。

# 陷阱 Traps
陷阱无所不在。在古代的墓穴深处，就算只是踏错一步也可能触发一连串可轻易切开护甲与骨头的旋刃陷阱。看似无害地悬挂在洞穴入口的藤蔓也可能会攫抓并掐死任何试图拨开它们通过的人。隐匿在树冠间的捕网会给任何从下方穿过的旅人一个沉痛的教训。在 D&D 的游戏中，任何不够谨慎的冒险者都很有可能被摔死、被活活烧死或被涂毒的飞镖射杀。
本质上，陷阱可以由机械或魔法制造。机械陷阱Mechanical traps 包括了陷坑、箭陷阱、落石、充水房间、旋刃，以及其他任何藉由机械构造来运作的陷阱。魔法陷阱Magic traps 则分为魔法装置陷阱 Magical device trap 与法术陷阱 Spell traps。魔法装置陷阱会在被激活时释放相应的法术效应，而法术陷阱则是诸如守卫刻文 glyph of warding 或魔法徽记 symbol 一类运作模式的法术。

# 游戏中的陷阱 Traps in Play
当冒险者们经过一个陷阱时，你必须知道该陷阱会被如何触发以及它能做什么，从而让角色有机会侦测到陷阱并对其进行解除或者规避。

# 触发陷阱 Triggering a Trap
大多数的陷阱会在一名生物踏上某处或者碰到某物时触发，而该物或该处通常都是陷阱制作者想要保护的对象。通常的触发条件包括踩到压力板或踩到地板虚假的部分，拉扯到拌线，转动门把，或是对门锁使用错误的钥匙。魔法陷阱经常设计成当一名生物进入某区域或是触碰某物件时自行启动。
有些魔法陷阱（例如守卫刻文 或魔法徽记）会有更复杂的触发条件，包括避免陷阱激活的口令。

# 侦测与解除陷阱 Detecting and Disabling a Trap
通常陷阱的一部分只需透过谨慎的察看便可以发现。角色或许可以发现凸起的石板下隐藏着压力板，察觉陷阱拌线反射出来的一丝微光，注意到墙上的小洞其实是喷发火焰束的细孔，或是其他任何可能指出陷阱存在的征兆。
陷阱的描述中会指出对其进行侦测或解除所需的检定以及相应的 DC。主动寻找陷阱的角色可以尝试进行一次感知（察觉）检定来对抗陷阱的 DC。你也可以将陷阱的 DC 与所有角色的感知（察觉）被动值进行比较，来决定队伍是否有人会在经过时发现陷阱的存在。如果队伍成员在陷阱触发前发现其存在，他们就可以尝试将其解除，具体可以是永久拆解陷阱或者只是让陷阱停止运作一段足够长的时间让队伍通过。
面对魔法陷阱时，根据陷阱的相关描述，任何角色都能以一次智力（奥秘）检定，对该陷阱进行侦测或解除。同一陷阱这两项互动的 DC 相同。此外，法术解除魔法 dispel magic 也有一定的几率使魔法陷阱无效化，而相关陷阱的描述中通常都会给出使用解除魔法 时相应的属性检定 DC。
给定的陷阱大多都包含有足够详细的描述，以供你判定角色的动作是否在陷阱的生效范围内。尽管如此，陷阱的判定也不该凌驾于某些有趣的点子。参考陷阱的描述，并运用常识进行想象，最后再决定所发生的具体事件。毕竟陷阱在设计时，并没有把角色可能执行的所有动作都写进其描述内容中。
角色执行的动作有时会直接揭露陷阱的伪装，这时你可以让角色们略过侦查检定直接发现陷阱。例如，一名角色翻开地毯露出其下掩盖的金属压板。该压板就是某陷阱的触发机关，而该角色无需进行属性检定即可直接发现该陷阱的存在。
有时角色们可以实施一些稍复杂操作来绕过陷阱效应。
例如，我们假设有一个设置好陷阱的宝箱。如果不操作宝箱两边隐藏的手柄而直接打开宝箱时，其内部机关会在宝箱打开的同时触发，并向前方所有人射出一片毒针。再假设角色们经过各种检查后仍无法确定宝箱是否设置了陷阱。最后他们决定，与其直接打开箱子不如先在箱子前立一面盾牌，再用一根铁棍把箱子捅开。这时触发陷阱所射出的毒针将被盾牌挡下，而陷阱的效应则成功被绕过。
设置好的陷阱通常伴有解除或绕开陷阱的机关。按常理，拥有智能的怪物在其巢穴周围设置陷阱时，必须考虑到其本身在巢穴范围活动时不被陷阱所伤。因此这一类陷阱往往隐藏着使触发器无效化的拉杆，或者是提供绕过陷阱的密道。

# 陷阱效应 Trap Effects
陷阱的效应囊括各种结构原理，包括箭射，矛刺，刀砍，毒药，毒气，喷火，以及深坑。它可能仅仅是产生轻微的干扰，也可能造成足以致命的打击。其中最致命的某些陷阱类别则糅合了各种结构，用以格杀，伤害，囚禁，或是击退触发机关的倒霉鬼。关于触发效应的详细说明则包含在陷阱对应的描述文字中。
陷阱的攻击加值，抵抗其效应的豁免 DC，以及其造成的伤害取决于陷阱的危害度。参考表格“陷阱豁免 DC 与攻击加值”和“各等级下危害度对应伤害”以决定所使用陷阱基于三个危害度等级中的那一级。
根据陷阱的既定危害度等级进行区分：阻碍 setback 等级的陷阱不会令角色死亡或遭受重伤；危险 dangerous 等级的陷阱可以重伤（并有潜力杀死）角色；而致命 deadly 等级的陷阱则可以直接杀死角色。

# table 陷阱豁免难度等级与攻击加值 Trap Save DCs and
Attack Bonuses
陷阱危害度 豁免 DC 攻击加值
阻碍 setback 10~11 ＋3 至＋5
危险 dangerous 12~15 ＋6 至＋8
致命 deadly 16~20 ＋9 至＋12

# table 各等级下危害度对应伤害 Damage Severity by Level
角色等级 阻碍 危险 致命
1~4 级 1d10 2d10 4d10
5~10 级 2d10 4d10 10d10
11~16 级 4d10 10d10 18d10
17~20 级 10d10 18d10 24d10

# 复合陷阱 Complex Traps
复合陷阱运作起来跟标准陷阱相似，只是它会在每轮都执行一系列动作。因此有时侯，复合陷阱运作的过程将更像一场战斗遭遇。
复合陷阱激活后先骰先攻，其骰值可以加入其描述中包含的先攻加值。此后，该陷阱会在每个其自己回合开始时自行激活并执行一个特定的动作。该动作可能是对闯入者的连番攻击，或是产生一个随时间变化的效应，又或是造成一个动态的威胁。此外，复合陷阱可以如普通陷阱一样被侦查，解除或绕开。

# 陷阱效应 Trap Effects
陷阱的效应囊括各种结构原理，包括箭射，矛刺，刀砍，毒药，毒气，喷火，以及深坑。它可能仅仅是产生轻微的干扰，也可能造成足以致命的打击。其中最致命的某些陷阱类别则糅合了各种结构，用以格杀，伤害，囚禁，或是击退触发机关的倒霉鬼。关于触发效应的详细说明则包含在陷阱对应的描述文字中。
例如，慢慢淹没房间的陷阱更适合作为复合陷阱运作。该陷阱会在每个其自己回合提升房间的水位，并在若干回合后让整个房间完全淹没。

# 陷阱范例 Sample Traps
以下按字母顺序列举若干具有不同效应的魔法陷阱与机械陷阱。

# 塌方 Collapsing Roof
机械陷阱该陷阱以一根绊脚线触发，陷阱激活后一处不稳定天花板的支撑点将被破坏。
绊脚线离地 3 寸，其两头连接着两根支撑柱。辨认绊脚线所在位置的 DC 为 10。成功进行 DC 15 的敏捷检定后，可以用盗贼工具使绊脚线无害化。没有盗贼工具的角色，可以用锋利的武器或工具进行同样的检定，但检定时具有劣势。解除陷阱的检定失败时，陷阱将被触发。
任何人都可以对绊脚线连接的支撑柱进行检查，并轻易发现它们只是脆弱的支撑着天花板。任何角色都能以一个动作绊倒支撑柱，并触发陷阱的效应。
绊脚线上方的天花板严重失修，任何人都可以看出其有着坍塌的危险。
陷阱触发时，不稳定的天花板坍塌下来。所有在不稳定区域下的生物必须成功通过一次 DC 15 的敏捷豁免，否则受 22（4d10）的钝击伤害，豁免成功则伤害减半。陷阱触发后，该区域的地面将铺满碎石并成为困难地形。

# 落网 Falling Net
机械陷阱
该陷阱以一根绊脚线触发，陷阱激活后将一张悬挂在天花板上的捕网释放下来。
绊脚线离地 3 寸，其两头连接着两根立柱或树干。辨认绊脚线所在位置的 DC 为 10。成功进行 DC 15 的敏捷检定后，可以用盗贼工具使绊脚线无害化。没有盗贼工具的角色，可以用锋利的武器或工具进行同样的检定，但检定时具有劣势。解除陷阱的检定失败时，陷阱将被触发。
陷阱触发时，悬挂的捕网被释放并覆盖一处 10 平方尺的区域。被困在捕网下的所有生物受束缚，且所有无法成功通过DC 10 力量豁免检定的生物应击倒地。这时，任何生物都能以一个动作进行一次 DC 10 的力量检定，并在检定成功时从捕网中释放自己或任何可以触及的目标。捕网拥有 AC 10 和 20点生命值，对其造成 5 点的挥砍伤害后可以破坏 5 平方尺方形区域的捕网（AC 10），并释放破坏区域内的所有生物。

# 喷火雕像 Fire-Breathing Statue
魔法陷阱
该陷阱在闯入者踩踏一块隐藏的压板时触发，陷阱激活后附近一尊雕像将释放一团魔法烈焰。该雕像可以是任何形象，比如一条龙或是一个正在施法的法师。
由于地板和墙壁上的焦痕，辨认压板所在位置的 DC 为15。感应魔法存在的法术或其他效应（如法术侦测魔法 detectmagic）可以显现雕像周围的塑能魔法灵光。
陷阱触发时，压板必须承受超过 20 磅重量。激活陷阱后，雕像向其前方 30 尺的锥状区域释放火焰。火焰区域内的每个生物必须成功通过一次 DC 13 的敏捷豁免，否则受 22（4d10）的火焰伤害，豁免成功则伤害减半。
用一根长铁钉或其他物品楔紧压板后，陷阱的触发器即可被无效化。而对雕像施展法术解除魔法 dispel magic 并生效（DC 13）后，即可以彻底解除该陷阱。

# 陷坑 Pits 
机械陷阱
以下列举出四种基础陷坑陷阱。
普通陷坑 Simple Pit。普通陷坑即是挖在地上的一个深坑。
坑洞用大块布料掩盖并以灰土和杂物伪装好。
辨认陷坑所在位置的 DC 为 10。任何站在陷坑上的人将连人带布盖跌入深坑内，并根据陷坑的深度受到伤害（通常为10 尺或者更深）。
隐蔽陷坑 Hidden Pit。隐蔽陷坑的掩盖材料与结构设计成跟周围的地板相仿。
成功通过 DC 15 的感知（察觉）检定后，可以从地上脚印的轨迹发现陷坑盖板的存在。成功通过 DC 15 的智力（调查）检定后，可以确认整个陷阱在地板上的位置。
生物踏上隐蔽陷坑时，其盖板将像活板门一样打开，并使闯入者坠入坑底。深坑通常深 10 至 20 尺或更深。
陷坑被发现后，可以用长铁钉或类似物品楔入坑盖与周围地板之间，以防止盖板打开从而使陷阱无效化。对陷阱盖板使用法术秘法锁 arcane lock 或以相似的魔法将盖板锁紧也可以达到相同的效果。锁困陷坑 Locking Pit。锁困陷坑与隐蔽陷坑相似，但有一个关键不同：陷坑的盖板有一个回弹的结构。生物坠落陷坑后，陷阱的盖板回弹锁紧并困住陷入者。
成功通过 DC 20 的力量检定后，可以从外把盖板打开。
另外，盖板也可以被强行破坏（取决于盖板的资料，相关内容参考第 8 章的指引）。困在陷坑内的角色可以进行一次 DC 15的敏捷检定，并以此用盗贼工具解除盖板的回弹功能，前提是该角色必须可以看到并触及相应的机关。锁困陷坑有时也会设置相应的机关打开盖板（通常隐藏在附近一个密门里）。
尖刺陷坑 Spiked Pit。尖刺陷坑可以是一个普通陷坑，隐蔽陷坑或锁困陷坑，并同时在陷坑底设置上尖锐的木刺或铁刺。坠入陷坑的生物受到坠落伤害外，还额外受到尖刺 11（2d10）的穿刺伤害。更为恶毒的尖刺陷坑会在其尖刺上涂抹毒药，这时，受到陷坑穿刺伤害的角色还必须进行一次 DC13 的体质豁免，豁免失败则受 22（4d10）的毒素伤害，豁免成功则伤害减半。

# 毒镖 Poison Darts
机械陷阱
该陷阱在闯入者踩踏一块隐藏的压板时触发，陷阱激活后若干毒镖从附近墙壁上射出。毒镖的弹出结构可以是弹簧式或气压式。设置好的毒镖的区域可能存在复数的毒镖陷阱，且每个压板都控制着固定位置的毒镖。
发射毒镖的小洞由灰尘和蛛丝掩盖，或精心的设计在浮雕、墙饰或者壁画之中。辨认其所在位置的 DC 为 15。成功通过 DC 15 智力（调查）检定的角色，可以分辨出压板的材料和涂装与周围地板的差异，从而辨认出毒镖陷阱的存在。角色可以用长铁钉或其他物品楔入压板下方防止陷阱被激活，或者用布料或蜡封堵住发射口阻止飞镖射出。
陷阱触发时，压板上的承重必须超过 20 磅。激活陷阱后，四支飞镖从墙上射出。射出的每支飞镖瞄准压板所在处 10 尺范围内，并拥有+8 的命中加值（其攻击检定无视视觉影响，如果区域内没有目标则飞镖不命中任何东西）。被命中目标受到 2（1d4）的穿刺伤害，并且必须进行一次 DC 15 的体质豁免，豁免失败则受 11（2d10）的毒素伤害，豁免成功则伤害减半。

# 毒针 Poison Needle
机械陷阱
毒针陷阱隐藏在宝箱箱锁或其他能够开启的装置之中。
当以对应钥匙之外的方式打开箱子时，会弹出一根钢针并对开锁者注射一剂毒药。
陷阱触发时，一根针头从锁里伸出 3 寸长，并命中其攻击范围内的生物目标。被命中生物受 1 点穿刺伤害，外加 11（2d10）的毒素伤害，并且必须成功通过一次 DC 15 的体质豁免，否则中毒 1 小时。
成功通过 DC 20 智力（调查）检定的角色，可以发现锁的改动痕迹，进而发现毒针的存在。成功通过 DC 15 敏捷检定的角色，可以使用盗贼工具解除陷阱移除毒针。陷阱的机关也会在开锁失败时触发。

# 滚石 Rolling Sphere
机械陷阱
该陷阱在其压板上承重超过 20 磅时触发。陷阱激活后，天花板上一扇活板门打开，并放出一个直径 10 尺的实心球状滚石。
成功通过一次 DC 15 感知（察觉）检定的角色，可以辨认出活板门与压板的所在位置。成功通过 DC 15 智力（调查）检定的角色，可以分辨出压板的材料和涂装与周围地板的差异，从而辨认出陷阱的存在。相同的检定也可以用于搜索天花板，并从活板门的石工工艺辨认陷阱的存在。此后，可以使用长铁钉或其他物品楔入压板下方以防止陷阱被激活。
陷阱激活后，所有在场生物与陷阱本身一起骰先攻。滚石的先攻检定具有+8 加值。滚石可以在其自己回合里直线移动60 尺。此外，滚石可以穿过有生物的空间，生物也可以穿过滚石所在空间并视为穿过困难地形。当滚石进入生物所在空间，或生物在滚石滚动途中进入其所在空间时，该生物必须成功通过一次 DC 15 的敏捷豁免，否则受 55（10d10）的钝击伤害，并因被滚石击中而倒地。
滚石撞上墙壁或类似墙壁的障碍物时停止滚动。它无法通过转角，但有些精明的地城建造者会为其设计缓变的弯角，以让滚石保持滚动拐弯，甚至进入附近预先安排好的通道里。
滚石周边 5 尺范围内的角色，可以在成功通过一次 DC 20的力量检定后，以一个动作削减滚石 15 尺的滚动速度。当其速度降至 0 时，滚石停止移动并失去威胁。

# 湮灭法球 Sphere of Annihilation
魔法陷阱
一张石刻面孔的口中散发着魔法力量与浓厚的黑暗气息。
石口为直径 2 尺的粗糙圆形，里面没有一点声响，光线无法照亮其内，并且任何进入其中的物质都将消失不见。
成功通过一次 DC 20 智力（奥秘）检定后，可以发现石口中安装着一个湮灭法球 sphere of annihilation，且其无法被控制或移除。法球的资料与普通的湮灭法球 相同，其具体描述可以参考第 7 章“宝藏”。
有时侯该陷阱的石头脸上会附加附魔法术，用以引诱生物接近陷阱甚至自行爬入石口之内。其效应类似嫌恶/关怀术antipathy/sympathy 的关怀 sympathy 作用。用法术解除魔法dispel magic 对其成功生效后（DC 18）可以移除这些附魔。
"""
