# encode = utf-8

topics = {

}

keyword_list = {

}

creating_a_multiverse_article = """
第 2 章：创建整个多元宇宙 Creating a Multiverse
冒险者随着等级提升其冒险也扩展至另一现实维度——即多元宇宙的各存在位面。角色们可能应召到恐怖的无底深渊 the Abyss 中解救一名朋友，或是于海神之河 River Oceanus闪光的水面上航行。他们将在约瑟园 Ysgard 与友善的巨人们举行宴会，再去混沌海 Limbo 直面一位身形瘦削的吉斯泽莱智者。
诸存在位面定义了一些极其怪异而危险的环境。其中那些匪夷所思的处所甚至完全超乎自然世界的料想范围。位面冒险可提供与普通状况迥然不同的惊异危机。而冒险者们将在固体火焰构成的街道上行走，或在每个黎明与无限复活的亡者们在战场上以战斗自证其身。
"""

the_planes_article = """
诸位面 The Planes
各式各样的存在位面是神秘与传说所在的国度。它们并不只是单纯的另一个世界，其中还存在着由魂与元素的准则所构成和运作的另一维度。
外层诸位面是精神与思想所在的领域，是天界生物、邪魔以及神祇的栖息地。举例如极乐境 Elysium 位面就不只是一个善良生物的居住地，也不单纯是善良生物死后所到之处。它作为一个至善的位面，是一处邪恶无法滋长的精神领域。而其作为一处明确的地点，却也是存在物与意识共存的区间。
内层位面是火水土气四象物质精华与元素本质的具现。
举例如火之位面即是具象化了火的本质。其整个位面都体现着火属性的本质：能量、激情、多变与破坏。在这个由跃动之火支配，且可视可查的领域中，即使坚固如青铜与玄武岩等物件在其内都会随着烈焰舞动。
上述两者之间的物质位面，便是由哲学与元素之力碰撞混杂而成的血肉凡胎神秘与各种物质所在之地。D&D 的诸多世界存在于物质位面中，使得它得以作为大多数战役与冒险的起始地。而多元宇宙的其余部分则由其与物质位面的关系所定义。

位面分类 Planar Categories
默认的 D&D 宇宙体系下诸位面以下列组别进行分类：
物质位面及其回响 The Material Plane and Its Echoes。妖精荒野 Feywild 与堕影冥界 Shadowfell 都是物质位面的映射。
中转位面 The Transitive Planes。以太位面 Ethereal Plane 与星界位面 Astral Plane 都是不具特性的位面，其主要用作位面之间的连接通路。
内层位面 The Inner Planes。四大元素位面（火、水、土、气），加上围绕在其中的元素混乱 Elemental CHaos，构成诸内层位面。
外层位面 The Outer Planes。十六个外层位面分别对应着除绝对中立外的八种阵营，并以哲学思维的差异进行区分开来。
正负能量位面 The Positive and Negative Planes。这两个位面填充了宇宙体系的其余部分，并提供着构成多元宇宙存在基础的生命与死亡的原材料。

位面组合 Putting the Planes Together
如同《玩家手册》中的描述，预设的 D&D 宇宙体系包括了超过二十多个位面。而你可以在自己的战役中自行决定其内该包含哪些位面。你可以从常规位面中获得启发，或是借鉴地球上的神话，甚至是发挥幻想自行创作。
此外，大部分 D&D 战役都至少包含下列元素：
• 一个邪魔的起源位面。
• 一个天界生物的起源位面。
• 一个元素的起源位面。
• 一处众神之地，前三者中的任一项都可包含于此处。
• 一处凡人死后灵魂的归宿，前三者中的任一项都可包含于此处。
• 一种在位面之间进行转移的方式。
• 一种方法，得以让法术或怪物利用星界位面和以太位面起作用。
你决定好要在战役中使用的位面后，可以先将其集合起来组成一个条理清晰的宇宙系统。由于位面间的移动主要依赖连接各位面的魔法传送门（就算是途经中转位面也是如此），因此不同位面间的关系都只是理论层面的概念。多元宇宙中的存在无法像我们观看书中图表一样，俯视诸位面的结构。凡人们无法证实天界山 Mount Celestia是否夹在双生天堂Bytopia 与世外桃源 Arcadia 之间，但这种结构依然可以通过这三个位面对应的哲学本质与其在守序与善良阵营的价值关系推测出来。
智者们曾构筑过几种理论模型，以求理清一团乱麻的诸位面（尤其是外层位面）之间的关系。这些理论中最常见的三种即巨轮说、世界树说以及世界轴说。你可以直接采用其中任一种模型，或是自创另一种学说以适应你自己游戏中的位面概念。

自创位面 Inventing Your Own Planes
本章所述的每个位面都会对那些敢于进入其内的旅行者产生至少一种的显著效应。当你决定自创位面时，考虑沿用这种模式会说个不错的点子。创作一个简单的特质能够吸引玩家的注意，而其在加深大家游戏印象的同时，尽量不要令桌面游戏变得更烦琐。此外，你可以尝试使该地域反映出一定的哲学性与情绪性，而不只是其物理特征。

巨轮 The Great Wheel
《玩家手册》中介绍的默认宇宙系统结构，将诸位面视觉化为一组同心的轮环，其中心为物质位面与其回响。诸内层位面围绕物质位面组成一轮环，其内还包裹着以太位面。紧接着其外则是外层位面组成的另一轮环，并定位于前一环的周围与后方（或其上下方），并按其各自所属阵营排列起来，再由外域 Outlands 相连。
这种结构合理的解释了冥河 River Styx 为何沿途流过诸下层位面，并且如串珠般连接了修罗场 Acheron，九层地狱the Nine Hells，焦炎地狱 Gehenna，哈迪斯 Hades，卡瑟利Carceri，无底深渊 the Abyss 以及喧癫空隧 Pandemonium 等位面。但这并不是其河道形态的唯一假设。

世界树 The World Tree
另一种关于诸位面组合方式的设想，如其名所述即将其意象化为一棵宇宙大树的根枝。
例如，北欧神话 Norse 宇宙体系的中心为世界树 Yggdrasil。其三支根须连接着三个界域：阿斯嘉德 Asgard（一个外层位面，其内包含了瓦尔哈拉 Valhalla、瓦纳海姆 Vanaheim、艾夫海姆 Alfheim 和其他地区），米德加德 Midgard（物质位面）和尼夫海姆 Niflheim（冥域 the underworld）。而彩虹桥 theBifrost 则是作为中转位面连接着阿斯嘉德和米德加德。
与之相似，被遗忘国度众神所在的诸天界位面其中一种形象也是作为世界树的分枝，而邪魔所在的诸位面则由血之河 River of Blood 串联。两者之间则由各中立位面将其隔离开来。这些位面都各自是某位或某些神祇的领域，同时也是天界生物和邪魔生物的家园。

世界轴 The World Axis
这种宇宙图景中，物质位面与其回响位于两个对立界域之间。浮于上空的星界位面（或者众星之海 Astral Sea）包含着无数的神圣领域（外层位面）。沉于物质位面下方的元素混沌 Elemental Chaos 则是单一无差别的元素位面，所有元素都在其内互相糅合在一起。元素混沌的底部则是无底深渊 theAbyss，有如宇宙大画卷上撕裂的一个破洞。

其他版本 Other Visions
在创建你自己的宇宙体系时，可以考虑以下的替代项。
总宇宙 The Omniverse。这种概括的宇宙体系至少包括：一个物质位面，诸中转位面，唯一的元素混沌，一个生活着善良神祇和天界生物的上层天堂以及生活着邪恶神祇和邪魔生物的冥域。
并列位面 Myriad Planes。该宇宙体系中，无数位面如肥皂泡般挤在一起，相互之间存在着各种联系。
星系 The Orrery。所有内层位面与外层位面环绕着物质位面，随着它们接近和原理世界而对其产生或多或少的影响。艾伯伦世界正是使用这种宇宙模型。
蜿蜒之路 The Winding Road。这种宇宙体系中，每个位面都是一条无尽长路的一个停靠站。每个位面与另两个位面相连，相邻位面却又并不具有连续性：旅行者可以从天界山Mount Celestia 的斜坡一直走向 Gehenna 的斜坡。
奥林匹斯山 Mount Olympus。希腊的宇宙体系中，奥林匹斯山 Mount Olympus 矗立于世界（物质位面）中心，其高耸的峰顶实际上是另一个存在位面：众神的家园奥林匹斯Olympus。除哈迪斯 Hades 之外，所有希腊神祇都居住于奥林匹斯领域内。而在以其统治者命名的哈迪斯，凡人的灵魂以不稳定的脆弱状态存在，并逐渐消散殆尽。在哈迪斯之下则是囚禁泰坦族，无尽黑暗的塔尔塔洛斯 Tartarus。物质位面里，已知世界的西边是蒙受祝福之地，极乐世界 Elysian Fields。而伟大英雄们的灵魂正是长眠于此。
太阳船 Solar Barge。埃及宇宙体系的主体是太阳每天的航路：一条跨越物质位面的轨迹，直达其西边正义者灵魂们永世受赏之地 Offering Fields，然后紧接着绕到世界的底下穿过噩梦般的十二小时之夜 Twelve Hours of Night。太阳船本身即是一个微小的外层位面，只是其旅程所在是与星界位面 AstralPlane 和其他外层位面不同的位置。
单一世界 One World。这种模型中不存在其他位面，而物质位面则包含了诸多地点如：无尽的无底深渊 Abyss，闪耀的天界山 Mount Celestia，机械境 Mechanus 中的奇异城市，修罗场 Acheron 中的要塞，等等。所有这些位面都是世界上存在的地点，都可以用常规的方式到达——只是还需要付出非凡的努力，例如，必须航行跨越大海才能到达蒙福之岛，极乐境 Elysium。
里世界 The Otherworld。这种模型的物质位面有一个双生国度，其内分布着的各个地点即承担了其他位面的作用。其形式类似妖精荒野 Feywild，它与物质位面重叠且可以通过与世界特别相近的“薄弱点”进入其内。比如穿越某些洞穴，横跨大海或是穿过森林深处的妖精之环。其内有黑暗邪恶的区域（邪魔和邪神的家园），神圣的岛屿（天界生物和受祝福的死者之灵的家园），以及元素之怒的国度。里世界有时会受一座永恒之城监视，又或者受四座代表不同存在概念的城市监督。凯尔特宇宙体系有一个称为提尔纳诺 Tir na nOg 的里世界，而一些来自亚洲神话的灵感也有说到一个类似的概念称作灵界 Spirit World。
"""

planer_travel_article = """
位面旅行 Planar Travel
冒险者旅行到其他存在位面时，他们可能在其传奇旅程中被迫面对超自然的护卫者并历尽各种艰难困苦。不管旅行者们是找到一面魔法传送门或是以魔法承载其前行，旅行的方式某种程度上也决定了其旅途的性质，以及其沿途遇上何种磨难。

位面传送门 Planar Portals
[雷斯林 Raistlin的]双眼注视着传送门，目不转睛地研究着每个细节——哪怕并不是真有这个必要。他曾无数次在睡着或清醒的梦中见过它。启动它的法术很简单，并不需要多复杂或玄奇的东西。五头龙的脑袋每个都包裹护卫着传送门，必须以合适的命令语平息其怒火，且每个都必须按正确的顺序说出。而在其完成的同时，白跑牧师边劝诫圣武士上前调停，并保持传送门开启以便让大家通过。然后门扉便在他们通过后迅速关闭。
而他将面对一生中最大的挑战。
——玛格丽特·魏斯 & 崔西·希克曼，《烽火之卷》
—Margaret Weis & Tracy Hickman, War of the Twins

“传送门 Portal”指的是位面中的某个特定地点与另一位面特定地点的静态连接。一些传送门的作用方式就像普通的门道，它们看起来如同一面清晰的窗户或一段雾气笼罩的道路，而只需走过这段门道便可简单的实现跨位面旅行。另一种传送门则是一处在多位面中同时存在的地点——立起的石柱排成的环形，悬浮在空中的塔楼，不断航行的船只，甚至可以是一整个城镇。某些旋涡区域便连接着物质位面与以太位面地形状况相似的地点，比如火山的中心（连接火之位面）或大洋深处（连接水之位面）。
穿越位面传送门是从物质位面到另一存在位面去最简单的方法。然而传送门大多不会简单直接的在冒险中出现。
首先，冒险者们必须找到连接他们目的地的传送门所在之地。而大多数这种传送门都设立在偏僻之地，而其周边区域则显示出与其连接地方相似的整体特性。例如，通往天堂天界山的传送门就可能位于一座高山之巅。
其次，传送门还常常伴有负责排除外人的守卫。随着传送目的地的不同，传送门需要排除的“不受欢迎者”可能包括邪恶的任务、善良的任务、软弱者、盗贼、任何长袍袈身者，甚至是任何凡俗生物。通常传送门的守护者都是一些强大的魔法生物，诸如一个巨灵、狮身兽、泰坦或是传送门目的地的原生生物。
最后，大部分传送门都不会一天 24 小时敞开，而仅仅在特定情况下或当某些特殊需求被满足时打开。一扇传送门可以拥有任何其他的概念，但最常见的是一下几点。

时间 Time。传送门仅在特定的时间生效：物质位面的满月时分，或每十天启动一次，或当星星位于特殊位置上时。传送门一旦打开便可以在有限时间内保持开放。诸如满月之后开启三日，或 4 个小时，或 1d4+1 轮。
条件 Situation。传送门仅在特殊情况被实现后才开启。一扇关键条件特质的传送门开启于一个晴朗的夜晚，或当下雨时，或当一个特定的法术在其附近施展时。
随机 Random。一扇随机性的传送门会随机选择开启的时间，并在启动后维持随机的时间直至关闭。通常这样的传送门可以让 1d6+6 的旅行者通过，然后关闭 1d6 日。
命令语 Command Word。传送门仅在有人说出特定的命令语后开启。命令语有时需要由穿过传送门的人说出（否则该传送门就只是一扇普通的门或普通道路）。另一种传送门则是在说出命令语后开启，然后维持存在一定的时间。
钥匙 Key。传送门会在旅者持有与其对应的特定物件时开启，该物件的作用就如同这扇门的钥匙。作为钥匙的物品可以是一个常见的物件或是为传送门特别制作的钥匙。外域Outlands 上空的印记城 Sigil，正是因为其内无数需要钥匙物件激活的传送门而被称为众门之城 City of Doors。
研究和寻找某扇传送门，有时还要让角色们追寻其钥匙物品，到古图书馆里搜寻命令语，或是寻找智者以获得造访该传送门的正确时间，并以此引导他们开启更进一步的冒险。

法术 Spells
萨雅 Sarya抬手高声吟唱某个极强法术的咒语。这法术正是她所知道最危险的法术之一，其足以撕裂位面壁垒并建起与另一存在国度桥接的魔法通路。迷锁回应出嗡嗡的响声，古老装置中的奇异脉搏转变为另一种截然不同的律动。成竹在胸的萨雅无视迷锁石阵的变化专心施法，娴熟的完成了开门的法术。
“门扉已开！”她喊道，“马尔凯基德 Malkizid，上前！”
萨雅眼前一个散发着金色魔法的巨大的环圈在空中接合起来。她可以从环中窥见马尔凯基德的国度——炎热沙漠的炼狱废土中布满风化的裂隙，漆黑翻腾的天幕被绯红的闪电撕扯得四分五裂。随后，大魔鬼马尔凯基德显现在门扉里，并随着轻盈的步伐穿过他的炼狱位面走进迷锁的房间内。
——理查德·贝克，《至远之触》
—Richard Baker, Farthest Reach
许多法术都可以直接或间接进入其他的存在位面。法术异界传送 plane shift 和异界之门 gate 能够以不同的精准度将冒险者们直接传送到任意的其他位面。
以太化 Etherealness 则可以让冒险者们进入以太位面。而法术星界投影 astralprojection 则可以让冒险者们将自身投影到星界位面，然后再从该处继续旅行至外层位面。

异界传送 Plane Shift。
异界传送 plane shift 有两个重要限制。第一是法术的构材：一根与目的地所在位面完成同调的分叉金属短棒（形似音叉）。该法术需要正确的共鸣频率来将其引导到正确的地点，而叉子也必须以正确的金属制作（有时也会使用复杂的合金）才能够正确的灰机法术的魔力。制作这种叉子需要一定的花费（至少 250gp），不过就算是为此搜集其正确规格的情报也可以引出冒险。毕竟，没多少人会自愿前往卡瑟利 Carceri 深处，也因此很少人知道前往该处到底需要怎样的音叉。
第二，除非施法者掌握了目的地的具体情报，否则就无法以该法术到达该处。定位到另一位面的传送法阵可以依靠不同的印记序列来让施法者直接转移到目标法阵中，而这种技术用音叉来实现则很难做到精确到位。此外，该法术还会降施法者传送到目标地点附近一处相似的地点。而无论冒险者们到达何处，他们常常还要再旅行一小段时间才能抵达位面里的任务目标所在处。
异界之门 Gate。
法术异界之门 gate 会打开一扇连接都另一存在位面某一点的传送门。该法术可以给出一个通往位面目的地的捷径，并绕开那些以普通方式旅行至此时路上会遇到的许多警卫与试炼。不过，除最强大的角色外，这项 9 环法术在所有人来都非常遥不可及，而它也无法抵消任何等在目的地的障碍。
异界之门 gate 是个强大的法术但并非绝对可靠。神祇、恶魔领主或其他的强大实体都可以阻止这样的门扉在其领域中打开。
"""

astral_plane_article = """
星界位面 Astral Plane
赫丽丝特 Halisstra睁开眼睛，发现自己正漂浮在无边无际的银海之中。柔和的灰云在远处慢慢地移动，奇异的黑色光带在空中猛烈扭动，其两端遥远到让人无法观测，而其中部则像孩子指尖之间滚动的绳子一样剧烈的翻腾。她低下头，想看看是什么东西在支撑自己，却只看到脚下和周围都是一样奇异的珍珠般的天空。
眼前的惊异景色让她猛吸一口气，随即感觉到肺里充满了某种比空气更甜的东西，虽然比空气还要结实，但却意外的没令她觉得呕吐或溺水，自己反而已经完全适应与该物。她发现自己沉醉在如此简单的呼吸动作中，四肢也不由得兴奋得发抖。
——理查德·贝克，《定罪》
—Richard Baker, Condemnation

星界位面是思想与梦境的国度，这里的旅客会以离体灵魂的形式抵达外层位面。它是一片广阔的银色大海，其内不分上下，灰与白的丝缕光带不断翻滚着犹如遥远的繁星。广阔空旷的区域占据了众星之海 Astral Sea 中的一大部分。拜访者们偶尔会在银色的虚空中发现某个死去神灵的遗骸或其他随处飘荡的大块东西。而更常见的是各种彩池 color pool——这些魔法之池发出彩光，如同旋转的硬币与闪烁的光耀。
星界位面中的生物不会衰老，也不会受饥渴所苦。因此，生活在星界位面的人形生物（比如吉斯扬基人 githyanki）会在其他位面中建立前哨站（通常是在物质位面），以让自己的孩子们得以成长发育。
星界位面中的旅行者只需用思想就可以移动，只是这里的距离并没有什么意义。尽管如此，生物在战斗时的步行速度（用脚）等于 3×他的智力值。一个生物越聪明，它就越容易通过意志力控制自己进行移动。

星界投影 Astral Projection
以法术星界投影 astral projection 的形式在星界位面旅行设计将一个人的意识投影其中，其通常是为了寻路前往某个外层位面。由于在外层位面中，精神之物都会以物质地点的形式存在，因此外层位面中的旅行者可以如同进行物质旅行一样在其中行动，只是会像梦境一般。角色在此间死亡时（无论是在星界位面中还是在目的地位面里），他并不会因此产生确切的损伤。只有当角色在星界位面时其银线被割断，或其停留在物质位面的身体无助的死去时，该角色才会真正的死去。因此，高等级的角色时常会用星界投影的形式进入外层位面，而不是寻找传送门或使用其他更直接的法术。
只有少数几样东西可以切断这些旅行者的银线，最常见的是心灵风暴（描述见下文）。传说吉斯洋基人的银剑也有这种能力。那些以肉体形式在星界位面旅行的角色（比如以法术异界传送或某个罕见传送门直接来到这里）身上没有银线。

彩池 Color Pools
从星界位面去往其他位面的通道呈现为直径 1d6×10 尺，泛出各种颜色的二维池面。前往另一位面需要找到某个颜色的彩池以到达目的位面。这些通往其他位面的通路可以按表格“星界彩池”中所示，以颜色进行定位。找出合适的彩池是一个概率事件：找到正确的颜色需要花费 1d4×10 小时的旅行时间。

星界彩池 Astral Color Pools
d20 位面 彩池颜色
1 约瑟园 Ysgard 靛蓝 Indigo
2 混沌海 Limbo 乌黑 Jet black
3 喧癫空隧 Pandemonium 洋红 Magenta
4 无底深渊 The Abyss 紫蓝 Amethyst
5 卡瑟利 Carceri 橄榄绿 Olive
6 哈迪斯 Hades 铁锈色 Rust
7 焦炎地狱 Gehenna 赤褐 Russet
8 九层地狱 The Nine Hells 宝石红 Ruby
9 修罗场 Acheron 焰红 Flame red
10 机械境 Mechanus 钻石蓝 Diamond blue
11 世外桃源 Arcadia 橘黄 Saffron
12 天界山 Mount Celestia 金色 Gold
13 双生天堂 Bytopia 琥珀色 Amber
14 极乐境 Elysium 橘色 Orange
15 万兽园 The Beastlands 翡翠绿 Emerald green
16 奔放之野 Arborea 蔚蓝 Sapphire blue
17 外域 The Outlands 皮革棕 Leather brown
18 以太位面 Ethereal Plane 眩白 Spiraling white
19~20 物质位面 Material Plane 银色 Silver

心灵风暴 Psychic Wind
心灵风暴并不是物质性的风，而是一种针对旅行者的思想而不是肉体的风暴。心灵风暴由遗失的记忆、被遗忘的想法、轻微的沉思和潜意识的恐惧组成，它们在星界位面中失去方向并聚集成这种强大的力量。
心灵风暴感官上只是银灰天际瞬时的转暗。几轮过后，该区域就变成如同没有月光的夜晚一样漆黑。在天空变暗的同时旅行者将感受到冲击与颤动，如同位面本身在抵抗这场风暴。随后心灵风暴如同其到来时一样迅速消散，而天空也在随后的几轮时间内恢复正常。
心灵风暴会产生两种效应：位置效应和心理效应。组团行动的旅者将承受同样的位置效应。而每个受风暴影响的旅行者都必须进行一次 DC15 的智力豁免。豁免失败的旅者还将承受风暴的心理效应。掷两次 d20 并参考表格“心灵风暴效应”以确定其位置效应和心理效果。

心灵风暴效应 Psychic Wind Effects
d20 位置效应
1~8 转向；增加 1d6 小时的旅行时间
9~12 偏离航线；增加 3d10 小时的旅行时间
13~16 迷失；旅行时间结束后，角色们到达另一处地方而不是目标地点
17~20 被彩池发送到某个随机位面（按表格“星界彩池”掷骰决定）
d20 心理效应
1~8 被震慑 1 分钟；你可以在你自己每回合结束时再进行该豁免以自行终止该效应
9~10 短暂性疯狂（见第 8 章）
11~12 11（2d10）的心灵伤害
13~16 22（4d10）的心灵伤害
17~18 长期性疯狂（见第 8 章）
19~20 昏迷 5（1d10）分钟；当受到伤害或另一个生物花费一个动作摇醒你时，你身上的该效应也将随之终止

星界位面遭遇 Astral Plane Encounters
来自其他位面的位面旅者和难民在星界位面的广袤区域中游荡。星界位面中最著名的居民便是吉斯扬基人 githyanki，作为被放逐的掠夺者种族，他们乘坐光洁的星界飞船四处航行，并屠杀遇到的星界旅者，掠夺所有与星界接壤的位面。他们悬浮于星界位面一块巨岩上的城市图那拉斯 Tu'narath，实际上是一名死去神灵的身体。
天界生物、邪魔和凡人探险者时常会在星界位面中搜寻彩池，以前往各自的目的地。在星界位面逗留太久的角色可能会遇到一个或更多在其内游荡的天使，恶魔，魔鬼，夜鬼婆，尤格罗斯魔，或其他的位面旅者。
"""

ethereal_plane_article = """
以太位面 Ethereal Plane
塔姆林 Tamlin感觉到一只手压在自己身上，并感觉到自身体在雾中闪烁。尖声与叫喊在远处响起，身边的墙壁看起来如同只是一片灰影。而黎瓦兰 Rivalen和布伦奴斯 Brennus就站在他身旁。
“以太位面”黎瓦兰说道，“巨龙的吐息在这里就影响不到我们了。”
——保罗·S·坎普，《暗影风暴》
——Paul S. Kemp, Shadowstorm

以太位面是一片迷雾笼罩的维度。它的“滨岸”称为以太边境，这些地区会与物质位面及内层位面相重叠，而这些位面中的每一处空间位置都在以太位面中有一个对应的空间位置。以太边境的能见度只有 60 尺。该位面深处漩涡状的迷雾区域称为“深层以太”，其内的能见度只有 30 尺。
人物角色可以使用法术以太化 etherealness 来进入以太边境。异界传送 plane shift 法术虽然可以传送到达以太边境或深层以太，但其目的地必须是一处明确的地点或某个传送法阵，否则其最终到达处可能是该位面中的任一处地方。

以太边境 Border Ethereal
旅行者可以在以太边境中看到与之重叠的其他位面，只是该位面只会显现为柔化模糊的图像，物体的颜色和边缘也会变得混淆不清。以太居民观察这些位面时就好像隔着一扇扭曲的雾面玻璃，且无法看到该位面 30 尺外的任何影像。相反，在这些重叠的位面中并无法看到以太位面，除非通过某些魔法手段来实现。
通常情况下，在以太边境中的生物不能攻击重叠位面中的生物，反之亦然。以太位面中的旅行者在重叠位面里的人眼中处于隐形且绝对安静的状态，而重叠位面中的固态物件也不会阻碍以太边境中的生物进行移动。这其中不包括一些特定的魔法效应（包括所由有魔力制作之物）和某些活体存在。
这使得以太位面非常适合用于侦察，监视对手，或者以此实现在不被探测到的情况下四处移动。以太位面中并不遵循地心引力定律，因而其内的生物还可以像步行一样轻松的上下移动。

深层以太 Deep Ethreal
想要前往深层以太的人需要使用法术如异界传送 planeshift，或是通过法术异界之门 gate 和魔法传送门来打通通路。
深层以太的访客被笼罩在翻滚的迷雾中。位面四处弥漫着各中颜色的帷幕，穿过特定帷幕的旅者将被转移至内层位面、物质位面、妖精荒野或堕影冥界的某处。帷幕的颜色显示其内的以太边境与哪个位面相重叠，具体见表格“以太帷幕”。
通过深层以太来实现位面间旅行不同于普通的物理性旅行。在这里距离不起作用，所以尽管旅行者觉得自己可以通过一个简单的动作移动，事实上却无法测量自己速度，也无法跟进时间的流逝。穿越深层以太进行位面间移动的旅行需要花费 1d10×10 小时，而无论其起点和终点为何。不过，生物在在战斗时依然视为以其正常速度进行移动。

以太帷幕 Ethreal Curtains
d8 位面 帷幕颜色
1 物质位面 Material Plane 绿松色 Bright turquoise
2 堕影冥界 Shadowfell 土灰色 Dusty gray
3 妖精荒野 Feywild 乳白色 Opalescent white
4 气之位面 Plane of Air 淡蓝色 Pale blue
5 土之位面 Plane of Earth 红褐色 Reddish-brown
6 火之位面 Plane of Fire 橘色 Orange
7 水之位面 Plane of Water 绿色 Green
8 元素混沌 Elemental Chaos 混转的各种颜色

以太飓风 Ether Cyclones
以太飓风是该位面上的一种蛇形柱状气旋。旋风会突然突然出现并将沿途的以太形体破坏殆尽，再带着所有碎片重新组织。被动感知（察觉）值为 15 或更高的旅行者可以获得1d4 轮的预警时间：来自以太物质的一阵低沉的闷响。无法抵达某个帷幕或传送门以前往别处的旅行者将受到旋风的影响。
掷一次 d20 并参考表格“以太飓风”来决定附近所有生物所受到的影响。
以太飓风最常见的影响是延长旅行的时间。团体中的每个角色都必须进行一次 DC15 的魅力豁免。如果至少有一半人豁免成功，则旅行被推迟 1d10 小时。否则，旅行的时间翻倍。有时候，团队会被吹到某个随机位面的以太边境中。而很罕见的情况下，旋风会在位面结构中撕开一个漏洞，并可能因此将整个队伍带到星界位面之中。

以太飓风 Ethereal Curtains
d20 效应
1~12 延长旅程
13~19 被吹到某个随机位面的以太边境中（从“以太帷幕”表格中掷骰）
20 被仍到星界位面中

以太位面遭遇 Ethereal Plane Encounters
以太边界中遭遇的大多数生物都是物质位面里感官或某些能力可以延伸至以太位面的物种（例如相位蜘蛛 phasespider）。幽魂 Ghost 也可以在以太与物质位面间自由切换。
而在深层以太中，则大多会遭遇到其他的旅行者，尤其是来自内层位面的旅者（比如元素生物、巨灵 genie 和火蜥蜴salamander），偶尔还会遇上天界生物、邪魔或是精类生物。
"""

feywild_article = """
妖精荒野 Feywild
尽管空气中的寒意并未完全消散，但在踏入传送门的哪一瞬间就让人有如在温暖的浴室中安顿下来。起初一切都显得如此宁静——河流趟过脚下岩石的水声，岸上青蛙和蟋蟀的鸣叫，身后城镇傍晚的喧嚣……片刻过后，世界又瞬间爆发生机。青蛙与夜鸟唱着歌，空气中充斥着秋天的气息，月光为花朵洒上蓝色、银色和紫色花纹，连奔腾的河水都奏成了一曲纷繁的交响乐。
——詹姆斯·怀亚特，《警觉之誓》
—James Wyatt, Oath of Vigilance

妖精荒野 Feywild 也被称为妖精位面 Plane of Faerie，是一个柔光和奇想汇聚之地，也是音乐与死亡之地。这里是个永恒的暮光之境，柔和的微风中闪烁着耀眼的仙境之光，树林和田野里萦绕着胖胖的萤火虫在嗡嗡鸣叫。天空被落日余辉的暗淡色彩点亮，但太阳却永远不会真正地落下（或升起），只是一直灰蒙蒙的静止在低矮的空中。喜乐妖精 seelie fey 组成夏之王廷 Summer Court 管治一方的聚居地区域，而远离该区域之处则是缠结着尖齿灌木，且布满浓稠沼泽之地——也正是哀怒妖精 unseelie fey 的完美狩猎场。
妖精荒野的存在与物质位面平行而相互关联，是同一宇宙空间位置处在不同维度上的两面。妖精荒野的景观是自然世界的镜影，同时还要极度放大其特征的形态。一座耸立在物质位面的火山，在妖精荒野中则是一座参天的水晶巨峰，其山体内部还闪耀着塔状的火焰。物质位面中宽敞而浑浊的河流，可能会映照为一条异常美丽而清澈的弯弯溪流。一片湿地则可能会反映为一大片险恶的黑色泥潭。当旅行者们从物质位面的老旧废墟进入妖精荒野时，很可能出现在某座远古精类的城堡的门前。
妖精荒野中栖息着各种林间生物，比如精灵、树妖、半羊人、皮克精和小妖精，以及其他一些魔法生物和普通生物，诸如闪现犬、妖精龙、树人和独角兽。位面中的黑暗区域里则是一些邪恶的生物，如鬼婆、枯枝怪、地精、兽人和巨人。

喜乐妖精与哀怒妖精 Seelie and Unseelie Fey
在妖精荒野中由两位女王分别组成了自己的王廷，而大多数精类都效忠于其中之一。女王泰坦尼亚 Queen Titannia 与她的夏之王廷 Summer Court 领导着喜乐妖精 seelie fey，而空暗女王Queen of Air and Darkness 则统治着暮之王廷 Gloaming Court 并管治其下的哀怒妖精 unseelie fey。
喜乐廷与哀怒廷并非与善恶直接相关，虽然许多人都直接将其视作同等。有许多善良的喜乐妖精，也有许多邪恶的哀怒妖精，但他们之间对立只是源于其女王互相嫉妒的斗争，而并非纯粹的道德立场。妖精荒野中的丑陋居民（如废陋巨人 fomorian 和鬼婆hag）几乎从来不属于任何一个王廷，而精类如独立的小妖精则同时拒绝加入两方王廷。王廷间有时会发起战争，但他们也会以相对友好的方式进行竞赛，有时甚至以微妙的方式相互结盟。

妖精通道 Fey Crossings
妖精通道是位于物质位面中的一种神秘而美丽的地点，是一处连接着妖精荒野和物质位面而形成的一扇近乎完美的镜面。有时，旅行者进入一片林间空地，淌入一个池塘，步入一处蘑菇环或怕入一个树干中时，便是穿过一处妖精通道。在旅行者看来，自己只是一步踏入了妖精荒野中。而其他观察者则只会看到该旅行者在那一刻消失无踪。
妖精通道跟其他位面间传送门一样并非长期开放。有些通道可能在满月时开放，某些可能在黎明时分，又或者是当某有人携带某种特定物品到来时开启。而如果两边的土地上都发生了巨大的改变，就会永久地关闭一个妖精通道——例如，当一座城堡是在物质位面的空地上建起时。

选用规则：妖精荒野魔法 Feywild Magic
有些故事会讲述孩子被精类生物和精魂诱拐至妖精荒野中，然后若干年后丝毫没有长大的又再度归来，并失去所有被带走时以及关于所处地方的一切记忆。与之相似，那些从妖精荒野中回来的冒险者们也时常发现他们在妖精位面中度过的时间不尽相同，而其旅行的记忆也显得模糊不清。您可以使用以下选用规则来反映弥漫在该位面中的奇异魔法。

记忆丧失 Memory Loss
离开妖精荒野的生物必须进行一次 DC10 的感知豁免。精类生物，以及任何拥有“精类血统 Fey Ancestry”特质的生物进行该豁免时直接判为成功。豁免失败的生物将失去所有在妖精荒野中所度过时光的相关记忆。豁免成功时，该生物保留其记忆但会有点模糊。任何可以解除诅咒的法术都可以恢复该生物所失去的记忆。

时间扭曲 Time Warp
时间在妖精荒野中正常的流逝，角色们能够意识到自己在其中待了一天，但离开该位面时，会发现多元宇宙的其他地方已经过去更多或更少的时间。
一个生物或一群生物在妖精荒野中度过至少 1 天时间后，你可以选择一个在战役看来比较合适的时间变化，或者按表格“妖精荒野时间扭曲”掷骰决定。法术祈愿术 wish 可以移除至多十个生物身上的这种效应。一些强大的精类拥有实现这种愿望的能力，他们或许会让自愿接受其指使术 geas 的人接受施法，或是对其施展祈愿术 wish 后让对方前去完成某个任务。

妖精荒野时间扭曲 Feywild Time Warp
d20 结果
1~2 日数变为分钟数
3~6 日数变为小时数
7~13 不改变
14~17 日数变为周数
18~19 日数变为月数
20 日数变为年数
"""

shadowfell_article = """
堕影冥界 Shadowfell
一座由幽影和黑石组成的堡垒，从锯齿状山峰的陡峭面上雕刻而成。瑞文 Riven在这座属于自己的城堡中央塔楼最上面的房间里站着。这个位面那无星的黑色穹顶扣着一片灰黑的景象，其间正是真实生活中各种事物的黑暗拟像。幽影、缚灵、幽灵、幽魂以及其他不死生物游荡在城堡四周的空中，或在附近的山麓和平原间徘徊。它们发光的眼睛看起来就像成群的萤火虫。它感受着自己眼前的一切黑暗，感觉那就是其自身的延伸，这种感觉甚至让他觉得自己有点庞大过头了。
——保罗·S·坎普，《神的诞生》
—Paul S. Kemp, The Godborn

堕影冥界 Shadowfell，亦称幽影位面 Plane of Shadow，是一个除黑白灰外的所有颜色都被从所有东西中抽走的次元空间。它是一个抗拒光的黑暗之地，其内的天际是一片漆黑的穹顶，既没有太阳也没有任何星光。
堕影冥界与物质位面的叠加方式与妖精荒野相同。除无色的景观外，它看起来与物质位面非常相似。物质位面的地标可以在堕影冥界中辨认出来，只是它们会被扭曲变形——即反映了物质位面存在物的扭曲映像。一座耸立于物质位面的山峰，在堕影冥界中相应的形态时一块锯齿状的岩石，其显露在外的部分如同一颗头骨，一堆碎石或一座曾经恢弘的城堡变成的破败废墟。堕影冥界的森林黑暗而扭曲，其枝条伸出来勾引旅行者的斗篷，根须盘旋卷绕所有路过之人。
幽影龙与不死生物出没在这个荒凉的位面里，也有一些其他的生物也会在者片幽暗中繁衍，其中就包括有蛰伏伪怪cloaker 和暗幕魔兽 darkmantle。

幽影通道 Shadow Crossings
幽影通道与妖精通道相似，是物质位面与堕影冥界之间边界薄弱之处，以至于一些生物可以从该穿越于两个位面之间。尘土飞扬的地穴角落里可能存在一条幽影通道，一处打开的陵墓也有可能。幽影通道是一片阴暗之地，此间徘徊着精魂与死亡的恶臭，比如战场、墓地和陵墓。他们只在黑暗中显现，当感觉到光明的接触时便会立即关闭。

可怖之域 Domains of Dread
从堕影冥界的偏远角落，很容易去到某个由受诅咒的邪恶存在所统治的骇人半位面。其中最著名的便是坐落于巴罗维亚山谷 valley of Barovia，由第一名吸血鬼斯托德·冯·泽洛维奇公爵 Count Strahd von Zarovich 所统领，布满尖顶塔楼的鸦阁堡 Castle Ravenloft。堕影冥界中一些称作黑暗原力 DarkPowers 的存在创作了这个领域用以囚禁一些“黑暗领主darklord”，同时也意外而残酷的困住了一些无辜的凡人。

选用规则：堕影绝望 Shadowfell Despair
抑郁的的气氛弥漫于整个堕影冥界中。在探索该位面时，角色将遵循该选用规则受绝望所影响。
在你觉得合适时（通常每日不超过一次），可以让一名非堕影冥界本土的角色进行一次 DC 10 的感知豁免。豁免失败者将受绝望影响。掷一次 d6 并参照表格“堕影绝望”确定其效应。此外，你还可以用自己原创的另一种绝望效应作代替。
如果角色在已受绝望影响的情况下再次豁免失败，则新的绝望效应将取代原来的效应。完成一次长休后，角色可以尝试进行一次 DC15 的感知豁免以克服绝望（由于克服已经生起的绝望更为困难，所以该 DC 其数值更高）。豁免成功则该角色身上的绝望效应随之终止。
法术安定心神 calm emotions，以及任何可以移除诅咒的法术或其他魔法效应都可以移除绝望。

堕影绝望 Shadowfell Despair
d6 效果
1~3 冷漠 Apathy。该角色进行死亡豁免，以及进行用于先攻检定的敏捷检定时具有劣势，且获得以下的缺点：“我不觉得自己可以对任何人或任何事造成影响。”
4~5 恐惧 Dread。该角色进行所有豁免检定时具有劣势，且获得了以下的缺点：“我开始觉得这个地方会让我送命。”
6 疯狂 Madness。该角色进行基于智力、感知和魅力的属性检定和豁免检定时具有劣势，并获得了以下的缺点:“我已经无法分辨什么才是真实。

永夜城 Evenight
在被遗忘国度的世界里，无冬城 Neverwinter 在堕影冥界中有一个黑暗的影子：永夜城 Evernight。永夜城是一座由碎石和腐木组成的城市。其道路大多有坟土铺成，几条卵石街道上也星星点点的缺失了好些石料。死灰的天空，和湿冷的微风让皮肤感到一阵冰寒。
城中的活体居民包括疯狂的死灵法师，堕落的人体供应商，邪神的崇拜者，以及其他够疯到胆敢在该处生活的人。不过在永夜城中，活者只很少一些，而绝大部分都是蹒跚的死者。僵尸zombie、尸妖 wight、吸血鬼 vampire 和其他不死生物将这个城市当成自己的家，并连同一切受管治于某阶层眼中：即智慧且噬食血肉的食尸鬼们 ghouls。
有谣言说这个污秽之地在每个世界中都有一处相应的镜像存在。
"""
inner_planes_article = """
内层位面 Inner Planes
他背靠那受炙烤的焖燃石头上躺下，抬望着远处烟雾缭绕的灰色天空和那不可见的燃火。环绕身边的，是一片间歇喷涌着蒸汽与火焰的熔岩之海。火焰的元素位面。
感谢那些倒下的人，乌浩克 Vhok 心想。我从没想过自己在这里会如此愉悦。
——托马斯·M·里德，《薄纱平原》
—Thomas M. Reid, The Gossamer Plain

诸内层位面环绕包覆着物质位面与其映射，为所有世界提供了制造万物的元素原材料。四个元素位面（火、水、土、气）在物质位面四周，悬浮于称作元素混沌 Elemental Chaos的混沌区间里。这些位面互相连接，在这些连接处有时也会因其自身的不同而被描述为完全不同的位面。
这些位面的最内侧边缘非常靠近物质位面（如果不是字面所述的地理意义上靠近，就是指概念上靠近），而四个元素位面也正是在此组合成物质位面的各个地区。四大元素如同在物质位面一样混合在一起，形成陆地、海洋和天空。但具有主导地位的元素在这里具有强烈的影响力，并使整体环境反映着这种基本属性。
栖息于这一环区内的住民包括有艾拉克拉 aarakocra、火矮人 azer、龙龟 dragon turtle、石像鬼 gargoyle、魔蝠 mephit、火蜥蜴 salamander 和索尔石怪 xorn。其中的某些起源于物质位面，且都可以旅行于物质位面中（前提是他们可以得到自己必须的魔法）并在该处生存。
在元素位面里，离物质位面越远，就变得越怪异和危险。在最外层的区域里，这些元素以最纯粹的形式存在：大块的硬土，炽热的火焰，晶莹之水和清澈之气。任何外来物质在此都极其罕见。土之位面最外层处只有很稀薄的空气，而火之位面最外层处完全不存在一点土质。这些地区并不如边境地区一样欢迎物质位面的旅客。这些地区鲜为人知，所以当人们谈论元素位面，比如火之位面时，他们指的也只是起边境地区。
最外层的区域大部分都是元素精魂的领域，而他们很少被认知为生物。那些被称作元素生物的生物栖息在这里，包括有邪恶元素亲王 the Elemental Princes of Evil（纯粹的原始愤怒汇成的原初存在），以及各种元素精魂。施法者们通常就是将这些精魂束缚成格莱石人 galeb duhr、魔像 golem、无形猎手 invisible stalker、火童 magmin 和水诡 water weird。这些元素生物在其家园位面时可以直接吸收位面里充斥的饱和元素能量，因此并不不需要食物或其他养分补给。

元素混沌 Elemental Chaos
诸元素位面最远区域里，纯粹的元素们互相熔融并压榨到一起，形成一片无休止互相碰撞的能量和物质，称为元素混沌 Elemental Chaos。这里偶尔也能发现元素生物，但它们更喜欢待在自己的原生位面而不会在此停留太久。有报告指出，在元素混沌中存在着奇怪的混合元素，而这种生物在其他位面中很少出现。

气之位面 Plane of Air
气之精髓便是运动、动态与激发。气是生命之息，是变化之风，是清新的抚动，以驱散无知的迷雾和陈旧思想。
气之位面是一片充满变换强风的开阔空间。这里四处漂浮着大块的土地——也即是那些土之位面的住民们入侵时遗留的残迹。这些土石成为了风元素生物的家园，而许多土石上还生长着茂盛的植被。另一些生物则生活在充满魔力并形成坚实表面的云层上，甚至在其上建起了城镇和城堡。
位面中四处积聚的浮云会遮蔽能见度。这里风暴频繁，时常还伴随着强雷暴，偶尔甚至还会出现猛烈的龙卷风或飓风。
这里的空气温和，只是靠近水之位面处会稍冷，而靠近火之位面处会显得灼热。该位面里，只有在最接近水之位面处才会出现降雨和降雪。
气之位面的大部分地区都处在某个气流、风流和一种称为迷宫风群 Labyrinth Winds 的系统中。其内有清劲的强风，也有足以撕裂生物的咆哮大风。即使是最熟练的飞行生物，在这里也要小心地驾驭这些气流，顺风而行而不是与之对抗。
在迷宫风群各处包含着一些隐藏的国度，这里只有跟随特定的风流才能到达，因而可以很好的抵御攻击。其中一处便是传说中的艾夸 Aaqa，一处拥有银色尖顶和苍翠花园的肥沃浮土。艾夸的风之公爵们 the Wind Dukes 倾向守序与善良，他们时刻警惕着，准备好对抗邪恶元素的掠夺和元素混沌的侵蚀。公爵们在领域内由艾拉卡拉 aarakocra 和一个鲜为人知的名叫瓦蒂 vaati 的种族侍奉左右。
气之位面离大爆炎 the Great Conflagration 最近的区域称作热风峡湾 Sirocco Straits。干燥的热风将这里附近浮土冲刷成贫瘠的岩石。石像鬼 Gargoyles 和他们的盟友从土之位面集结到这里，准备好对艾夸的领域发动发动劫掠。
在火之海 Sea of Fire（位于火之位面）和热风峡湾之间是一片高耸的火焰风暴区域。这里被称为大炎爆 the GreatConflagration，有时也称作灰烬位面 Plane of Ash。从气之位面呼啸而来的狂风混合了来自火之位面的熔岩与火灰，形成一条无边无际的风暴带——即是一堵火焰、烟雾和灰烬组成的城墙。浓厚的灰烬挡住视野使该处的能见度只剩几十尺，而肆虐的狂风也使在这里的旅行变得十分困难。扬起的灰烬在四处凝聚成一些浮游的区域，刚好让来这里的歹徒和逃亡者用作躲藏的庇护所。
该位面的另一端邻近落霜之地 Frostfell（水之位面边缘处的冰之位面），其附近是一处称作米斯特风区 Mistral Reach的寒风区域。大风将暴风雪推进落霜之地再将吹向远方，直冲该位面的核心区域。而在风区内的浮土也因此常年覆盖着冰雪。

土之位面 Plane of Earth
土地球象征了稳定、僵化、坚定决心，还有传统。该位面与气之位面在元素位面之环上处在对立的位置，也正好反应了它几乎就是气的完全对立面。
土之位面连串的山脉比物质位面的任何山脉都要高。它没有自己的太阳，高峰之上也没有空气环绕。其内的大多数旅者都是通过连通该处的洞穴或洞窟通路来到这里。
群山之下最大的洞窟被称为大闇洞 Great Dismal Delve，或七重迷宫 Sevenfold Mazework，其内正是土巨灵 dao 的都城，珠宝之城 City of Jewels。土巨灵因他们坐拥的财富大感自豪，并派出奴隶队伍穿越整个位面来帮他们寻找新的矿产和宝石的矿脉。多亏这种不懈努力，城中的每座建筑和每个重要物件都由珍贵的石料和金属制成，其中就包括那些镶嵌在建筑顶部，镶有宝石的细长尖顶。整座城市受了一个强大的法术保护，如果有游客哪怕偷走一小块石头都会触发通知所有土巨灵居民的警报。偷窃行为可能导致被判处死刑，而其惩罚还可能祸延到小偷的亲属。
邻近创造之泉 Fountains of Creation（位于火之位面）的山脉被称作火炉 Furnaces。熔岩从其中的洞窟里渗出，空气中还弥漫着硫磺的气味。土巨灵们在这里设置了优秀的锻炉和冶炼炉，用以加工他们的矿石和贵金属。
水和土位面之间的边界地区是个可怕的沼泽，这里的泥浆与软泥里生长着粗糙的扭曲树木和浓密的带刺藤蔓。在遗忘沼泽 Swamp of Oblivion（也被称为软泥位面 Plane of Ooze）各处，静滞的湖泊和池塘成了浓密的杂草和巨大蚊子群的温床。这里有少量用悬在淤泥上的木结构建立起来的定居地。他们大多会选择在树丛间搭建平台，有时也会直接在泥泞里打入深深的支柱。泥土里没有任何坚实地面可以用作支撑，所以这些建在支柱上的房屋最终都会沉入地下。
据说任何进入遗忘沼泽的物件至少在随后的一个世纪里都无法再现世间。有时会有一些绝望的灵魂将某个强力神器流放到这里，以让其暂时消失在多元宇宙中。而渴求强大魔法的冒险者们也会来这里搜寻这些宝藏，并勇敢的面对沼泽中的魔化昆虫和鬼婆。
该位面邻近遗忘沼泽的区域称作泥泞之丘 Mud Hills。在这里，山体滑坡不断地磨损着岩坡，将土石瀑布般倾泻到无底的沼泽中。而土之位面似乎总在不断生成新的土地，因而在旧土地逐渐消失时，新的山丘也在不断地升起。

火之位面 Plane of Fire
火代表活力、激情和变化。最坏的方面，它便是残忍，是肆意的破坏，就如同火巨灵 efreet 的日常所为。而最好的方面，火反映着灵感的光芒，同情的温暖，以及热情的火焰。
一轮炽热的太阳悬挂在金色的天顶，并在 24 小时的周期里不断的变换发热。它从中午的白热逐渐变成午夜的深红，因而位面中最暗淡的时刻便呈现出深红的暮光。而正午时分的光线几乎可以刺瞎眼睛。因此黄铜之城 City of Brass（见下文）的大多数生意都会安排在暗淡时间里进行。
该位面的典型天气尽是肆虐的狂风和浓厚的灰烬。这里的空气虽然可以呼吸，但那些非本土的生物都必须覆盖好自己的嘴眼，以避免吸入令人刺痛燃灰。火巨灵 efreet 用魔法让燃灰的风暴远离黄铜之城，而位面的其他地方则总是小至风暴大如飓风的恶劣环境。
火之位面的热浪与物质位面的沙漠热浪相当，且足以对旅行者构成相似的威胁（见第 5 章“冒险环境”中的“极端高温”）。越是深入位面深处，水源就越稀少。到达一定深度后，位面里便再也找不到任何水源，所以旅行者都必须携带好自己的补给，或是通过魔法来创造水。
大片的燃灰废土 Cinder Wastes 占据了火之位面的绝大部分，其内大量的黑色燃灰和余烬覆盖在熔岩之河上。游走的火蜥蜴战团们互相争斗，他们会突袭火矮人 azer 的前哨站，但会选择避开火巨灵 efreet。沙漠中还星星点点的点缀着一些远古遗迹——也即是一些被遗忘的文明残迹。
一大片火山山脉被称作造物之泉 Fountains of Creation，正是火矮人 azer 的家园。这些岩质的山峰从土之位面的边缘卷曲而成，围绕着燃灰废土一直延伸至位面炽热的核心地带。
在位面边缘处的一群山脉也称为岩浆位面 Plane of Magma。火巨人和红龙在这里安家，使这里一如相邻位面一样生机勃勃。熔岩穿过火山流向气之位面，并爆发为一大片熔岩之海，被称作火之海 Sea of Fire，而火巨灵 efreet 和火矮人 azers 则乘坐着大型的黄铜船航行其中。黑曜石与玄武岩形成的岛屿从海中冒出，点缀上一些远古遗迹和强大红龙的巢穴。火之海的岸边便矗立着黄铜之城 City of Brass。

黄铜之城 The City of Brass
诸内层位面里最闻名的地点也许就是位于火之海岸边的黄铜之城。这座传说中的火巨灵城市，其华丽的尖顶和金属城墙正好反映了他们华丽而残酷的本性。恰如火之位面的本质，城中所有的一切都如同活着的舞动之焰，同时也反映了该地充满能量与活力。
冒险者们时常来这里寻求传奇的魔法。加入所寻找的魔法物品可以通过购买来获取，那黄铜之城便是最可能找到这些物品的地方，尽管其代价可能不仅仅是黄金。火巨灵偏爱在自身具有优势时进行交易，尤其喜欢自己在谈判中处于上风的时刻。也许会有某种魔法疾病或毒药只有在城里的集市上卖的东西才能治愈。
这座城市的中心是高耸的木炭宫 Charcoal Palace，其内火巨灵暴虐的苏丹坐拥至高无上的地位，身边簇拥着诸多火巨灵贵族、奴隶主、守卫和一众阿谀奉承者。

水之位面 Plane of Water
水的本质是流淌，与躁动之风或跃动之焰不同，是轻柔而稳定的流动。它是潮水的节奏，是生命的甘露，是哀痛的眼泪，还是同情与疗愈的慰藉。而假以时日后它也能侵蚀掉其途径的所有一切。
一轮温暖的太阳在水面的空中划出一道弧线，似乎正是从地平线的可见边缘的水中升起落下。在这里，每天总有那么几次不期而至的乌云密布，紧接着便是一场暴雨，通常还伴随着壮观的电闪雷鸣之景，然后又再一次晴空万里。这里的夜色是一片闪亮的繁星，以及在空中闪耀的极光景色。
水之位面是无边无际的海洋，被称作世界之海 Sea ofWorlds，那些似乎从无尽深海中成长起来的珊瑚礁形成各种珊瑚岛和岛屿，零星的四散在位面之中。在海洋中移动的风暴有时会形成连同物质位面的临时传送门，并将船只拉进水之位面中。来自各个世界数不清的幸存船只航行于这片水域中，几乎没有任何回家的可能。
位面中的天气状况是极端的教训。如果不是一片风平浪静，便是肆虐着狂风暴雨。极罕见的情况下，还会出现一股震动并引发一股横扫位面的巨浪淹没掉整个岛屿，并将船只推到礁石之上。
由于阳光照耀到海水之中，世界之海的上层生命欣欣向荣，该区域也因此被称为光之海 Sea of Light。水生类人生物在珊瑚礁中建起了城堡和堡垒。该区域中一直以来的管理者水巨灵 marid 向来乐于让一些低等种族为领土而争斗。水巨灵名义上的皇帝所居住的宫殿是一座由珊瑚制成，镶嵌着珍珠的豪华建筑，这座宫殿便是万颗珍珠堡垒 Citadel of TenThousand Pearls。
位面深处阳光无法抵达之地被称为黑暗深渊 DarkenedDepths。一些可怕生物在此栖息，而这里绝对的寒冷和毁灭性的水压足以让一切只适应地表或光之海的生物迅速了结性命。而克拉肯 Kraken 和其他的庞大生命体则霸占着这一领域。
任何在海面上升起的陆地都是该位面中的少数呼吸生物激烈争夺的资源。当没有其他地面可用时，人们就会把浮筏和船舰被绑在一起充当立足地。大多数该位面的原住民通常都不会冲上海面，因此他们也不会理会别人的这种习性。
位面上为数不多的几个岛屿中有一个被称作恐惧之岛Isle of Dread。该岛屿会定期由一场横扫该岛的风暴连接到物质位面。掌握了该位面奇异潮汐和水流的旅行者能够以此自由穿梭于两个世界之间，但这股风暴也会将物质位面的船只摔毁在岛屿海岸边。
水之位面邻近遗忘沼泽（位于土之位面）的区域称作淤沙浅滩 Silt Flats。这里的水中充满了沙土和淤泥，并混和成两个位面之间大沼泽前的一片泥泞的地带。
位面的另一端接壤落霜之地处便是冰之海 Sea of lce。寒冷的海水被冰山和冰盖堵塞在此，而这种环境吸引了一众生活在落霜之地的喜冷生物栖息其中。而这些生物还会随着浮游飘离的冰山进入水之位面，进而在温暖的海域里威胁船只和岛屿。
落霜之地 Frostfell 也即是冰之位面 Plane of Ice，形成于气与水之位面的接壤处，是一片被持续不断的暴风雪所席卷，近乎无穷无尽的冰川地带。冰之位面里蜿蜒的冰冻洞窟栖息着雪人 yeti、百足魔兽 remorhaze、白龙和其他寒冷生物。位面中的住民时刻进行着一场永无休止的斗争，以证明自己的实力，并确保自身得以生存。
由于危险怪物和冷酷严寒的存在，在落霜之地旅行相当危险。大多位面旅者在这里都会保持安静，直面寒风和大雪，并尽量避免踏上这片巨大的冰川地中。
"""
outer_planes_article = """
外层位面 Outer Planes
带毒气体的集团如同污秽的云层一样飞速略过深红色的穹丘。它们旋转汇聚成型如同巨眼一般俯视下来，却又在凝聚视线前便消散，仿佛单纯只为一次次的重新能聚成型。在红宝石光芒之下正是一片黑暗的噩梦之地，那是一片光秃的岩石，是四处绽放的火花和闪烁的焰火，而一切都在这若隐若现的幽影中匍匐滑行。而连绵的山脉却划破了红宝石的天空。阿祖斯 Azuth曾非常恰当的将其称为齿之大陆 Land of Teeth，并在此间测绘出无数的齿状的岩石。这里曾是迎宾之地 Greeting Ground，是曾经夺去了无数凡人性命的恐怖国度。而他当时正身处九层地狱的最上层，盘旋在阿佛纳斯 Avernus的上空之中。
——艾德·格林伍德，《地狱中的艾尔明斯特》
—Ed Greenwood, Elminster in Hell

如果内层位面时构成多元宇宙的原材料和能量，那么外层位面则为其构造提供了方向、思想和目的。有鉴于此，加上外层位面众所周知的被认知为神祇的家园，从而导致许多智者将其称作神圣位面、精神位面或神灵位面。
讨论关于神祇的事情时，都会用上具有高度隐喻性的语言。事实上他们的家园并不是真正的地点，而是例证了外层位面是思想和精神的国度。与元素位面类似，你可以把外层位面的可感知部分想象成边缘区域，而广阔的精神区域则超出一般的感官体验。
即使在可感知地区内，表象也可能具有欺骗性。一开始，许多外层位面表面上感觉相当友好，且与物质位面本身非常相似。但在这些位面上的强大力量可以因一时兴起而改变其景观，甚至可以将其完全改变，乃至有效地清除和重建其存在以更好地满足其神圣的需求。
距离在外层位面中是一项毫无意义的概念。这些位面的可感知区域似乎非常小，却也可以延伸至无限远。冒险者们可以用一天时间被引领者游遍九层地狱的九个层级——当然前提是这必须同时是地狱之力自身的想法。又或者，旅者可能会需要几周的时间才能在一层中艰难前进。
默认的诸外层位面为一组十六个位面，对应着八大阵营（不包括由外域代表的中立阵营，描述详见“其他位面”一节），同时也反映了各位面之间的区别。
那些具有本质里包含善良元素的位面称作上层位面Upper Plane，而包含邪恶元素的位面则称作下层位面 LowerPlane。位面的阵营是其精髓，而一个与位面阵营不匹配的角色在其内会有一种不协调的感觉。例如，当一个善良生物造访极乐境 Elysium 时可以感觉到与位面相互同调，而一个邪恶生物则无法与之同调，甚至会感觉不适。
上层位面是天界生物的家园，包括天使 angel、羽蛇 couatl和飞马 pegasus。在下层位面安家的则是邪魔一类：恶魔demon、魔鬼 devil、尤格罗斯魔 yugoloth 等。处于两者之间的位面里还有着一些独特的住民：机械境中的构装生物种族魔冢 modron，以及在混沌海 Limbo 繁衍的异怪生物史拉蟾族 slaadi。

外层位面 Outer Planes
外层位面    阵营
天界山 Mount Celestia 的七层天堂    LG
双生天堂 Bytopia 的孪生伊甸    LG,NG
极乐境 Elysium 的祝福之地    NG
万兽园 The Beastlands 的无尽荒野    NG,CG
奔放之野 Arborea 的奥林匹亚林地    CG
约瑟园 Ysgard 的英雄领域    CG,CN
混沌海 Limbo 的永恒混乱    CN
喧癫空隧 Pandemonium 的风啸深渊    CN,CE
无底深渊 the Abyss 的无限层级    CE
卡瑟利 Carceri 的流放深渊    CE,NE
哈迪斯 Hades 的灰色荒野    NE
焦炎地狱 Gehenna 的永恒旷野    NE,LE
九层地狱 the Nine Hells（巴托 Baator）    LE
修罗场 Acheron 的地狱战场    LE,LN
机械境 Mechanus 的钟表涅槃    LN
世外桃源 Arcadia 的和平国度    LN,LG

外层位面层级 Layers of the Outer Planes
大多数外层位面包括着许多不同的环境或领域。这些领域经常被描绘或描述为同一位面中一堆叠起来相互关联的部分，而旅行者们将其称为层级 layer。例如，天界山 MountCelestia 就是由七层的饼状层级堆叠而成，九层地狱 NineHells 有九个层级，而无底深渊 Abyss 似乎有无数的层级。
从别处连接过来的传送门通常只会到达多层位面的第一层级。根据位面不同，这一层可能会被描述为顶层或底层。而第一层通常会作为该位面的城门，成为大多数旅者初次抵达的地点。

外层位面游历 Traveling the Outer Planes
在外层位面之间旅行与到达初次抵达外层位面一样。通过法术星界投影 astral projection 的方式旅行的角色可以从某一位面进入星界位面，并在其中寻找特定颜色的彩池，并以此前往目的地。角色们也可以使用法术异界传送 plane shift 更直接地到达不同的位面。然而，大多数情况下，角色们都会使用传送门——这些传送门要么直接连接两个位面，要么就是通向有着通往所有位面传送门的城市，众门之城，印记城 Sigil。
一些外层位面会由两个共同的位面特性相连：冥河 RiverStyx 和无尽阶梯 Infinite Staircase。你可以在自己的战役中设定其他的位面通道，比如，一棵扎根下层位面，树冠连接上层位面的世界树 World Tree。或者，你也可以将宇宙观设定为可以徒步从一个位面走到另一个位面。

选用规则 Optional Rules
每个外层位面都有其独特的特点，也使旅行其中成为一种独特的体验。位面的影响可以通过多种方式作用于旅者，比如让他们染上与该位面相关的个人特点或缺点，甚至可以改变其阵营使之更符合位面的本土居民。每个位面的描述里都包含有一个或多个选用规则，你可以借此让冒险者们在该位面获得更加难忘的体验。

冥河 The River Styx
这条河上漂着冒泡的油迹和污秽的船只残骸，河岸边躺着从战场漂来的腐臭尸体。除邪魔之外的任何生物品尝或接触到这里的水质时都会受到法术弱智术 feeblemind 的影响。而抵抗该效应的智力豁免 DC 为 15。
冥河斯提克斯 Styx，翻腾的流过修罗场 Acheron 最上层，九层地狱 Nine Hells，焦炎地狱 Gehenna，哈迪斯 Hades，卡瑟利 Carceri，无底深渊 Abyss 和喧癫空隧 Pandemonium。而冥河的支流则蜿蜒于在这些位面的其他层级。例如，冥河的一部分缠绕着九层地狱的每一个层级，让人得以借此渡往其中的每一层。
罪者的渡船在冥河的水域漂流，渡船的领航人以熟练的技巧判断难以预测的水流和河流漩涡。只要出的起价钱，这些领航人愿意载着乘客穿梭于各位面。他们中有一些是邪魔，而另一些则是物质位面死者的灵魂。

无尽阶梯 The Infinite Staircase
无尽楼梯是连接诸位面的一个外维度螺旋阶梯。通往无尽阶梯的入口通常是一扇不起眼的门。入口的另一边是一个小型平台，连接着一串连同上下却平平无奇的阶梯。在爬上或走下的过程中，你会发现阶梯会随之逐渐改变，从简单的木阶或石阶，到辐射在空中悬挂的杂乱阶梯，甚至每一阶都有着不同的重力方向。传说当人在无尽阶梯的各层搜索时，终会从中找到自己内心的真正欲求。
无尽阶梯中的门常常隐藏在布满灰层且近乎被遗忘的无人问津之地。任一个给定的位面中，都可以有多扇门扉连接到无尽阶梯中，而这些入口通常都鲜为人知，且偶尔会由梵天神侍 deva、翔狮兽 sphinxe、尤格罗斯魔 yugoloth 和其他强大的怪物守卫着。

选用规则：心灵失调 Psychic Dissonance
每个外层位面都散发着一种心灵失调感，并影响每个与其阵营不相容的访客（善良生物在下层位面，或邪恶生物在上层位面时），前提是他们必须在该位面中待得时间够长。你可以选用该规则来反映这种失调感。在一个阵营不相容的位面完成一次长休后，该旅者必须进行一次 DC10 的体质豁免。豁免失败者将提升一个等级的力竭状态。守序与混乱阵营间的不相容不会产生这种效应，因而机械境 Mechanus 和混沌海Limbo 也不会出现这种特征。

天界山 Mount Celestia
天界山 Mount Celestia（或译作天堂山）是从善良的银海Silver Sea 上升起的一座高度无法目测也难以想象的神圣山峰，其七层高原也即是它的七个层级。该位面是正义与秩序的典范，是上天的恩典和无尽的仁慈。在那里，天使和斗士们都是拥护善良抵御邪恶入侵的护卫者。这里是少数几个可以让旅客放下戒备的位面之一。它的居民不断努力令自己变得更加正直。无数生物都想到达山峰最高阶最卓越之处，但只有最纯洁的灵魂才可前外。当凝视着这个山峰时，即使是最疲惫的旅者也会充满敬畏。

选用规则：祝福恩泽 Blessed Beneficence
与邪恶生物在这里所体验到的不谐相反，善良生物在这此会受惠于位面中弥漫的祝福恩泽。善良阵营的生物只要在该位面中就能获得法术祝福术 bless 的效应。此外，善良生物在该位面完成一次长休后可以获得一个次级复原术 lesserrestoration 的法术效应。

双生天堂 Bytopia
双生天堂 Bytopia（或译作双乐园、勤睦叠境）中两个层级的孪生天堂 Twin Paradises 非常相似却又截然相反：一个是温顺的田园风光，另一个是未被驯服的荒野，而这两者都反映了该位面的善良和必要时的守法与秩序。双生天堂是高效工作的天堂，是完好的完成工作的满足感所在。贯穿整个位面的善意给居住其内的生物带来友善与幸福的感觉。

选用规则：弥漫善意 Pervasive Goodwill
非守序善良非中立善良的旅行者在该位面中完成一次长休后，必须进行一次 DC10 的感知豁免。豁免失败者其阵营将会变为守序善良或中立善良（选择更靠近该生物原阵营的一项）。如果该生物不在 1d4 日内离开该位面，则这种变化将变为永久效果。在此前如果该生物在双生天堂之外的位面停留一日，则其阵营将恢复原样。对该生物施展法术反制善恶dispel evil and good 也可以使其恢复原阵营。

极乐境 Elysium
极乐境 Elysium 是无限仁慈的怜悯者之家，也是欢迎位面旅者前来寻求庇护的避难所。该位面的田园风光在大多数时候都闪耀着生命与美丽之光。人们在进入该位面时便被其安宁渗入骨髓与灵魂。这是个可以让人安心歇息的天堂，是快乐的眼泪在人们脸颊上闪亮的地方。

选用规则：莫大极乐 Overwhelming Joy
旅行者在该位面上停留一段时间便有可能被这里压倒性的满足与幸福感所困。旅行者每在该位面完成一次长休后，都必须进行一次 DC10 的感知豁免。豁免失败者在完成下一次长休前都将不愿离开该位面。三次豁免失败后，该生物便永远不愿离开该位面。如果强行将其带走，他便会尽一切努力回到该位面。法术反制善恶 dispel evil and good 可以移除生物身上的该效应。

万兽园 The Beastlands
万兽园 Beastlands（或译兽乡）是个未开化的自然位面。
从苔藓丛生的红树林到布满积雪的松林。在茂密的丛林中，树枝是紧密地交织在一起，直至遮蔽所有穿透的光线；在广袤的平原上，谷物和野花在风中充满着勃勃生机。该位面体现了大自然的野性和美丽，而它同时还代表了所有的动物。

选用规则：猎手天堂 Hunter’s Paradise
来到万兽园的旅行者发现自己狩猎和追踪能力得到了提高，角色在这里进行感知（驯兽）、感知（察觉）和感知（求生）检定时具有优势。

选用规则：野兽变形 Beast Transformation
旅行者在该位面杀死一头野兽时，该杀戮者必须进行一次 DC10 的魅力豁免，豁免失败者将变身为被杀的野兽（如同法术变形术 polymorph）。处于该形态时，该生物保留着其原来的智力值和说话能力。每次完成长休后，被变形的生物都可以再进行一次该豁免。豁免成功则该生物恢复其真实形态。三次豁免失败者只能通过法术移除诅咒 remove curse 或类似魔法才可逆转该效应。

奔放之野 Arborea
奔放之野 Arborea 是暴力情绪和强烈感情之地，这种情感在这里甚至高于生命，人们由顽固的冲动和炽热的激情支撑着，直自己燃烧殆尽。这些本性善良的居民致力于对抗邪恶，但他们的鲁莽情绪有时会带来毁灭性的后果。在奔放之野，狂暴如同愉悦一样常见。这里的山脉与森林都极之广阔而美丽，每一处沼泽和溪流都居住着不可侵犯的大自然的精魂。因而旅行者在此必须小心行事。
奔放之野是许多精灵和精灵神祇的家园。出生在该位面的精灵属于天界生物类型并且内心狂野不驯，随时准备好与邪恶开战。除此之外，他们看起来就像普通精灵一样。

选用规则：热切渴望 Intense Yearning
记录一个旅行者在奔放之野停留多少了日。该旅行者离开时必须进行一次魅力豁免，其豁免 DC 等于 5 加上其停留日数值。豁免失败者，将受回归奔放之野的欲望所折磨。只要该效应存在，该生物进行属性检查时便具有劣势。每次完成长休后，该生物都可以再次进行该豁免，豁免成功则终止该效应。
法术反制善恶 dispel evil and good 可以移除生物身上的该效应。

约瑟园 Ysgard
约瑟园 Ysgard 的领域中是一片崎岖的山脉与深谷，还有大风吹过的战场。其内的夏天漫长而炎热，冬天则寒冷而无情。
它的大陆漂浮在火山岩石的海洋之上，其下的冰窟巨大到足以容纳所有的巨人 giant、人类 human、矮人 dwarfe、侏儒gnome 和其他存在。英雄们前来约瑟园测试自己的勇气，他们不仅需要面对位面本身，还要对抗巨人、龙类，以及其他在约瑟园广阔大地中雷厉风行的可怕生物。

选用规则：不朽盛怒 Immortal Wrath
约瑟园是被杀的英雄的家园，他们在这荣耀的战场上进行永恒的战斗。除构装生物和不死生物之外，任何生物被攻击或法术杀死后将在第二天黎明时恢复生命。该生物恢复所有生命值，并移除所有死亡前的所受的状态和苦痛。

混沌海 Limbo
混沌海 Limbo（或译灵薄狱、迷失域）一个纯粹混沌的位面，是一锅不稳物质和能量的搅动汤。石头融化成水再冻结成金属，随后变成钻石，而又烧成烟再变成雪，如此循环无穷无尽的经历着不可预知的变化。更普通的景观——小树林、草地、城堡遗迹，乃至涓涓细流，一切一切都处在无序之中。整个位面便是一场噩梦般的暴乱。
混沌海没有重力，因此该位面上的生物都悬浮在原地。但生物可以通过想象自己前进的方向便可以向任意方向以其不行速度移动。
混沌海会去适应其内居住者的意愿。自律而强大的意志可以在位面中制作出整个自创的岛屿，甚至可以在这种地方生活数年。而意识简单的生物比如一条鱼，则可能熬不过一分钟便会随自己周围的水结冰、消失或是变成玻璃。史拉蟾族Slaadi 在这里生活，它们在这片混沌中畅游而不创造任何东西，而吉斯泽莱 githzerai 的武僧则用自己的意志建起了整座修道院。

选用规则：意志之力 Power of the Mind
作为一个动作，一个处于混沌海的生物可以进行一次智力检定，以尝试用念力移动身边 30 尺内一个他能看见且属于该位面的物件。其 DC 依物件的体型尺寸而定：微型为 DC 5，小型为 DC 10，中型为 DC 15，大型为 DC 20，巨型或更大体型则为 DC 25。检定成功则该生物将该物件移动的尺数等于 5加上该检定值多出 DC 的数值。
生物也可以花费一个动作来进行一次智力检定以改变一个未被着装或携带的非魔法物件。其规则与移动距离是相同，而其 DC 则基于该物件的体型尺寸：微型为 DC10，小型为DC15，中型为 DC20，大型或更大体型则为 DC25。检定成功时，该生物便将物件转变成另一种同体型大小的非活体物件，例如将一块巨石变成一个火球。
最后，生物可以花一个动作来进行一次智力检定以稳定该生物为中心的球状区域。其 DC 依球区的半径而定。基础 DC为 5 对应一个半径 10 尺的球区；该半径没增加 10 尺相应的DC 就增加 5。检定成功时，该生物将避免该区域在随后的 24小时被该位面所改变，或者直到该生物再次使用该能力为止。

喧癫空隧 Pandemonium
喧癫空隧 Pandemonium（或译群魔殿）是一个疯狂的位面，是大堆岩石被狂风雕刻而成的隧道。它冰冷，嘈杂，黑暗，且没有一点自然光。这里的风会迅速熄灭所有像火把和篝火那样的非魔法明焰。这种环境中也只能大声喊叫才能完成对话，而就算如此可以听清的距离至多只有 10 尺远。生物进行任何依赖听觉的属性检定都具有劣势。
位面中的大部分栖息者都是被放逐到该位面的生物。他们没有任何逃生的希望，当中许多人被不间断的风吹得发疯，或被迫在可以避风的地方躲避，直至最后只剩下他们彷如从遥远处传来的痛苦呼喊。

选用规则：疯狂之风 Mad Winds
旅行者每在狂风中度过一小时就必须进行一次 DC10 的感知豁免。豁免失败时，该生物将提升一级力竭状态。在该位面中达到六级力竭的生物不会死亡。相反，该生物将获得了一种随机的永久性疯狂，正如第 8 章所“运作游戏”所述。完成一次长休并不能降低该生物的力竭等级，除非他能以某种方式逃离令人发狂的大风。”无底深渊 The Abyss无底深渊 Abyss 具现了一切的悖逆、恐怖和混乱。它几乎无尽的层级螺旋向下，形成一片愈加可怕的形态。
深渊的每一层级都有各不相同的可怕环境。虽然没有哪两层长的一样，但却都是一样的严酷而不适宜居住。每一层都反映了深渊的混乱本质。事实上，人们在位面中看到或接触到的大部分东西，似乎都处在腐朽、破碎或堕落的状态中。

选用规则：深渊堕落 Abyssal Corruption
非邪恶的旅行者在无底深渊完成一次长休后，必须进行一次 DC10 的魅力豁免。豁免失败时，该生物将陷入堕落。参照表格“深渊堕落”来决定其堕落效应。你也可以用自己原创的不同堕落效应用作替代。
完成一次长休后，已经堕落的生物可以进行一次 DC15 的魅力豁免。豁免成功则该堕落效应终止。法术反制善恶 dispelevil and good 或任何可以一处诅咒的魔法都可以终止该效应。
如果堕落生物在 1d4+2 日内还没离开该位面，他的阵营将变为混乱邪恶。对该生物施展法术反制善恶 dispel evil andgood 可以使其恢复原阵营。

深渊堕落 Abyssal Corruption
d10 结果
1~4 背信弃义 Treachery。该角色获得以下的缺点：“我只能通过确保我的同伴无法达成其目标来实现自己的目标。”
5~7 嗜⾎ Bloodlust。该角色获得以下的缺点：“我单纯的喜欢杀戮，而且我一开始就停不下来。”
8~9 疯狂的野⼼ Mad Ambition。该角色获得以下的缺点：“我注定要统治无底深渊，而我的同伴们就是为此存在的工具。”
10 恶魔附体 Demonic Possession。该角色被一个恶魔实体所控制，直到被反制善恶 dispel evil and good 或类似的魔法解救。当被附身的角色进行攻击检定、属性检定或豁免检定，并得到骰值为 1 时，该恶魔将控制该角色并决定其行为。在每个角色自身的回合结束后，该角色可以进行一次 DC15 的魅力豁免。豁免成功则角色重新获得自身的控制权，直至下一次再掷出骰值 1。

重要层级 Important Layers
无底深渊的层级由统治该地的恶魔领主所定义，正如下述范例所指。关于恶魔领主的更多信息可以参阅《怪物图鉴》。
恶魔胃囊 The Gaping Maw。 无底深渊中狄摩高根 Demogorgon 的层级是一个野蛮而疯狂的巨大荒野，称作恶魔胃囊。即使是强大的恶魔也会在此因恐惧而疯狂。反映着狄摩高根双重性格的恶魔胃囊是一块巨大的原始大陆，覆盖在茂密的丛林中，周围则是无边无际的海洋和盐水。恶魔主君Prince of Demons 在两座从浑浊的海面上浮现的蜿蜒石塔里统治着他的层级。每座塔的顶部装饰着一个巨大的尖牙颅骨。塔尖构筑成亚比森 Abysm 的堡垒，很少有生物能冒险进入其内而不陷入疯狂。
塔纳托斯 Thanatos。如果奥喀斯Orcus找到办法，他就会将所有位面都变得跟他的死之王国一样，所有生物都将在他的控制下成为不死生物。塔纳托斯的黑色天空下是一片荒凉的山地，贫瘠的荒野，被毁的城市，以及扭曲的黑树的森林。陵墓、坟场、墓碑和石棺充斥在景色之中。不死生物从陵墓和坟地中爬出，撕裂任何敢来这里的愚蠢生物。奥喀斯对塔纳托斯的统治来自一座由黑曜石和骸骨建成，被称为永丧之城Everlost 的巨大宫殿。宫殿建立在一个被称为遗忘之末Oblivion’s End 的荒原上，周围都是挖在狭窄山谷和陡峭山坡上的陵墓与坟地，形成一片层叠的大墓冢。
蜘蛛魔网 The Demonweb。罗丝 Lolth 的层级是个魔法蛛网织成的巨大网络，并以此形成各种通道和茧状腔室。在这些蛛网中，建筑、构造物、船只和其他物件有如被困在蛛网陷阱中一样被倒吊着。罗丝蛛网的本质使其在整个位面中随机的创造出各种传送门，并从各种半位面和物质位面的世界中抓来各种物件，以满足蜘蛛女王 Spider Queen 的阴谋。罗丝的仆从们也使用织网建起地下城，并以蛛网建成纵横交错的通道再以此捕捉吊起罗丝所痛恨的敌人。在这些地下城下方，隐藏着蜘蛛女王的住所，无底的魔网深狱 Demonweb Pits。栖息在此的罗丝身边簇拥着她的女仆们——即是为服侍她而创造的恶魔蜡融妖 yocholo，而在着蜘蛛女王的领域中，这些恶魔们保有至高的身份，同时也是至强的恶魔。
无尽迷宫 The Endless Maze。巴菲门特 Baphomet 在无底深渊的层级是一个无边无际的地牢，其中心位置便是魔角之王 Horned King 巨大的金字塔宫殿。在令人困惑而杂乱的走廊和无数房间之中，环绕着一里宽的宫殿护城河，水中还隐藏一系列令人发狂的楼梯和隧道，直通城堡深处。
三重境界 The Triple Realm。乌黯主君 Dark Prince 格拉茲特 Graz’zt 统治着包含三个无底深渊层级的阿茲格拉特Azzagrat 领域。他的权力宝座是位于泽拉塔 Zelatar 城中奇异的银宫 Argent Palace，其繁华的市集和欢乐的宫殿吸引着来自多元宇宙各处的众多旅行者，前来寻找模糊的魔法传说和放纵的欢愉。在格拉兹特的命令下，阿兹格拉特的恶魔们装得十分文明有礼。然而，所谓的三重境界与无底深渊其他任何区域一样危险。其森林中的树木甚至长着巨蛇般的枝条，而旅行者随时可能在迷宫般的城市中消失得无影无踪。
死亡山谷 Death Dells。耶诺古 Yeenoghu 统治者一个称作死亡山谷 Death Dells 的峡谷。这里的生物必须捕猎才能生存。就连植物也要诱捕猎物以在血泊中扎根。耶诺古的仆从们必须为其主人满足饥渴，主人于自己王国中狩猎时，他们便从物质位面搜捕猎物，再释放到这个狗豺狼人领主的领域之中。

卡瑟利 Carceri
卡瑟利 Carceri 是所有监狱的典范，是一个荒凉绝望的位面。它六个层级中有巨大沼泽，恶臭丛林，风沙肆虐的沙漠，锯齿山脉，寒冷大洋和漆黑的冰层。这一切组成的这个监狱位面，就是被锁困在此的叛徒和背叛者悲惨的家园。

选用规则：监狱位面 Prison Plane
没有人能轻易地离开卡瑟利。除法术许愿术 wish 之外，所有尝试离开该位面的魔法效果都会失效。通向该位面的传送门和门扉都只能实现单向传送。确实存在离开该位面的秘密方法，只是它们都被绝密的隐藏起来，并由致命的陷阱和怪物看守着。

哈迪斯 Hades
哈迪斯 Hades 的层级被称为三郁 Three Glooms——即失去欢乐、失去希望、失去激情。哈迪斯是灰烬的天空下一片灰色的大地，许多不被上层位面的神灵接纳，也不又下层位面的邪魔统治者接管的灵魂均以此作为其目的地。这些灵魂在这里变为幼虫 larva 永远困在这个没有太阳、月亮、星星和季节的地方度日。过滤掉所有颜色和情绪后，剩下的抑郁令大多数的旅行者难以忍受。前文所述的“堕影绝望”也可以用来表述旅行者在此的绝望。

选用规则：丑恶变形 Vile Transformation
旅行者每次在该位面完成一次长休时，必须进行一次DC10 的感知豁免。豁免失败时，该生物将提升一级力竭状态，只要该生物依然在哈迪斯中，这些力竭状态就无法被移除。该生物力竭等级达到六级时并不会死亡。相反，该生物会永远变成一个幼虫，而折磨该生物的所有力竭等级也会随之移除。
幼虫是一种低端的邪魔，它保留了先前形态的面部特征，却长着肥胖蠕虫的身体。幼虫对从前的生活保有一点模糊的记忆，而其生物数据变为幼虫的数据板所述。
哈迪斯中爬满幼虫。夜鬼婆 Night hag、巫妖 lich、和邪兽鬼 rakashasa 则会收割它们用于自己的邪恶仪式。其他的邪魔则会以它们为食。

幼虫 Larva
中型邪魔，中立邪恶
AC：9
HP：9（2d8）
速度：20 尺
力量 9（-1） 敏捷 9（-1） 体质 10（+0） 智力 6（-2） 感知 10（+0） 魅力 2（-4）
感官：被动察觉 10
语言：可以理解自己生前所掌握的语言但不能说
挑战等级：0（10 XP）
动作
啃咬 Bite。近战武器攻击：+1 命中，触及 5 尺，单一目标。伤害：1（1d4-1）的穿刺伤害。

焦炎地狱 Gehenna
焦炎地狱 Gehenna（或译炼狱）是猜疑和贪婪的位面。它是尤格罗斯魔 yugoloth 的出生地，而该种族也大量居住于此。焦炎地狱四个层级中的每一层都有一座火山，低层的火山灰土喷发到控制并砸入高层的山中。位面的岩坡令人在此运动时非常困难和危险。几乎任何地方的地面都至少有 45 度的倾斜。有些地方的陡峭悬崖和深谷更是构成了极具挑战的障碍。此间的危害物还包括会释出有毒气体和灼热火焰的火山裂缝。焦炎地狱没有仁慈和同情的空间。生活在这里的邪魔是所有多元宇宙中最贪婪最自私的存在。

选用规则：残酷累赘 Cruel Hindrance
该位面的残酷本质使这里的旅行者难以实现互相帮助。旅者被施予增益效应的法术（包括恢复生命值或移除某状态）时，其施法者必须先进行一次 DC10 的魅力豁免。豁免失败则施法失败，相应的法术位被消耗，相应动作也被花费掉。

九层地狱 The Nine Hells
九层地狱 Nine Hells 的巴托 Baator 会引燃旅行者的想象力，寻宝者的贪婪，以及所有道德生物的战斗之怒。它是究极的守序与邪恶之位面，也是预谋之残虐的缩影。九层地狱的魔鬼必定遵守其上级的律法，但他们却在各自的城堡里作反。大多数人都在进行某些阴谋，并不择手段的提升自己。位于阶级制度最顶端便是还未被击败的阿斯蒙蒂斯 Asmodeus。而他一旦被击败，则新的胜利者将继续统治这个位面。这就是九层地狱的法则。

选用规则：弥漫的邪恶 Pervasive Evil
邪恶弥漫于九层地狱中，连旅行者们也受其影响。非邪恶的旅行者在该位面中完成一次长休后，必须进一次 DC10 的感知豁免。豁免失败时，该生物的阵营将变为守序邪恶。如果该生物无法在 1d4 日内离开该位面，则这种变化将成为永久性。在此之前，如果该生物可以在九层地狱之外的位面中停留一天，则该生物的正义将恢复正常。对该生物施展法术反制善恶 dispel evil and good 也可以将其阵营复原。

九个层级 The Nine Layers
九层地狱有九个层级。前八层均分别由大魔鬼们统治，并直接隶属于阿斯蒙蒂斯，也即是第九层级奈瑟斯 Nessus 的大公 Archduke。要到达九层地狱的最深层级，就必须依次穿过上面的所有八层。最快捷的方式就是借助冥河的摆渡，一层一层的往下深入。也只有最勇敢的冒险者才能经受住这趟旅程的痛苦与恐惧。

阿佛纳斯 Avernus。在阿斯蒙蒂斯的规定下，所有位面传送门都无法直接连接九层地狱的更低层级。因此，第一层的阿佛纳斯便是前来该位面的旅者的登录点。阿佛纳斯是一个布满血河与咬人苍蝇的岩石荒原。炽热的彗星偶尔会从黑暗的天空中坠落，留下冒烟的撞击坑。空旷的战场上到处都是武器和骸骨，彰显着九狱的军团在本土上与敌人相会并获胜。
女大公扎瑞尔 Zariel 统治着阿佛纳斯，她的对手贝尔 Bel由于让阿斯蒙蒂斯失望而被拉下台，并被迫出任扎瑞尔的顾问。恶龙女王 Queen of Evil Dragons 提亚玛特 Tiamat 被囚禁在这一层中，她保留了自己的统治领域但被阿斯蒙蒂斯以某些远古契约限制在九狱之中（契约条款的具体有效时间只有提亚玛特和九位领主知晓）。
扎瑞尔的权力宝座是一座高耸的玄武岩城堡，上面装饰着一些部分烧焦的尸体，他们都是些没能得到女大公青睐的访客。扎瑞尔的形象是一名曾经有着美丽肌肤与翅膀，但现在都已经被火焰摧毁的天使。她的眼睛燃烧着一股狂暴的白光，甚至可能让那些看向她的生物突然燃烧起来。

迪斯 Dis。迪斯是九狱的第二层，是一个迷宫般的峡谷。它位于陡峭的群山之间，蕴含着丰富的铁矿石。钢铁的道路跨越峡谷穿梭其中，并由锯齿状山顶上俯瞰的铁之堡垒看守着。
第二层的名字取自它的现任领主迪斯帕特 Dispater。作为一名操纵者和骗子，这名大公非常英俊。除了长着小小的角，一条尾巴，和一条分叉的左蹄外，其他特征与人类相仿。他深红的宝座矗立在九狱中最大的可怕大都市——铁城迪斯 IronCity of Dis 的中心。位面旅者会来这里与魔鬼密谋，并与夜鬼婆 night hag、邪兽鬼 rakshasas、梦魔 incubi、魅魔 succubi或其他邪魔达成交易。迪斯帕特通过特殊的契约来收集每一笔交易，而这些契约都签署于其自己的九狱层级中。
迪斯帕特是阿斯蒙蒂斯最忠诚和足智多谋的下属之一，多元宇宙中很少有人能比他更聪明。他比大多数魔鬼都更着迷于与凡人达成交易以换取他们的灵魂，而他的使者也不知疲倦地在物质位面中孕育邪恶的计划。

弥瑙洛斯 Minauros。九狱的第三层是个充斥着腐臭的沼泽。酸性雨水从该层级棕色的天空中落下，厚厚一层浮渣覆盖着它恶臭的地表，黑暗下还潜伏着大口的陷坑等待吞噬粗心的流浪者。巨石刻成的庞大城市在沼泽中拔地而起，其中还包括伟大的弥瑙洛斯城 Minauros，也正是该层级名称的来由。
城市黏糊的城墙向空中升起数百尺，保护着浸没在水中的玛门 Mammon 之殿堂。弥瑙洛斯的大公长得如同一条巨大的蛇，其前端连着上身以及一张无毛长角的类人面孔。玛门的贪婪已成为传奇的，还是少数几个愿意用金子代替灵魂的大魔鬼之一。他的巢穴里堆满了遗留下的宝藏——那些打算在交易赢过他，却最终失败的人留下的遗物。

弗莱格索斯 Phlegethos。第四层的弗莱格索斯是一番炽热的景观，其熔岩海洋由炽热的风、令人窒息的烟雾和火山碎屑形成的。在弗莱格索斯最大的火山喷发口内，崛起着一座由黑曜石和黑玻璃建成的堡垒式城市，阿布里莫克 Abriymoch。随着熔岩从外墙涌出，这座城市就像一座巨大的地狱式喷泉的中心雕刻。
阿布里莫克是两个轮班统治弗莱格索斯的大魔鬼的权力宝座，他们分别是：大公贝利亚 Belial，以及他的女儿，女大公菲尔娜 Fierna。贝利亚是个面容英俊，体格健壮的魔鬼，他表现着文明的礼貌，却时常语带隐晦的威胁。他的女儿是一个如同雕塑一般的魔鬼，她的美丽包裹着九狱中最黑暗的心灵。贝利亚和菲尔娜的联盟牢不可破，因为他们都意识到自己的生存正是依赖这种同盟关系。

斯泰吉亚 Stygia。九狱的第五层是冰冻的冰域，其中还燃烧着冰冷的火焰。一片冰冻的大海包围着这一层，而其阴郁的天空时刻爆发着劈啪的闪电。
大公莱维思图斯 Levistus 曾经背叛阿斯蒙蒂斯，现在则被深深的包裹在斯泰吉亚的寒冰中接受惩罚。而他也以同样的方式统治者该层级，并通过心灵感应向其在九狱和在物质位面的追随者和仆从们进行联络。
斯泰吉亚的其前任统治者，阴险的大魔鬼格殷永 Geryon也在此安家。他被阿斯蒙蒂斯解雇，并让被监禁的莱维思图斯接替其统治。格殷永的倒台，在地狱法庭中引发了许多争论。
没人能确定阿斯蒙蒂斯是否因某些秘密理由而解除这个大魔鬼的职务，又或者他是否为了某些更重要的目的而测试格殷永的忠诚。

玛尔博吉 Malbolge。第六层玛尔博吉，已经经历过许多任统治者，其中包括鬼婆女伯爵 the Hag Countess 马拉嘉德Malagard 和大魔鬼摩洛克 Moloch。马拉嘉德失宠后被阿斯蒙蒂斯愤怒的拉下台，而她的前任摩洛克，则仍然在第六层的某地徘徊，试图重获阿斯蒙蒂斯的支持。玛尔博吉是一个看似无穷无尽的斜坡，就像一座无比巨大的高山的侧坡。该层级不时产生部分脱落，并造成震耳欲聋的致命山崩。马尔博吉的住民们都生活在山体上的破碎堡垒和巨大洞窟中。
马尔博吉的现任女大公是阿斯蒙蒂斯的的女儿格莱西雅Glasya。她就像一只魅魔 succubus 一样长着小角、皮翼和分叉的尾巴。她从父亲那里继承了残忍，以及对黑暗计划的热忱。
作为她住所的城堡建在马尔博吉的斜坡上，用有裂纹的支柱和扶壁支撑着。这些支撑非常牢固，却又似乎处于崩溃的边缘。
宫殿的下方是一个迷宫，其内建有牢房和刑室，格莱西雅会在这里禁闭和折磨那些让她不悦的人。

马拉多米尼 Maladomini。第7层马拉多米尼被一片废土所覆盖。死亡的城市形成了一副荒凉的城市景观，其中有空旷的采石场，破碎的道路，矿渣堆，掏空的堡垒外墙，和成群的饥饿苍蝇。
马拉多米尼的大公是飞虫领主 Lord of Flies，巴尔泽布Baalzebul。巴尔泽布浮肿的邪魔身体下长着庞大的蛞蝓下身，由于对阿斯蒙蒂斯的忠诚有所动摇，这幅身躯便是对其所为的惩罚。巴尔泽布是一个可悲的堕落者，他长期以来一直密谋篡夺阿斯蒙蒂斯的地位，却在每一次都以失败告终。他带着一种诅咒，使的任何与其达成的契约都终将导致灾难发生。阿斯蒙蒂斯偶尔会以其他大公都难以理解的原因青睐巴尔泽布，尽管有人心存疑虑，但奈瑟斯的大公仍然一如既往的尊重这个堕落对手的价值。

卡尼亚 Cania。九狱第八层卡尼亚是一个冰冻的地狱，其的冰风暴甚至可以从骨头上撕下血肉。那些嵌入在冰中的城市为卡尼亚统治者——才华洋溢，精于暗算的大魔鬼梅菲斯特 Mephistopheles 提供了一个用以会客和囚禁的场所。
梅菲斯特住在冰堡梅菲斯塔 Mephistar 中，并在其中密谋夺取巴塔的王位以征服整个位面。他是阿斯蒙蒂斯最大的敌人兼盟友，而纳瑟斯的大公似乎总是相信梅菲斯特提供的建议。墨菲斯特知道，在他的对手出现严重误判之前，自己不可能把阿斯蒙蒂斯拉下台。因此两人都在等待时机，等待足以令其与对方转为对立的情况。梅菲斯特对于格莱西雅是类似教父的存在，着是的双方的关系变得更加复杂。
梅菲斯特是一个引人注目的高大魔鬼，他举止冷静并长着让人印象深刻的犄角。他和其他大魔鬼一样经营着灵魂的交易，但却很少把时间花在那些个人认为不值注意的生物上。
他的知觉像卡尼亚的寒风一样锐利，据说只有阿斯蒙蒂斯一人成功欺骗或阻挠过他。

奈瑟斯 Nessus。九狱最底层奈瑟斯是一个黑暗的深坑，其峭壁上设置着堡垒。忠于阿斯蒙蒂斯的深狱炼魔将军们在这里与他们的恶魔军团策划着征服多元宇宙的阴谋。在该层级的中心，立着一条深不可测的裂隙，其内升起了伟大的尖塔城堡马尔谢姆 Malsheem，正是阿斯蒙蒂斯和他的地狱议会安家之地。
马尔谢姆就像一个巨大的中空的石笋。城堡同时也是一座监狱，用以囚禁那些阿斯蒙蒂斯出于安全考虑必须关押的灵魂。说服他释放里面的灵魂必须付出相当高昂的代价，传说奈瑟斯的大公曾经要求用一整个王国作交换。
阿斯蒙蒂斯时常以一个留着胡须的英俊类人形象出现，他的额头长着一个小角，眼睛刺红，并穿着飘逸的长袍。他还会显现出其他形象但甚少看到他不带手中的红宝石权杖。阿斯蒙蒂斯是最狡猾、最彬彬有礼的大魔鬼。他所代表的终极邪恶，只有在他主动表现，又或者在他不能自已的暴跳如雷时，才会直接从他身上看到。

修罗场 Acheron
修罗场 Acheron（或译阿刻戎）有四个层级，每一层都由漂浮在空中的大量铁块构成。铁块有时会互相碰撞。碰撞的回声萦绕在整个位面并与军队的交锋声混在一起。这便是修罗场的本质：冲突与战争，即是阵亡士兵的精魂加入无尽的战场中。他们的对手包括拥护格乌什 Gruumsh 的兽人，忠于马格鲁比耶 Maglubiyet 的类地精，以及由其他好战神灵所集结的军团。

选用规则：嗜血 Bloodlust
修罗场给伤害其他生物者提供奖励，并以此鼓励他们持续的去战斗。身处修罗场的生物将某一敌对生物的生命值降至 0 时，将获得等同于其自身生命值上限一半的临时生命值。

机械境 Mechanus
在机械境 Meehanus 中，守序反映为一个钟表齿轮运转的领域，所有的人都遵循自己的标准相互交错转动。齿轮们仿佛参与了一项庞大无比的计算，庞大到没有任何神灵能够理解这场运输的目的。机械境具现了绝对的秩序，并使那些停留此处的人感受到其影响。
魔冢 modron 是机械境的主要居民。该位面也是魔冢创造者的家：一个称作奇点 Primus，近乎神灵的存在。

选用规则：平均法则 Law of Averages
在机械境中，生物总是使用平均伤害来结算攻击和法术。例如，通常使用 1d10+5 的攻击伤害在机械境中直接取 10。

选用规则：强制秩序 Imposing Order
非守序中立的旅行者在该位面完成一次长休后，必须进行一次 DC10 的感知豁免。豁免失败时，该生物阵营变为守序中立。该生物在非机械境的位面中逗留一天时间后，将恢复去本来的阵营。对该生物施展法术反制善恶 dispel evil and good也可以恢复其原来的阵营。

世外桃源 Arcadia
世外桃源 Arcadia（或译阿卡迪亚）的繁荣之处在于：树木整齐林立，笔直的溪流，有序的田野，完美的道路，以及按几何形状排列的城市。被侵蚀的山体也依然完美无缺。世外桃源的一切都是为着共同的美好和完美的存在。在这里，纯粹即是永恒，也没有任何东西可以打破和谐。
黑夜和白昼由一个漂浮在世外桃源最高峰的宝珠决定。宝珠的一半散发着阳光，以带来了白昼；另一半则洒下月光并带来星夜。宝珠匀速旋转，使整个位面保持不间断的昼夜更替。
世外桃源的天气由四个称为风暴之王 Storm Kings 的半神掌管：云王 Cloud King、风后 Wind Queen、电王 LightningKing 和雨后 Rain Queen。每一位都住在各自的城堡里，周围还环绕着所控制的相应天气。
世外桃源美丽的山脉下隐藏着经受千年考验的无数矮人王国。在该位面出生的矮人属于天界生物类别且总是勇敢而善良，不过除此之外，他们的长相和行为就像普通的矮人一样。

选用规则：位面活力 Planar Vitality
该位面中的生物不会陷入恐慌或中毒状态，同时还可以免疫疾病和中毒。
"""
other_planes_article = """
其他位面 Other Planes
在各位面之间或之外还存在着许多各异的领域。
外域和印记城 The Outlands and Sigil外域 Outlands 是诸外层位面之间的位面。作为一个中立位面，它纳入了所有东西的一小部分，并将所有的方面都保持在一个矛盾的平衡中——既和谐又对立。该位面中有不同的地形，如大草原、山脉和浅河。
外域是一个圆环，就像一个巨大的盘子。事实上，那些将诸外层位面的形象比作一个轮子的人，正是将外域当作证据，并将其称为诸位面的缩影。正因为先发现了外域的构造，再以此为灵感而提出巨轮的概念，使得这种理论有着循环论证的嫌疑。
围绕圆的外围边缘间隔均匀的排布着诸门镇：也即是十六个聚居地，每个门镇都建在一个通往某一外层位面的传送门周围。每个城镇都与其所在传送门指向的位面有着许多相同的特征。位面使者们时常在这些城镇中露脸，所以时常会在这里考到一些奇怪的人物组合，比如一名天界生物和一名邪魔会在酒馆中争吵的同时，还分享着同一瓶红酒。
考虑到你可以在外域里骑着马从天堂走到地狱，你确实可以在不考虑位面旅行的情况下，在这里设定一个位面主题的战役。外域可以让诸外层位面显得更像是物质位面中的一个世界。

外域的门镇 Gate-Towns of the Outlands
城镇 门扉目的地
精准镇 Excelsior 天界山 Mount Celestia 的七层天堂
商贸镇 Tradegate 双生天堂 Bytopia 的孪生伊甸
狂欢镇 Ecstasy 极乐境 Elysium 祝福之地
动物镇 Faunel 万兽园 The Beastlands 的无尽荒野
森林镇 Sylvania 奔放之野 Arborea 的奥林匹亚林地
荣光镇 Glorium 约瑟园 Ysgard 的英雄领域
混乱镇 Xaos 混沌海 Limbo 的永恒混乱
动乱镇 Bedlam 喧癫空隧 Pandemonium 的风啸深渊
瘟镇 Plague-Mort 无底深渊 the Abyss 的无限层级
科斯特 Curst 卡瑟利 Carceri 的流放深渊
无望镇 Hopeless 哈迪斯 Hades 的灰色荒野
火炬镇 Torch 焦炎地狱 Gehenna 的永恒旷野
肋骨笼镇 Ribcage 九层地狱 Nine Hells 巴托 Baator
严苛镇 Rigus 修罗场 Acheron 的地狱战场
自动镇 Automata 机械境 Mechanus 的钟表涅槃
坚忍镇 Fortitude 世外桃源 Arcadia 的和平国度

众门之城 City of Doors，印记城 Sigil
外域的中心，像巨轮的轴一样矗立着无极尖峰 Spire——即一座参天的针状山峰。山峰狭窄的峰顶漂浮着环状的印记城 Sigil。各种建筑物都建造在环状体的内侧，站在印记城街道上的生物可以看到城市向远处逐渐卷曲向上，而其最远端甚至直接倒挂在头顶，让人产生一种强烈的不安。这个熙熙攘攘的位面大都市拥有无数通往其他位面与世界的传送门，因此也被称作众门之城 City of Doors。
印记城是商人的天堂。各个位面的货物、商品和情报都聚集于此。在城中，位面相关情报的交易相当活跃，特别是关乎操作特定传送门所需的命令语和特殊物品等信息更是不胫而走。各种传送门的钥匙也会在这里进行买卖。
这座城市是神秘莫测的痛苦女士 Lady of Pain 之领地，其存在如众神一样古老，而其心思连城中的智者们都不得而知。
难道印记城是她的牢笼？她是多元宇宙的创造者吗？没人知道答案。就是有人知道，他们也不会公之于众。

半位面 Demiplanes
半位面是以各种方式形成的扩展空间，其内甚至拥有自己的物理法则。其中的某些由法术创造，另一些则是作为从多元宇宙其余部分分离出来的现实褶皱的天然存在。法术异界传送 plane shift 理论上可以带着旅行者进入半位面，但事实上找到与之同调的音叉频率非常困难。如果施法者熟悉相应的半位面，则使用法术异界之门 gate 更为可靠。
半位面可以小如一个小房间，或是大到足以容纳整个王国。例如，法术摩登肯豪宅术 Mordenkainen’s MagnificentMansion 可以创造一座带有多个房间的华丽宅邸型半位面，而一整个巴若维亚 Barovia 大陆（属于鸦阁魔域 Ravenloft 设定）则在吸血鬼领主，斯托德·冯·扎洛维奇 Strahd von Zarovich的影响下完整的存在一个半位面中，人们可以简单的通过踏入一扇传送门或是穿越一堵迷雾之墙来进入其中。

遥远国度 The Far Realm
遥远国度 Far Realm 在已知的多元宇宙之外。事实上，它可能是一个完全独立的宇宙，甚至有它自己的物理和魔法法则。当来自遥远国度的杂散能量泄露到另一位面时，物质将被扭曲成异界形状，甚至违背几何学与生物学而变得不可描述。
像夺心魔 mind flayer 和眼魔 beholder 这样的异怪，可能就是来自这个位面，或是起源于它的影响。
由于过于奇异，以普通的正常心智无法简单无压力的接受遥远国度内的存在实体。那空无一物的虚无里游荡着庞大的生物，还有难以言喻之物低语着无人胆敢倾听的可怕真理。
在凡人看来，对遥远国度的认知是一种意识的争斗，必须克服物质、空间和理智的界限。一些邪术师会通过与这些实体建立契约来面对这种争斗。那些见过遥远国度的人，嘴中都会嘟哝着眼睛、触须和恐怖。
遥远国度没有广为人知的传送门，或者至少没有一个现存可用。远古精灵曾在一座名为火暴峰 Firestorm Peak 的山中开辟了通往遥远国度的巨大传送门，而他们的文明却最终崩溃在血腥的恐怖中，而传送门的所在地（甚至连同它所在的世界一起）被长远的遗忘。这些失传的传送门可能仍然存在，甚至被异域魔法所标记并不断转变着其周围的区域。
物质位面中的已知世界 KnownWorlds of the Material Plane物质位面的各世界无尽多彩。最广为人知的世界是那些多年来作为 D&D 游戏官方战役设定的出版物。如果你的战役发生在这些世界中的一个，那这个世界就属于你自己的战役。
而你对世界的看法也可以跟印刷在册的版本有着大大差异。
在托瑞尔 Toril（被遗忘国度 Forgotten Realms 设定的英雄奇幻世界），奇幻的城市和王国建立在远古帝国和被遗忘国度的废墟中。这个世界非常庞大，它的地下城也有丰富的历史。 除中央大陆费伦 Faerun 外，托瑞尔还包括阿拉丁 Al-Qadim、卡拉图 Kara-Tur 和马兹特克 Maztica 等地区。
在奥斯 Oerth（灰鹰 Greyhawk 设定的剑与魔法世界），像毕格比 Bigby 和摩邓肯 Mordenkainen 这样的英雄的动机都是贪婪或野心。领域的中枢是一座名为法兰尼斯 Flanaess的灰鹰自由城市 Free City of Greyhawk，同时也是一座充满冒险的，恶棍与大法师的城市。而邪恶半神伊乌兹 Iuz 则在北方统治着他噩梦般的王国，并威胁着所有文明。
在克莱恩 Krynn（龙枪 Dragonlance 设定的史诗奇幻世界），由于恶龙女王塔克丝斯 Takhisis 和她的龙与巨龙军团的崛起，众神的回归蒙上了阴影，而安塞隆 Ansalon 大陆也因此陷入了战争。
在阿塔斯 Athas（浩劫残阳 Drak Sun 设定的剑与魔法世界），一滴水的价值比人的性命更有价值。众诸神已经放弃这个沙漠世界。强大的巫王们 sorcerer-kings 在这里经营着自己的暴君统治，而金属则成为了一种稀有而珍贵的商品。
在艾伯伦 Eberron（艾伯伦设定的英雄奇幻世界），一场可怕战争的结束，引发了一场从政治阴谋开始的冷战。在魔法随处可见的科瓦雷 Khorvaire 大陆上，几个龙纹家族也在为王国的大权互相竞争，而此时元素动力的交通工具已经令到达世界的每个角落的旅行成为可能。
在艾伯莱尼斯 Aebrynis（天赋神权 Birthright 设定的英雄气坏世界），从神圣的血统中诞生的子嗣们，瓜分了瑟里利亚 Cerilia 大陆。君主、教会领袖、公会会长和大法师们分担着统治职能，并对抗从某个邪神之血中诞生的可怕威胁。
在密斯塔拉 Mystara（早期版本 D&D 游戏中诞生的英雄奇幻世界），各种文化，蛮荒怪物和敌对帝国相互碰撞。世界的进一步改变维系于那些不遗余力干涉其中的不朽者们Immortals——即那些现已获得神格的前冒险者们。
"""


article = {

}