# encode = utf-8\

article_creating_nonplayer_characters = """
# 第 4 章：创建非玩家角色 Creating Nonplayer Characters
非玩家角色是由地下城主控制的角色，简称 NPC。NPC 可以是敌人也可以是盟友，可以是普通的村民也可以是定名的怪物。他们包括当地旅店的老板，住在城外的塔楼的老法师，前去摧毁王国的死亡骑士，和在深窟老巢里数着金子的巨龙。
本章介绍如何为游戏填充非玩家角色。而为 NPC 生成与怪物资料相似的资料板的指引，请参阅第 9 章“城主工坊”。

# 设计非玩家角色 Designing NPCs
一群开发妥当的 NPC 是最能让冒险与战役真实生动的好材料。话虽如此，游戏中的 NPC 其实不太需要像小说或电影中那些精心制作的角色一样复杂。大多数 NPC 在战役中都只是作为小角色，冒险者们才是其中的主角。

# 简洁角色 Quick NPCs
除那些构成威胁的角色外，NPC 们大多都不需要战斗资料。而大多数的 NPC 只需要有一两种足够让人留下印象的素质。比如，玩家们一定会深深记得那个右肩纹着黑玫瑰且讲话直截了当的铁匠，还有那个鼻梁崩塌衣着破烂的吟游诗人。

# 详实角色 Detailed NPCs
还有一些在你的冒险里扮演着重要角色的 NPC，会让你花费更多的时间为其充实经历和个性。以十句概括下列每项的句子来概括一名令人印象深刻的 NPC 所具备的基本要素：
• 工作与来历
• 外貌
• 属性
• 天赋
• 癖好
• 与人互动
• 有用知识
• 理想
• 牵绊
• 缺点或秘密
虽然这里所述的材料主要针对类人生物 NPC，但你也可以作一些细节调整并将其应用于怪物型 NPC。

# 工作与来历 Occupation and History
以一句话描述 NPC 的职业，和一段提示该角色过往的简短记录。例如，该 NPC 可能曾在军队服役，曾因犯罪入狱，或经历过多年的冒险。

# 外貌 Apperance
以一句话描述 NPC 最具特色的身体特征。你可以按表格“角色外貌”掷骰或者从中选择一个适合该角色的特征。

# d-20 角色外貌 NPC Appearance
d20 NPC 特征
1 独特的珠宝：耳环、项链、戒指、手镯
2 身体穿刺饰品
3 华丽或古怪的衣着
4 正式、干净的衣着
5 褴褛、肮脏的衣着
6 明显的疤痕
7 缺牙
8 缺手指
9 罕见的瞳色（或异色瞳）
10 纹身
11 胎记
12 罕见的肤色
13 秃头
14 编头发或编胡子
15 罕见的发色
16 神经性眼睑痉挛
17 独特的鼻子
18 独特的姿势（驼背或僵直）
19 特别漂亮
20 特别丑

# 属性 Abilities
你不需要为 NPC 骰属性值，但要记录其比常见情况更低或更高的属性（比如力气很大，或蠢得出奇），并以此作为赋予 NPC 的素质。

# d-6 角色属性 NPC Abilities
d6 高属性
1 力量——有力，肌肉发达，健壮如牛
2 敏捷——轻盈，灵活，优雅
3 体质——结实，精神抖擞，健康
4 智力——学习勤勉，博学，好思
5 感知——观察敏锐，思维敏感，洞察力强
6 魅力——有说服力，据理力争，天生的领袖

d6 低属性
1 力量——虚弱无力，骨瘦如柴
2 敏捷——生硬无技巧，支吾笨拙
3 体质——病态，苍白
4 智力——缺心眼，慢半拍
5 感知——不警觉，心不在焉
6 魅力——枯燥，乏味

# 天赋 Talent
以一句话描述 NPC 可做到的特殊事。你可以按表格“角色天赋”掷骰或以此激发自己的想法。

# d-20 角色天赋 NPC Talents
d20 天赋
1 演奏一种乐器
2 流利的说若干种语言
3 难以置信的运气
4 完美记忆力
5 擅长对待动物
6 擅长对待孩子
7 擅长处理谜题
8 擅长某个游戏
9 擅长模仿表演
10 手绘非常漂亮
11 涂画非常漂亮
12 唱歌非常好听
13 把所有人都喝趴
14 木匠专家
15 烹饪专家
16 飞镖和投石游戏专家
17 杂耍专家
18 老练的演员和伪装大师
19 老练的舞者
20 掌握盗贼黑话

# 癖好 Mannerism
以一句话描述一种能让玩家记住 NPC 的癖好。你可以按表格“角色癖好”掷骰或以此创作自己的想法。

# d-20 角色癖好 NPC Mannerisms
d20 癖好
1 时常唱歌，吹口哨，或哼小调
2 用押韵或其他特殊的方式
3 音调特别低或特别高
4 口齿不清，大舌头，或口吃
5 突显吐字清晰
6 说话大声
7 耳语
8 用浮夸的词或长词
9 频繁使用错误的词
10 用华美的誓言和感叹
11 不断地讲笑话或双关语
12 时常预测末日
13 坐立不安
14 斜视
15 凝视远方
16 嚼东西
17 踱步
18 弹手指
19 咬指甲
20 撩头发或拽胡须

# 与人互动 Interactions with Others
以一句话描述 NPC 如何与他人互动，必要时可以使用表格“角色互动特质”。NPC 的行为会随其互动对象改变。例如，旅店老板可能对客人很友好，但对她的员工却很粗鲁。

# d-12 角色互动特质 NPC Interaction Traits
d12 特质
1 好辩
2 傲慢
3 咄咄逼人
4 粗鲁
5 好奇 
6 亲切
7 诚实
8 急躁
9 易怒
10 沉闷
11 安静
12 多疑

# 有用知识 Useful Knowledge
以一句话描述 NPC 拥有某些可能对玩家角色们有用的知识。NPC 可能知晓一些普通事如城中哪里最好的旅店，或者掌握一些重要事情如谋杀案的线索。

# 理想 Ideal
以一句话描述那些左右 NPC 大多数行为的那份理想。知晓 NPC 理想的玩家角色可以利用这点以社交手段影响该 NPC（如第 8 章“运作游戏”中描述）。
如表格“角色理想”所示，该项目可以与阵营相关联。此处的对齐关联只是一种建议，你完全可以为邪恶的角色设定一个美好的理想。

# d-6 角色理想 NPC Ideals
d6 善良理想 邪恶理想
1 美好 支配
2 慈善 贪婪
3 大义 力量
4 生命 痛苦
5 尊重 惩罚
6 自我牺牲 杀戮

d6 守序理想 混乱理想
1 团结 转变
2 公正 创造性
3 荣誉 自由
4 逻辑 自主
5 尽责 无下限
6 传统 稀奇古怪

d6 中立理想 其他理想
1 平衡 抱负
2 知识 发现
3 和平共存 荣耀
4 节制 国家
5 中立 报偿
6 人民 自知之明

# 牵绊 Bond
以一句话总结该 NPC 认为至关重要的人物、地方或事物。
表格“角色牵绊”中提供了一些比较泛义的建议。《玩家手册》中关于角色背景的探讨更详细的剖析了若干牵绊，而知晓 NPC 牵绊的玩家角色也可以利用这点以社交方式影响该 NPC（如第 8 章所述）。

# d-10 角色牵绊 NPC Bonds
d10 牵绊
1 致力于实现某个人人生目标
2 保护亲密的家人
3 保护同事或同胞
4 忠诚于金主、主顾或雇主
5 沉迷浪漫
6 被吸引前去某个特别的地方
7 保护某个情感纪念品
8 保护某个值钱的所有物
9 前往复仇
10 骰两次，并跳过骰值 10

# 缺点或秘密 Flaw or Secret
以一句话描述 NPC 的缺点（其个性或经历中某些可能劣化该角色的某些部分），或该 NPC 一直在隐瞒的某个秘密。
表格“角色缺点或秘密”中提供了一些想法。
《玩家手册》提供的诸多背景也可以用来创建更详细的缺点。知晓 NPC 缺陷或秘密的玩家角色也可以利用这点通过社交手段来影响该NPC（如第 8 章所述）。
怪物作非玩家角色 Monsters as NPCs冒险中扮演重要角色那些有名姓的怪物，理应跟类人生物 NPC 一样值得关注，并为其赋予理想、牵绊、缺点和秘密。
如果一只眼魔幕后管理着城市中的犯罪活动，就不要只靠《怪物手册》中的条目来描述该生物的外貌个性。不妨花多点时间为其安排一点背景，一个古怪独特的外貌特征，尤其可以为其设定一个理想、一个牵绊和一个缺点。
例如，你可以参考那个运作着深水城中各种大规模犯罪活动的眼魔，珊娜萨 Xanathr 阁下。珊娜萨的球形身躯上覆盖着皮革样的粗肉和鹅卵石似的纹理。它的眼柄有如昆虫节肢一样连着身躯，某些眼柄上还带着魔法指环。珊娜萨总是深思熟虑后再语速缓慢的发表讲话，还习惯不用主眼正眼看谈话的对象。它像所有眼魔一样将其他生物看作是下级者，不过它还懂得自己的类人生物手下各有用处。珊娜萨还会利用深水城下的下水道在城中或地下四通八达。
珊娜萨的理想是贪婪。它渴望拥有强大的魔法物品，围绕在黄金、铂金和珍贵宝石中。它的牵绊是它的巢穴——在深水城蜿蜒的下水道间开凿的一连串洞窟网络。它从其前任手中继承过来，却比任何一任珊娜萨更珍视这一切。它对异国风味玩乐（精心准备的食物，香油，以及稀有的香料和草药）毫无抵抗的缺点也成了它的弱点。
你可以基于这些信息扮演独特的珊娜萨阁下，而不是一只普通的眼魔。这些繁杂多彩的生物个性可以用于创作更多印象深刻的交互与有趣的故事。

# 角色资料 NPC Statistics
给 NPC 赋予游戏资料时，主要有三种方式：只给 NPC 赋予少量必要的资料，为 NPC 创建一个怪物资料板，或者给 NPC赋予一个职业和等级。后两种方式需要一点补充解释。

# 使用怪物资料板 Using a Monster Stat Block
《怪物手册》的附录 B 包含了许多通用的 NPC 资料，您可以根据自己的需要进行选用，而本书的第 9 章也提供了如何调整数据资料以创建新资料板的指引。

# 使用职业和等级 Using Classes and Levels
你可以将自己比做玩家角色，使用《玩家手册》中的规则来创建一位 NPC。你甚至可以用一张角色卡来跟进这名 NPC的重要信息。
职业选项 Class Options。除《玩家手册》上的职业选项外，这里还为邪恶玩家角色和 NPC 提供了两个额外的职业选项：死亡领域牧师和破誓者圣武士。这两个选项会在本章末尾详细说明。
装备 Equipment。大多数 NPC 不需要详尽的装备清单。一个在战斗中要面对的敌人需要武器和护甲，外加 NPC 所携带的任何宝藏（包括可能会用来对付冒险者们的魔法物品）。
挑战等级 Challenge Rating。一名为战斗而创建的 NPC需要一个挑战等级。使用第 9 章的规则确定 NPC 的挑战等级，具体就像设计怪物那样。
"""

article_NPC_party_members = """
# 非玩家角色队友 NPC Party Members
NPC 也有可能加入冒险的队伍中，他们会想要分享战利品，并愿意承担同样的风险，或者他们也可能会因忠诚、感激和爱慕等关系而跟随冒险者们。这样的 NPC 将由你控制，或者你也可以将控制转交给玩家。不过即使某玩家控制着 NPC，你也要确保该 NPC 被描绘成一个独立的角色，而不仅仅是玩家为自己利益而操纵的一个仆从。
任何与冒险者们相伴行动的 NPC 都视为队伍的成员，并一同分享所有的经验值。在决定战斗遭遇的难度时（见第 3章），也一定要包括所有的 NPC 队友。

# 低等级追随者 Low-Level Followers
你可以在自己的战役中允许玩家的角色们带上一些低等级的 NPC 作为追随者。例如，一名圣武士可以带上另一名 1级圣武士作扈从，一位法师也可以接受另一名 2 级法师作其学徒，一位牧师可以选择（或被委任）接受另一名 3 级牧师作为自己的侍僧，而一位吟游诗人也可能会带上一名 4 级吟游诗人作自己的演出替补。
低等级的角色加入队伍有一个好处，就是当玩家的主要角色无法工作，退役或死去时，自己可以有一个后备可用的角色。其缺点就是你和你玩家行动时必须考虑更多的队友。
由于低等级 NPC 队友也等量的分享 XP，因此他们会比冒险者们更快地提升等级（相当于在经验老道的老师身边学习的好处），最终甚至赶超这些冒险者。这也意味着冒险者们的提升在一定程度上有所放缓，因为他们必须与 NPC 分享经验，而 NPC 们则只承担冒险任务的一部分。
在高等级角色看来挑战难度合适的强大怪物，可以瞬间杀死或废掉一名低等级追随者。冒险者们应该准备好花费精力和资源来保护这些低等级的 NPC 队友，并在其受伤后为其提供治疗。

# 非玩家冒险者 Adventurer NPCs
如果玩家人数不够组成一支完整的队伍，你还可以用NPC 来填满队伍的空缺。这些 NPC 的等级必须与队伍中最低等级的冒险者相当，并按照《玩家手册》中创建与完善角色的规则来为其建卡（由你或你的玩家完成）。如果玩家们能帮忙创建并运作这些支援角色，你自己就能够轻松许多。
你可以鼓励玩家们在游戏中帮忙扮演这些支援角色，尽可能表现该 NPC 的个性特质、理想、牵绊和缺点，而不是让他们只当个问答机器人。如果感觉某个 NPC 描绘得不够好，你完全可以自己接受该 NPC 的控制权，然后将其交给另一个人，或者干脆让该 NPC 离队。
你可以自主限制这些 NPC 支援角色的职业选项以简化其运作。优秀的支援角色候选职业包括有生命领域的牧师，角斗士范型的战士，盗贼范型的游荡者，以及塑能学派的法师。

# 选用规则：忠诚度 Loyalty
忠诚度可选规则可以用来决定一名 NPC 队友会如何保护或帮助其他队友（即使对方是其不喜欢的人）。一名被虐待或被忽视的 NPC 队员可能会离弃或背叛队伍，而如果 NPC 欠角色们一条命或与他们目的一致时，则更会与之同生共死。这种忠诚度可以运用本规则来扮演或表述。

# 忠诚值 Loyalty Score
衡量一名 NPC 的忠诚度数值范围从 0 到 20。NPC 的忠诚值最高值等于队伍所有冒险者中魅力值最高者的数值，其起始忠诚值是该分值的一半。如果该最高魅力值发生变化（比如对应的角色死亡或者离开团体）则必须相应的调整该 NPC的忠诚值。

# 跟进忠诚度 Tracking Loyalty
你可以在私底下持续跟进一名 NPC 的忠诚值，这样玩家们就难以确定该 NPC 队友对自己是否忠诚（哪怕该 NPC 正由该玩家控制）。
如果其他队友帮助 NPC 完成与其牵绊相关的某个任务，则该 NPC 的忠诚值提升 1d4。如果 NPC 受到特别优待（比如赠予一把魔法武器作礼物）或者被另一名队友所救，该 NPC的忠诚值同样也提升 1d4。一名 NPC 的忠诚值永远不得超过其最大值。
当其他队员的行为与 NPC 的阵营或牵绊相违背时，该NPC 的忠诚值降低 1d4。如果该角色被其他队员以纯粹的个人原因施以虐待，误导或威胁，则该 NPC 忠诚值降低到 2d4。
NPC 的忠诚值降至 0 时将不再对队伍忠诚并与大家分道扬镳。忠诚值永远不会低于 0。
忠诚值为 10 或更高的 NPC 会冒生命或身体的危险去帮助队友。忠诚值为 1 到 10 的 NPC 其忠诚度相当薄弱。NPC的忠诚度降至 0 时将不再以队伍的最佳利益行事。不再忠诚的 NPC 要么离开队伍（并攻击那些企图干涉的角色），要么暗地里做手脚使整个队伍败落。

# 联络员 Contacts
联络员是一种与玩家角色紧密联系的 NPC。他们不会前去冒险，但他们可以有偿或无偿的提供情报、流言、补给和专业建议。
《玩家手册》中的某些背景为新手冒险者提供了联络员，角色们在其冒险生涯中也可能随时受这些联络员的帮助。
你只需要一个名字和一些自选的细节便可设定于联络员的相遇，随后还可以继续花时间充实这位联络人，尤其是那些某个时刻可能成为盟友或敌人的角色。或者说，你至少可以思考一下联络员自身的任务，以及这些任务如何在游戏中发挥作用。

# 主顾 Patrons
主顾即雇佣冒险者们的人，他会提供帮助或奖励，以及带出一些与任务和冒险相关的内容。大多数情况里，主顾都会尽全力的去帮助冒险者们达成目标，而不需要特别游说其提供帮助。
主顾可以是一位寻找年轻英雄应对不断升级危机的退休冒险者，或者是一位深知小镇守卫无法处理巨龙索要贡品的市长。一名治安官作为主顾悬赏威胁本地乡下地区的狗头人劫掠者，而一名贵族则作为主顾悬红清除一处废弃庄园中的怪物。

# 雇员 Hirelings
冒险者们可以在各种情况下付费给 NPC 以让其提供服务。
与雇员内容相关的信息见《玩家手册》第 5 章“装备”。
冒险中的雇员 NPC 不会很重要，也不需要过多的开发。
冒险者们雇一辆计程车带着自己穿越城镇，或者需要写一封书信时，司机或信使便是一位雇员，而冒险者们可能永远也不会和这位 NPC 接触，也不会提及他们的名字。带着冒险者们穿越大海的船长也是一名雇员，但这样的角色有可能在冒险展开的过程中成为一个盟友，一位主顾，或甚至成为一名敌人。
冒险者们雇佣一个 NPC 做长期工作时，应将该 NPC 的服务费加到角色们的生活开支中。请参阅第 6 章“冒险之余”的“额外费用”一节获得更多的相关信息。

# 小角色 Extras
小角色是很少与主要角色互动的背景人物和背景生物。
冒险者们可能会挑中某个小角色，并因此使其戏份提升而需要更重要的扮演。例如，一个玩家可能会对你提及的那个在街道上的年轻人提起兴趣，并试图与之谈话。而这位你并不重视的小角色忽然就因此变成了随后即兴扮演的中心人物。
小角色出场时都要随时准备好他的名字和言谈举止。时间紧迫时，你也可以从《玩家手册》第 2 章“种族”中借用角色种族的人物名字。

# 反派 Villains
反派们以自己的行动为英雄们制造工作需求。第 3 章可以帮你决定合适自己冒险的反派，而本节则帮你充实其邪恶计谋、手段与弱点。以下表格将激发你的灵感。

# 反派的计谋 Villain’s Scheme
# d-8 目标与计划
1 不朽 Immortality（d4）
  1 获得传奇物品来延长生命
  2 晋升神格
  3 成为不死生物或者获得一个年轻的身体
  4 偷走一个位面生物的精华
2 影响力 Influence（d4）
  1 夺取一个权位或头衔的位置
  2 赢取一次比试或竞技
  3 赢得一个强大个体的青睐
  4 将一名小卒安排到一个权力位置
3 魔法 Magic（d6）
  1 获取一件远古的神器
  2 组装一个构装体或魔法设备
  3 实现一个神祇的意愿
  4 向一名神祇供奉祭品
  5 连接一个失落的神祇或原力
  6 打开通向另一个世界的大门
4 骚乱 Mayhem（d6）
  1 兑现一个世界末日的预言
  2 作为一个神祇或主顾的复仇代理
  3 扩散一场邪秽的传染病
  4 推翻一个政府
  5 引发一场自然灾害
  6 灭绝一个血统或氏族
5 激情 Passion（d4）
  1 延长爱人的生命
  2 证明值得他人的爱
  3 复活或恢复死去的爱人
  4 为另一个人的感情摧毁竞争对手
6 权力 Power（d4）
  1 征服一个地区或煽动一场叛乱
  2 夺取一支军队的控制权
  3 成为王座的幕后掌权者
  4 获得统治者的青睐
7 复仇 Revenge（d4）
  1 为过去的羞辱或侮辱报仇
  2 为过去的监禁或受伤报仇
  3 为爱人之死报仇
  4 回收被偷的财物并惩罚偷取者
8 财富 Wealth（d4）
  1 控制自然资源或商贸
  2 嫁入豪门
  3 洗劫远古遗迹
  4 盗取土地、货物或金钱
  
# d-20 反派的手段 Villain’s Methods
d20 手段
1 破坏农业（d4）
  1 枯萎病
  2 作物减产
  3 旱灾
  4 饥荒
2 攻击和殴打
3 赏金狩猎或暗杀
4 抓捕或胁迫（d10）
  1 贿赂
  2 怂恿
  3 驱逐
  4 关押
  5 绑架
  6 合法的恐吓
  7 强征入伙
  8 阻挠
  9 苦役
  10 威胁或骚扰
5 信任诈骗（d6）
  1 违约
  2 出卖
  3 花言巧语
  4 难辨的阅读材料
  5 欺诈或欺骗
  6 吹嘘或骗局
6 污蔑（d4）
  1 下套诬陷
  2 流言蜚语或出言诬陷
  3 羞辱
  4 书面诽谤或侮辱
7 决斗
8 处决（d8）
  1 斩首
  2 木桩火刑
  3 活埋
  4 十字架钉刑
  5 吊剖分尸刑
  6 绞刑
  7 刺刑
  8 献祭（活体）
  9 效仿或伪装
10 说谎或作伪证
11 魔法骚乱（d8）
  1 闹鬼
  2 幻象
  3 地狱交易
  4 意识控制
  5 石化
  6 复生或活动的死者
  7 召唤怪物
  8 控制天气  
12 谋杀（d10）
  1 暗杀
  2 自相残杀
  3 肢解
  4 淹死
  5 电死
  6 安乐死（非自愿）
  7 疾病
  8 下毒
  9 刺死
  10 掐死或窒息
13 怠慢忽视
14 政治（d6）
  1 背叛或叛国
  2 密谋
  3 谍报或密探
  4 种族屠杀
  5 压迫
  6 提税
15 宗教（d4）
  1 诅咒
  2 亵渎
  3 伪神
  4 异端或异教
16 尾随
17 盗窃或财产犯罪（d10）
  1 纵火
  2 胁迫或强夺勒索
  3 入室行窃
  4 伪造物
  5 拦路抢劫
  6 趁乱抢劫
  7 行凶抢劫
  8 偷猎
  9 巧取豪夺
  10 走私
18 折磨（d6）
  1 强酸
  2 致盲
  3 火烙
  4 拉肢邢架
  5 拇指夹刑
  6 鞭刑
19 恶行（d4）
  1 通奸
  2 滥药或酗酒
  3 赌博
  4 诱奸
20 战争（d6）
  1 伏击
  2 入侵
  3 大屠杀
  4 雇佣兵出战
  5 叛乱
  6 恐怖主义

# 反派的隐秘弱点 Villain’s Secret Weakness
聪明的反派都会试图隐藏自己的弱点，而查明并揭露这些弱点肯定能让玩家们从中收获乐趣。例如，一只巫妖将其魂匣（其灵魂的魔法容器）妥善的藏好。而只有破坏该魂匣，才能彻底摧毁这只巫妖。

# d-8 反派的弱点 Villain’s Weakness
d8 弱点
1 一个容纳着反派灵魂的隐藏物件。
2 如果反派真爱的死仇得报，则他的力量也将被打破。
3 一个特定的神器出现时，该反派也将被削弱了。
4 用一把特殊的武器对付该反派时将造成额外的伤害。
5 说出该反派的真名就会将其摧毁。
6 一则远古的预言或谜语可以揭示如何推翻该反派。
7 如果一名远古的敌人原谅其过去的所为，则该反派将因此陨落。
8 如果很久以前定案的一场神秘交易得以完成，则该反派将因此失去它的力量。

# 反派职业选项 Villainous Class Options
你可以使用《玩家手册》中的规则如同创建玩家角色一样创建带职业和等级的 NPC。以下的两个职业选项可以让你创建两个特殊的反派范型：邪恶高阶祭司，以及邪恶骑士或反圣武士。
死亡领域是邪恶牧师可选的一个额外领域，而破誓者则则为那些从天恩陨落的圣武士提供了另一种选择。玩家也可以在你的同意下选用这些选项。

# 牧师：死亡领域 Death Domain
死亡领域关注的是导致死亡的原力，以及唤起不死生物的负能量。其神祇诸如奇魔须 Chemosh、米尔寇 Myrkul 和维婕丝 Wee Jas 等，都是死灵法师、死亡骑士、巫妖、木乃伊领主和吸血鬼的守护神。死亡领域的神灵还具现为谋杀（阿努比斯 Anubis、巴尔 Bhaal 和匹里麻斯 Pyremius），痛苦（鲁兹Iuz 或劳薇塔 Loviatar），疾病或毒药（英凯布居罗斯 Incabulos、塔洛娜 Talona 或魔吉安 Morgion），和冥界 underworld（哈迪斯 Hades 和赫尔 Hel）。

# table 死亡领域法术 Death Domain Spells
牧师等级 法术
1st 虚假⽣命 false life，致病射线 ray of sickness
3rd 目盲/⽿聋术 blindness/deafness，衰弱射线 ray of enfeeblement
5th 操纵死⼫ animate dead，吸⾎⿁之触 vampiric touch
7th 枯萎术 blight，防死结界 death ward
9th 防活物护罩 antilife shell，死云术 cloudkill

# 附赠熟练项 Bonus Proficiency
该牧师在第 1 级选择该领域时将获得军用武器的熟练项。

# 收割者 Reaper
第 1 级时，该牧师可以从任意法术列表中选择学习一个死灵戏法。该牧师施展一个通常指定一个生物为目标的死灵戏法时，则该法术现在可以指定施法距离内两个相互之间距离不超过 5 尺的生物。

# 引导神力：死亡之触 Touch of Death
第 2 级起，该牧师可以用引导神力特性并通过触碰来摧毁另一生物的生命力。
该牧师以近战攻击命中一个生物时，可以使用引导神力对该目标造成额外的黯蚀伤害。该伤害值等于 5＋其牧师等级两倍的数值。

# 命定毁伤 Inescapable Destruction
第 6 级起，该牧师引导负能量的能力更为有效。该角色的牧师法术与引导神力选项所造成的黯蚀伤害将无视对黯蚀伤害抗性。

# 神圣打击 Divine Strike
第 8 级时，该牧师可以使其武器打击充满负能量。该牧师在每个其自己回合里有一次机会，可以在用武器攻击命中某生物时额外造成 1d8 的黯蚀伤害。第 14 级时，该伤害提升到 2d8。

# 精通收割者 Improved Reaper
第 17 级起，该牧师施展一个 1 至 5 环的死灵法术时，若该法术只指定一个生物为目标，则将其改为指定施法距离内相互之间距离不超过 5 尺的两个生物。如果该法术消耗其材料构材，则该牧师必须为每个目标提供一份耗材。

# 圣武士：破誓者 Oathbreaker
成为破誓者的圣武士打破了自己的神圣誓言，而去追求黑暗的野心或为邪恶力量服务。圣武士心中燃烧的光耀已经熄灭，只剩下一片黑暗。
只有至少达到 3 级的邪恶圣武士才能成为一名破誓者。
该圣武士将用破誓者特性替换其所有对应神圣誓言的特性。
破誓者法术 Oathbreaker Spells
一名破誓者圣武士失去所有之前获得的圣誓法术，并在达到相应圣武士等级时获得下列破誓者法术作为替代。

# table 破誓者法术 Oathbreaker Spells
圣武⼠等级 法术
3rd 炼狱叱喝 hellish rebuke，致伤术 inflict wounds
5th 疯狂冠冕 crown of madness，⿊暗术 darkness
9th 操纵死⼫ animate dead，降咒 bestow curse
13th 枯萎术 blight，困惑术 confusion
17th 疫病术 contagion，⽀配⼈类 dominate person

# 引导神力 Channel Divinity
第 3 级或更高等级的破誓者圣武士可以获得以下两个引导神力选项。
控制亡灵 Control Undead。 作为一个动作项，该圣骑士指定其身边 30 尺内一个他能看见的不死生物。该目标必须进程一次感知豁免。豁免失败时，该目标必须在随后的 24 小时里遵从该圣武士的命令，或者直至该圣武士在此使用该引导神力选项为止。挑战等级等于或高于该圣武士等级的不死生物免疫该效应。
恐怖显现 Dreadful Aspect。 作为一个动作项，该圣骑士引导最黑暗的情感并将其凝聚爆发为一场魔法的胁迫之息。该圣骑士周边 30 尺内，其指定的每个能看到该圣武士的生物必须进行一次感知豁免。豁免失败的目标将陷入 1 分钟对该圣武士恐慌的状态。因该效应陷入恐慌的生物如果在距离该圣武士 30 尺外的位置结束其自己回合，则其可以尝试再进行一次该感知豁免，豁免成功则终止其自己身上的该效应。

# 憎恨灵光 Aura of Hate
第 7 级起，该圣武士本身，以及其身边 10 尺内的所有邪魔和不死生物，都将获的与该圣武士魅力调整值相同（至少为+1）的近战武器伤害掷骰加值。一个生物一次只能从一名圣武士的该特性中获益。第 18 级时，该灵光的覆盖范围增加至 30 尺。

# 超然抗性 Supernatural Resistance
第 15 级时，该圣骑士获得对非魔法武器的钝击、刺穿、挥砍伤害的抗性。

# 恐惧之王 Dread Lord
第 20 级时，作为一个动作项，该圣骑士可以使自己在 1分钟内环绕于阴郁的灵光中。该灵光可以将该圣武士周边 30尺半径的亮光光照减弱为微光光照。任何受该圣武士恐慌的敌人在该灵光内开始其自己回合时将受到 4d10 的心灵伤害。
此外，该圣武士以及由其指定的身处灵光中的生物都将笼罩于更深的幽影中。依赖视觉的生物对笼罩于该幽影中的生物发动攻击检定时具有劣势。
灵光持续时，该圣骑士可以在其自己回合内用一个附赠动作令该灵光内的幽影攻击一个生物。该圣武士对该目标发动一次近战法术攻击。若攻击命中，则该目标受到的黯蚀伤害等于 3d10＋该圣武士的魅力调整值。
激活该灵光后，该圣骑士必须完成一次长休才能再次使用该特性。

# 破誓者的救赎 Othbreaker Atonement
如果你允许玩家选择破誓者选项，那你之后就可以允许这名圣武士赎罪，再次成为真正的圣武士。
希望赎罪的圣武士必须先脱离邪恶阵营，并以其言行证明这一点。此时，该圣武士将失去所有的破誓者特性，且必须选择其守护神和神圣誓言。（若你允许，玩家可以选择与堕落前不同的守护神或神圣誓言。）然而，这名圣武士并不能立刻重获其圣誓特性，直至他完成一项危险的任务或试炼——具体内容由 DM 决定。
再次背弃誓言的圣武士可以再次成为一名破誓者，但再无赎罪的机会。
"""
